[
  {
    "title": "Exactly solvable dissipative dynamics and one-form strong-to-weak spontaneous symmetry breaking in interacting two-dimensional spin systems",
    "abstract": "We study the dissipative dynamics of a class of interacting \"gamma-matrix\" spin models coupled to a Markovian environment. For spins on an arbitrary graph, we construct a Lindbladian that maps to a non-Hermitian model of free Majorana fermions hopping on the graph with a background classical $\\mathbb{Z}_2$ gauge field. We show, analytically and numerically, that the steady states and relaxation dynamics are qualitatively independent of the choice of the underlying graph, in stark contrast to the Hamiltonian case. We also show that the exponentially many steady states provide a concrete example of mixed-state topological order, in the sense of strong-to-weak spontaneous symmetry breaking of a one-form symmetry. While encoding only classical information, the steady states still exhibit long-range quantum correlations. Afterward, we examine the relaxation processes toward the steady state by numerically computing decay rates, which we generically find to be finite, even in the dissipationless limit. We however identify symmetry sectors where fermion-parity conservation is enhanced to fermion-number conservation, where we can analytically bound the decay rates and prove that they vanish in the limits of both infinitely weak and infinitely strong dissipation. Finally, we show that while the choice of coherent dynamics is very flexible, exact solvability strongly constrains the allowed form of dissipation. Our work establishes an analytically tractable framework to explore nonequilibrium quantum phases of matter and the relaxation mechanisms toward them."
  },
  {
    "title": "Exactly solvable many-body dynamics from space-time duality",
    "abstract": "Recent years have seen significant advances, both theoretical and experimental, in our understanding of quantum many-body dynamics. Given this problem's high complexity, it is surprising that a substantial amount of this progress can be ascribed to exact analytical results. Here we review dual-unitary circuits as a particular setting leading to exact results in quantum many-body dynamics. Dual-unitary circuits constitute minimal models in which space and time are treated on an equal footings, yielding exactly solvable yet possibly chaotic evolution. They were the first in which current notions of quantum chaos could be analytically quantified, allow for a full characterisation of the dynamics of thermalisation, scrambling, and entanglement (among others), and can be experimentally realised in current quantum simulators. Dual-unitarity is a specific fruitful implementation of the more general idea of space-time duality in which the roles of space and time are exchanged to access relevant dynamical properties of quantum many-body systems."
  },
  {
    "title": "PSDiffusion: Harmonized Multi-Layer Image Generation via Layout and Appearance Alignment",
    "abstract": "Diffusion models have made remarkable advancements in generating high-quality images from textual descriptions. Recent works like LayerDiffuse have extended the previous single-layer, unified image generation paradigm to transparent image layer generation. However, existing multi-layer generation methods fail to handle the interactions among multiple layers such as rational global layout, physics-plausible contacts and visual effects like shadows and reflections while maintaining high alpha quality. To solve this problem, we propose PSDiffusion, a unified diffusion framework for simultaneous multi-layer text-to-image generation. Our model can automatically generate multi-layer images with one RGB background and multiple RGBA foregrounds through a single feed-forward process. Unlike existing methods that combine multiple tools for post-decomposition or generate layers sequentially and separately, our method introduces a global-layer interactive mechanism that generates layered-images concurrently and collaboratively, ensuring not only high quality and completeness for each layer, but also spatial and visual interactions among layers for global coherence."
  },
  {
    "title": "A comprehensive exploration of interaction networks reveals a connection between entanglement and network structure",
    "abstract": "Quantum many-body systems are typically studied assuming translational symmetry in the interaction network. Recent experimental advances in various platforms for quantum simulators have enabled the realization of irregular interaction networks, which are intractable to implement with conventional crystal lattices. Another hallmark of these advances is the ability to observe the time-dependent behaviour of quantum many-body systems. However, the relationship between irregular interaction networks and quantum many-body dynamics remains poorly understood. Here, we investigate the connection between the structure of the interaction network and the eigenstate entanglement of the quantum Ising model by exploring all possible interaction networks up to seven spins. We find that the eigenstate entanglement depends on the structure of the Hilbert space diagram, particularly the structure of the equienergy subgraph. We further reveal a correlation linking the structure of the Hilbert space diagram to the number of unconstrained spin pairs. Our results demonstrate that the minimum eigenstate entanglement of the quantum Ising model is governed by the specific structure of the interaction network. We anticipate that our findings provide a starting point for exploring quantum many-body systems with arbitrary interactions and finite system size. Moreover, our approach may be applicable to other quantum many-body systems, such as the Hubbard model."
  },
  {
    "title": "ProxyPrompt: Securing System Prompts against Prompt Extraction Attacks",
    "abstract": "The integration of large language models (LLMs) into a wide range of applications has highlighted the critical role of well-crafted system prompts, which require extensive testing and domain expertise. These prompts enhance task performance but may also encode sensitive information and filtering criteria, posing security risks if exposed. Recent research shows that system prompts are vulnerable to extraction attacks, while existing defenses are either easily bypassed or require constant updates to address new threats. In this work, we introduce ProxyPrompt, a novel defense mechanism that prevents prompt leakage by replacing the original prompt with a proxy. This proxy maintains the original task's utility while obfuscating the extracted prompt, ensuring attackers cannot reproduce the task or access sensitive information. Comprehensive evaluations on 264 LLM and system prompt pairs show that ProxyPrompt protects 94.70% of prompts from extraction attacks, outperforming the next-best defense, which only achieves 42.80%."
  },
  {
    "title": "The Role of Connection Density in an Adaptive Network with Chaotic Units",
    "abstract": "We investigate the role of connection density in an adaptive network model of chaotic units that dynamically rewire based on their internal states and local coherence. By systematically varying the network's connectivity density, we uncover distinct dynamical regimes and structural transitions, revealing mechanisms of spontaneous modularity, dynamical segregation, and integration. We find that at higher densities, the network exhibits both local clustering and global synchrony. Additionally, we observe that low-density networks tend to fragment into desynchronized clusters, while high-density networks converge to synchronized states combining strong global integration with persistent modular segregation. Inspired by neural architectures, our model provides a general framework for understanding how simple microscopic rules can give rise to complex emergent behaviors in dynamical networks."
  },
  {
    "title": "Neuromorphic Imaging Flow Cytometry combined with Adaptive Recurrent Spiking Neural Networks",
    "abstract": "We present an experimental imaging flow cytometer using a 1 {\\mu}s temporal resolution event-based CMOS camera, with data processed by adaptive feedforward and recurrent spiking neural networks. Our study classifies PMMA particles (12, 16, 20 {\\mu}m) flowing at 0.7 m/s in a microfluidic channel. Processing of experimental data highlighted that spiking recurrent networks, including LSTM and GRU models, achieved 98.4% accuracy by leveraging temporal dependencies. Additionally, adaptation mechanisms in lightweight feedforward spiking networks improved accuracy by 4.3%. This work outlines a technological roadmap for neuromorphic-assisted biomedical applications, enhancing classification performance while maintaining low latency and sparsity."
  },
  {
    "title": "Robust Equilibria in Shared Resource Allocation via Strengthening Border's Theorem",
    "abstract": "We consider repeated allocation of a shared resource via a non-monetary mechanism, wherein a single item must be allocated to one of multiple agents in each round. We assume that each agent has i.i.d. values for the item across rounds, and additive utilities. Past work on this problem has proposed mechanisms where agents can get one of two kinds of guarantees: $(i)$ (approximate) Bayes-Nash equilibria via linkage-based mechanisms which need extensive knowledge of the value distributions, and $(ii)$ simple distribution-agnostic mechanisms with robust utility guarantees for each individual agent, which are worse than the Nash outcome, but hold irrespective of how others behave (including possibly collusive behavior). Recent work has hinted at barriers to achieving both simultaneously. Our work however establishes this is not the case, by proposing the first mechanism in which each agent has a natural strategy that is both a Bayes-Nash equilibrium and also comes with strong robust guarantees for individual agent utilities. Our mechanism comes out of a surprising connection between the online shared resource allocation problem and implementation theory. In particular, we show that establishing robust equilibria in this setting reduces to showing that a particular subset of the Border polytope is non-empty. We establish this via a novel joint Schur-convexity argument. This strengthening of Border's criterion for obtaining a stronger conclusion is of independent technical interest, as it may prove useful in other settings."
  },
  {
    "title": "Is Grokking a Computational Glass Relaxation?",
    "abstract": "Understanding neural network's (NN) generalizability remains a central question in deep learning research. The special phenomenon of grokking, where NNs abruptly generalize long after the training performance reaches a near-perfect level, offers a unique window to investigate the underlying mechanisms of NNs' generalizability. Here we propose an interpretation for grokking by framing it as a computational glass relaxation: viewing NNs as a physical system where parameters are the degrees of freedom and train loss is the system energy, we find memorization process resembles a rapid cooling of liquid into non-equilibrium glassy state at low temperature and the later generalization is like a slow relaxation towards a more stable configuration. This mapping enables us to sample NNs' Boltzmann entropy (states of density) landscape as a function of training loss and test accuracy. Our experiments in transformers on arithmetic tasks suggests that there is NO entropy barrier in the memorization-to-generalization transition of grokking, challenging previous theory that defines grokking as a first-order phase transition. We identify a high-entropy advantage under grokking, an extension of prior work linking entropy to generalizability but much more significant. Inspired by grokking's far-from-equilibrium nature, we develop a toy optimizer WanD based on Wang-landau molecular dynamics, which can eliminate grokking without any constraints and find high-norm generalizing solutions. This provides strictly-defined counterexamples to theory attributing grokking solely to weight norm evolution towards the Goldilocks zone and also suggests new potential ways for optimizer design."
  },
  {
    "title": "Probing Quantum Structure in Gravitational Radiation",
    "abstract": "Gravitational radiation from known astrophysical sources is conventionally treated classically. This treatment corresponds, implicitly, to the hypothesis that a particular class of quantum-mechanical states -- the so-called coherent states -- adequately describe the gravitational radiation field. We propose practicable, quantitative tests of that hypothesis using resonant bar detectors monitored in coincidence with LIGO-style interferometers. Our tests readily distinguish fields that contain significant thermal components or squeezing. We identify concrete circumstances in which the classical (i.e., coherent state) hypothesis is likely to fail. Such failures are of fundamental interest, in that addressing them requires us to treat the gravitational field quantum-mechanically, and they open a new window into the dynamics of gravitational wave sources."
  },
  {
    "title": "Theory of Quasi-Statically Screened Electron-Polar Optical Phonon Scattering",
    "abstract": "The scattering of electrons with polar optical phonons (POP) is an important mechanism that limits electronic transport and determines electron mobility in polar materials. This is typically a stronger mechanism compared to non-polar acoustic and optical phonon scattering, and of similar strength to the Coulomb ionized impurity scattering. At high densities, on the other hand, the cloud of charge carriers screens the dipoles that are responsible for POP scattering, and weakens the electron-POP scattering strength. However, in contrast to ionized impurity scattering, for which the well-known Brooks-Herring equation provides the scattering rates with the effect of screening included, for scattering with POP there is no such closed-form mathematical expression. In this work, we derive such an expression based on Fermi's Golden Rule, which would prove particularly useful in understanding electronic transport in complex crystal and complex band structure materials, in which electron-POP scattering could dominate electronic transport."
  },
  {
    "title": "Understanding Nonlinear Implicit Bias via Region Counts in Input Space",
    "abstract": "One explanation for the strong generalization ability of neural networks is implicit bias. Yet, the definition and mechanism of implicit bias in non-linear contexts remains little understood. In this work, we propose to characterize implicit bias by the count of connected regions in the input space with the same predicted label. Compared with parameter-dependent metrics (e.g., norm or normalized margin), region count can be better adapted to nonlinear, overparameterized models, because it is determined by the function mapping and is invariant to reparametrization. Empirically, we found that small region counts align with geometrically simple decision boundaries and correlate well with good generalization performance. We also observe that good hyper-parameter choices such as larger learning rates and smaller batch sizes can induce small region counts. We further establish the theoretical connections and explain how larger learning rate can induce small region counts in neural networks."
  },
  {
    "title": "Learning Multimodal AI Algorithms for Amplifying Limited User Input into High-dimensional Control Space",
    "abstract": "Current invasive assistive technologies are designed to infer high-dimensional motor control signals from severely paralyzed patients. However, they face significant challenges, including public acceptance, limited longevity, and barriers to commercialization. Meanwhile, noninvasive alternatives often rely on artifact-prone signals, require lengthy user training, and struggle to deliver robust high-dimensional control for dexterous tasks. To address these issues, this study introduces a novel human-centered multimodal AI approach as intelligent compensatory mechanisms for lost motor functions that could potentially enable patients with severe paralysis to control high-dimensional assistive devices, such as dexterous robotic arms, using limited and noninvasive inputs. In contrast to the current state-of-the-art (SoTA) noninvasive approaches, our context-aware, multimodal shared-autonomy framework integrates deep reinforcement learning algorithms to blend limited low-dimensional user input with real-time environmental perception, enabling adaptive, dynamic, and intelligent interpretation of human intent for complex dexterous manipulation tasks, such as pick-and-place. The results from our ARAS (Adaptive Reinforcement learning for Amplification of limited inputs in Shared autonomy) trained with synthetic users over 50,000 computer simulation episodes demonstrated the first successful implementation of the proposed closed-loop human-in-the-loop paradigm, outperforming the SoTA shared autonomy algorithms. Following a zero-shot sim-to-real transfer, ARAS was evaluated on 23 human subjects, demonstrating high accuracy in dynamic intent detection and smooth, stable 3D trajectory control for dexterous pick-and-place tasks. ARAS user study achieved a high task success rate of 92.88%, with short completion times comparable to those of SoTA invasive assistive technologies."
  },
  {
    "title": "Magnetic dipole-dipole resonance energy transfer for heavy element quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. When organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are easier to be satisfied. The proposal in the paper adds a new approach for heavy element quenching in liquid scintillator solution."
  },
  {
    "title": "Universality of noise-induced transitions in nonlinear voter models",
    "abstract": "We analyze the universality classes of phase transitions in a variety of nonlinear voter models. By mapping several models with symmetric absorbing states onto a canonical model introduced in previous studies, we confirm that they exhibit a Generalized Voter (GV) transition. We then propose a canonical mean-field model that extends the original formulation by incorporating a noise term that eliminates the absorbing states. This generalization gives rise to a phase diagram featuring two distinct types of phase transitions: a continuous Ising transition and a discontinuous transition we call Modified Generalized Voter (MGV). These two transition lines converge at a tricritical point. We map diverse noisy nonlinear voter models onto this extended canonical form. Using finite-size scaling techniques above and below the upper critical dimension, we show that the continuous transition of these models belongs to the Ising universality class in their respective dimensionality. We also find universal behavior at the tricitical point. Our results provide a unifying framework for classifying phase transitions in stochastic models of opinion dynamics with both nonlinearity and noise."
  },
  {
    "title": "Search-TTA: A Multimodal Test-Time Adaptation Framework for Visual Search in the Wild",
    "abstract": "To perform autonomous visual search for environmental monitoring, a robot may leverage satellite imagery as a prior map. This can help inform coarse, high-level search and exploration strategies, even when such images lack sufficient resolution to allow fine-grained, explicit visual recognition of targets. However, there are some challenges to overcome with using satellite images to direct visual search. For one, targets that are unseen in satellite images are underrepresented (compared to ground images) in most existing datasets, and thus vision models trained on these datasets fail to reason effectively based on indirect visual cues. Furthermore, approaches which leverage large Vision Language Models (VLMs) for generalization may yield inaccurate outputs due to hallucination, leading to inefficient search. To address these challenges, we introduce Search-TTA, a multimodal test-time adaptation framework that can accept text and/or image input. First, we pretrain a remote sensing image encoder to align with CLIP's visual encoder to output probability distributions of target presence used for visual search. Second, our framework dynamically refines CLIP's predictions during search using a test-time adaptation mechanism. Through a feedback loop inspired by Spatial Poisson Point Processes, gradient updates (weighted by uncertainty) are used to correct (potentially inaccurate) predictions and improve search performance. To validate Search-TTA's performance, we curate a visual search dataset based on internet-scale ecological data. We find that Search-TTA improves planner performance by up to 9.7%, particularly in cases with poor initial CLIP predictions. It also achieves comparable performance to state-of-the-art VLMs. Finally, we deploy Search-TTA on a real UAV via hardware-in-the-loop testing, by simulating its operation within a large-scale simulation that provides onboard sensing."
  },
  {
    "title": "Born-limit scattering and pair-breaking crossover in d-wave superconductivity of (TMTSF)2ClO4",
    "abstract": "In the quasi-one-dimensional organic unconventional superconductor (TMTSF)2ClO4, the randomness of the non-centrosymmetric ClO4 anions can be experimentally controlled by adjusting the cooling rate through the anion-ordering temperature. This feature provides a unique opportunity to study disorder effects on unconventional superconductivity in great detail. We here report on measurements of the electronic specific heat of this system, performed under various cooling rates. The evolution of the residual density of states indicates that the ClO4 randomness works as Born-limit pair breakers, which, to our knowledge, has never been clearly identified in any unconventional superconductors. Furthermore, detailed analyses suggest a peculiar crossover from strong unitarity scattering due to molecular defects toward the Born-limit weak scattering due to borders of ordered regions. This work supports the d-wave nature of pairing in (TMTSF)2ClO4 and intends to provide an experimental basis for further developments of pair-breaking theories of unconventional superconductors where multiple electron scattering mechanisms coexist."
  },
  {
    "title": "Wind-induced Natural Gamma Radiation",
    "abstract": "During the extreme winter storms of 2024-2025 at Aragats, natural gamma radiation (NGR) increased by more than 1000%, with fluence reaching 2*10^7 gammas/cm^2 over 10 hours and a corresponding dose of 3.26 mSv, 120 times higher than normal background radiation for the same period. This unprecedented radiation surge was detected during dry, electrified snowstorms, exceeding levels explainable by known atmospheric mechanisms, necessitating a significant reassessment of gamma-ray sources in winter storm conditions. These results suggest similar radiation surges may occur in high-altitude and polar regions (Arctic and Antarctic), where strong winds and prolonged snowstorms are common. Understanding radiation surge conditions is essential for refining atmospheric models, improving radiation monitoring, and assessing environmental and climatic impacts in extreme weather conditions."
  },
  {
    "title": "Intriguing nature of AM Her type candidate CXOU J204734.8+300105",
    "abstract": "The detection and characterization of periodic X-ray signals are crucial for identifying new compact objects and studying the mechanisms powering their emission. We report on the timing and spectral variability of CXOU J204734.8+300105, a proposed eclipsing polar-type cataclysmic variable (CV) candidate. This source has been observed once with Chandra and twice with XMM-Newton, revealing several intriguing and conflicting features in its X-ray emission. The Chandra observation showed a periodicity of $\\sim$6000 s with an eclipse-like feature. The X-ray light curve from 2017 XMM-Newton observation showed a period of $\\sim$2000 seconds without any apparent eclipse, while the simultaneous optical light curve from OM showed a period of $\\sim$6000 seconds. This variability raises questions about the true nature of the source. Spectral analysis indicates a multi-component emission and emission lines due to Fe. The spectral characteristics are consistent with those observed in other CV systems. Additionally, we identified optical and near-infrared counterparts from various catalogues. Our findings suggest a dynamic and evolving accretion environment of CXOU J204734.8+300105."
  },
  {
    "title": "Reinforcement Learning Closures for Underresolved Partial Differential Equations using Synthetic Data",
    "abstract": "Partial Differential Equations (PDEs) describe phenomena ranging from turbulence and epidemics to quantum mechanics and financial markets. Despite recent advances in computational science, solving such PDEs for real-world applications remains prohibitively expensive because of the necessity of resolving a broad range of spatiotemporal scales. In turn, practitioners often rely on coarse-grained approximations of the original PDEs, trading off accuracy for reduced computational resources. To mitigate the loss of detail inherent in such approximations, closure models are employed to represent unresolved spatiotemporal interactions. We present a framework for developing closure models for PDEs using synthetic data acquired through the method of manufactured solutions. These data are used in conjunction with reinforcement learning to provide closures for coarse-grained PDEs. We illustrate the efficacy of our method using the one-dimensional and two-dimensional Burgers' equations and the two-dimensional advection equation. Moreover, we demonstrate that closure models trained for inhomogeneous PDEs can be effectively generalized to homogeneous PDEs. The results demonstrate the potential for developing accurate and computationally efficient closure models for systems with scarce data."
  },
  {
    "title": "Heterogeneity-Aware Client Sampling: A Unified Solution for Consistent Federated Learning",
    "abstract": "Federated learning (FL) commonly involves clients with diverse communication and computational capabilities. Such heterogeneity can significantly distort the optimization dynamics and lead to objective inconsistency, where the global model converges to an incorrect stationary point potentially far from the pursued optimum. Despite its critical impact, the joint effect of communication and computation heterogeneity has remained largely unexplored, due to the intrinsic complexity of their interaction. In this paper, we reveal the fundamentally distinct mechanisms through which heterogeneous communication and computation drive inconsistency in FL. To the best of our knowledge, this is the first unified theoretical analysis of general heterogeneous FL, offering a principled understanding of how these two forms of heterogeneity jointly distort the optimization trajectory under arbitrary choices of local solvers. Motivated by these insights, we propose Federated Heterogeneity-Aware Client Sampling, FedACS, a universal method to eliminate all types of objective inconsistency. We theoretically prove that FedACS converges to the correct optimum at a rate of $O(1/\\sqrt{R})$, even in dynamic heterogeneous environments. Extensive experiments across multiple datasets show that FedACS outperforms state-of-the-art and category-specific baselines by 4.3%-36%, while reducing communication costs by 22%-89% and computation loads by 14%-105%, respectively."
  },
  {
    "title": "Wave turbulence, thermalization and multimode locking in optical fibers",
    "abstract": "We present a comprehensive overview of recent advances in theory and experiments on complex light propagation phenomena in nonlinear multimode fibers. On the basis of the wave turbulence theory, we derive kinetic equations describing the out-of-equilibrium process of optical thermalization toward the Rayleigh-Jeans (RJ) equilibrium distribution. Our theory explains the effect of beam self-cleaning (BSC) in graded-index (GRIN) fibers, whereby a speckled beam transforms into a bell-shaped beam at the fiber output. We theoretically explore the role of random refractive index fluctuations along the fiber, and show how these imperfections can assist the observation of BSC in a practical experimental setting. This conclusion is supported by the derivation of wave turbulence kinetic equations that account for the presence of a time-dependent disorder (random mode coupling). The kinetic theory reveals that a weak disorder accelerates the rate of RJ thermalization and condensation. On the other hand, although strong disorder is expected to suppress wave condensation, the kinetic equation reveals that an out-of-equilibrium process of condensation and RJ thermalization can still occur. The kinetic equations are validated by numerical simulations of the nonlinear Schrodinger equation. We outline a series of recent experiments, which permit to confirm the statistical mechanics approach for describing beam propagation and thermalization. For example, we highlight the demonstration of entropy growth, and point out that there are inherent limits to peak-power scaling in multimode fiber lasers. We conclude by pointing out the experimental observation that BSC is accompanied by an effect of modal phase-locking. From the one hand this explains the observed preservation of the spatial coherence of the beam, but also it points to the need of extending current descriptions in future research."
  },
  {
    "title": "Diagrammatic expressions for steady-state distribution and static responses in population dynamics",
    "abstract": "One of the fundamental questions in population dynamics is how biological populations respond to environmental perturbations. In population dynamics, the mean fitness and the fraction of a trait in the steady state are important because they indicate how well the trait and the population adapt to the environment. In this study, we examine the parallel mutation-reproduction model, which is one of the simplest models of an evolvable population. As an extension of the Markov chain tree theorem, we derive diagrammatic expressions for the static responses of mean fitness and the steady-state distribution of the population. For the parallel mutation-reproduction model, we consider self-loops, which represent trait reproduction and are excluded from the Markov chain tree theorem for the linear master equation. To generalize the theorem, we introduce the concept of rooted $0$/$1$ loop forests, which generalize spanning trees with loops. We demonstrate that the weights of rooted $0$/$1$ loop forests yield the static responses of mean fitness and the steady-state distribution. Our results provide exact expressions for the static responses and the steady-state distribution. Additionally, we discuss approximations of these expressions in cases where reproduction or mutation is dominant. We provide numerical examples to illustrate these approximations and exact expressions."
  },
  {
    "title": "TAIJI: MCP-based Multi-Modal Data Analytics on Data Lakes",
    "abstract": "The variety of data in data lakes presents significant challenges for data analytics, as data scientists must simultaneously analyze multi-modal data, including structured, semi-structured, and unstructured data. While Large Language Models (LLMs) have demonstrated promising capabilities, they still remain inadequate for multi-modal data analytics in terms of accuracy, efficiency, and freshness. First, current natural language (NL) or SQL-like query languages may struggle to precisely and comprehensively capture users' analytical intent. Second, relying on a single unified LLM to process diverse data modalities often leads to substantial inference overhead. Third, data stored in data lakes may be incomplete or outdated, making it essential to integrate external open-domain knowledge to generate timely and relevant analytics results. In this paper, we envision a new multi-modal data analytics system. Specifically, we propose a novel architecture built upon the Model Context Protocol (MCP), an emerging paradigm that enables LLMs to collaborate with knowledgeable agents. First, we define a semantic operator hierarchy tailored for querying multi-modal data in data lakes and develop an AI-agent-powered NL2Operator translator to bridge user intent and analytical execution. Next, we introduce an MCP-based execution framework, in which each MCP server hosts specialized foundation models optimized for specific data modalities. This design enhances both accuracy and efficiency, while supporting high scalability through modular deployment. Finally, we propose a updating mechanism by harnessing the deep research and machine unlearning techniques to refresh the data lakes and LLM knowledges, with the goal of balancing the data freshness and inference efficiency."
  },
  {
    "title": "Driving Mechanisms and Forecasting of China's Pet Population-An ARIMA-RF-HW Hybrid Approach",
    "abstract": "This study proposes a dynamically weighted ARIMA-RF-HW hybrid model integrating ARIMA for seasonality and trends, Random Forest for nonlinear features, and Holt-Winters smoothing for seasonal adjustment to improve China's pet population forecasting accuracy. Using 2005-2023 data with nine economic, social, and policy indicators (urban income, consumption, aging ratio, policy quantity, new veterinary drug approvals), data were preprocessed via Z-score normalization and missing value imputation. The results show that key drivers of pet populations include urban income (19.48% for cats, 17.15% for dogs), consumption (17.99% for cats), and policy quantity (13.33% for cats, 14.02% for dogs), with aging (12.81% for cats, 13.27% for dogs) and urbanization amplifying the demand for pets. Forecasts show steady cat growth and fluctuating dog numbers, reflecting cats' adaptability to urban environments. This research supports policymakers in optimizing pet health management and guides enterprises in developing differentiated services, advancing sustainable industry growth."
  },
  {
    "title": "Delta Attention: Fast and Accurate Sparse Attention Inference by Delta Correction",
    "abstract": "The attention mechanism of a transformer has a quadratic complexity, leading to high inference costs and latency for long sequences. However, attention matrices are mostly sparse, which implies that many entries may be omitted from computation for efficient inference. Sparse attention inference methods aim to reduce this computational burden; however, they also come with a troublesome performance degradation. We discover that one reason for this degradation is that the sparse calculation induces a distributional shift in the attention outputs. The distributional shift causes decoding-time queries to fail to align well with the appropriate keys from the prefill stage, leading to a drop in performance. We propose a simple, novel, and effective procedure for correcting this distributional shift, bringing the distribution of sparse attention outputs closer to that of quadratic attention. Our method can be applied on top of any sparse attention method, and results in an average 36%pt performance increase, recovering 88% of quadratic attention accuracy on the 131K RULER benchmark when applied on top of sliding window attention with sink tokens while only adding a small overhead. Our method can maintain approximately 98.5% sparsity over full quadratic attention, making our model 32 times faster than Flash Attention 2 when processing 1M token prefills."
  },
  {
    "title": "Emergent Thermalization Thresholds in Unitary Dynamics of Inhomogeneously Disordered Systems",
    "abstract": "Inspired by the avalanche scenario for many-body localization (MBL) instability, we reverse the conventional set-up and ask whether a large weakly-disordered chain can thermalize a smaller, strongly-disordered chain when the composite system evolves unitarily. Using transport as a dynamical probe, we identify three distinct thermalization regimes as a function of the disorder strength of the smaller chain: (i) complete thermalization with self-averaging at weak disorder, (ii) realization-dependent thermalization with strong sample-to-sample fluctuations at intermediate disorder, and (iii) absence of thermalization at strong disorder. We find that the non-self-averaging regime broadens with the size of the weakly-disordered chain, revealing a nuanced interplay between disorder and system size. These results highlight how inhomogeneous disorder can induce emergent thermalization thresholds in closed quantum systems, providing direct access to disorder regimes where thermalization or its absence can be reliably observed."
  },
  {
    "title": "Concept Drift Guided LayerNorm Tuning for Efficient Multimodal Metaphor Identification",
    "abstract": "Metaphorical imagination, the ability to connect seemingly unrelated concepts, is fundamental to human cognition and communication. While understanding linguistic metaphors has advanced significantly, grasping multimodal metaphors, such as those found in internet memes, presents unique challenges due to their unconventional expressions and implied meanings. Existing methods for multimodal metaphor identification often struggle to bridge the gap between literal and figurative interpretations. Additionally, generative approaches that utilize large language models or text-to-image models, while promising, suffer from high computational costs. This paper introduces \\textbf{C}oncept \\textbf{D}rift \\textbf{G}uided \\textbf{L}ayerNorm \\textbf{T}uning (\\textbf{CDGLT}), a novel and training-efficient framework for multimodal metaphor identification. CDGLT incorporates two key innovations: (1) Concept Drift, a mechanism that leverages Spherical Linear Interpolation (SLERP) of cross-modal embeddings from a CLIP encoder to generate a new, divergent concept embedding. This drifted concept helps to alleviate the gap between literal features and the figurative task. (2) A prompt construction strategy, that adapts the method of feature extraction and fusion using pre-trained language models for the multimodal metaphor identification task. CDGLT achieves state-of-the-art performance on the MET-Meme benchmark while significantly reducing training costs compared to existing generative methods. Ablation studies demonstrate the effectiveness of both Concept Drift and our adapted LN Tuning approach. Our method represents a significant step towards efficient and accurate multimodal metaphor understanding. The code is available: \\href{https://github.com/Qianvenh/CDGLT}{https://github.com/Qianvenh/CDGLT}."
  },
  {
    "title": "AW-GATCN: Adaptive Weighted Graph Attention Convolutional Network for Event Camera Data Joint Denoising and Object Recognition",
    "abstract": "Event cameras, which capture brightness changes with high temporal resolution, inherently generate a significant amount of redundant and noisy data beyond essential object structures. The primary challenge in event-based object recognition lies in effectively removing this noise without losing critical spatial-temporal information. To address this, we propose an Adaptive Graph-based Noisy Data Removal framework for Event-based Object Recognition. Specifically, our approach integrates adaptive event segmentation based on normalized density analysis, a multifactorial edge-weighting mechanism, and adaptive graph-based denoising strategies. These innovations significantly enhance the integration of spatiotemporal information, effectively filtering noise while preserving critical structural features for robust recognition. Experimental evaluations on four challenging datasets demonstrate that our method achieves superior recognition accuracies of 83.77%, 76.79%, 99.30%, and 96.89%, surpassing existing graph-based methods by up to 8.79%, and improving noise reduction performance by up to 19.57%, with an additional accuracy gain of 6.26% compared to traditional Euclidean-based techniques."
  },
  {
    "title": "MM-INT: Telemetry in Programmable Switches with Multiple Queues using Source-based Multipath Routing",
    "abstract": "This article emphasizes the importance of queues associated with the ports of switches in network monitoring. Traditionally, data collection about these queues is done using programmable data planes and telemetry based on INT (In-band Network Telemetry) probes, assuming there is only a single queue per output port. The MM-INT (Multiqueue Multicast - INT) is a solution that utilizes registers to store data from all queues and ports, enabling the efficient collection of monitoring information. The MM-INT avoids probe overload and employs the origin-based routing mechanism and multicast trees for the probes. The results demonstrate significant reductions in the number of probes sent compared to other traditional solutions found in the literature."
  },
  {
    "title": "Is PRM Necessary? Problem-Solving RL Implicitly Induces PRM Capability in LLMs",
    "abstract": "The development of reasoning capabilities represents a critical frontier in large language models (LLMs) research, where reinforcement learning (RL) and process reward models (PRMs) have emerged as predominant methodological frameworks. Contrary to conventional wisdom, empirical evidence from DeepSeek-R1 demonstrates that pure RL training focused on mathematical problem-solving can progressively enhance reasoning abilities without PRM integration, challenging the perceived necessity of process supervision. In this study, we conduct a systematic investigation of the relationship between RL training and PRM capabilities. Our findings demonstrate that problem-solving proficiency and process supervision capabilities represent complementary dimensions of reasoning that co-evolve synergistically during pure RL training. In particular, current PRMs underperform simple baselines like majority voting when applied to state-of-the-art models such as DeepSeek-R1 and QwQ-32B. To address this limitation, we propose Self-PRM, an introspective framework in which models autonomously evaluate and rerank their generated solutions through self-reward mechanisms. Although Self-PRM consistently improves the accuracy of the benchmark (particularly with larger sample sizes), analysis exposes persistent challenges: The approach exhibits low precision (<10\\%) on difficult problems, frequently misclassifying flawed solutions as valid. These analyses underscore the need for continued RL scaling to improve reward alignment and introspective accuracy. Overall, our findings suggest that PRM may not be essential for enhancing complex reasoning, as pure RL not only improves problem-solving skills but also inherently fosters robust PRM capabilities. We hope these findings provide actionable insights for building more reliable and self-aware complex reasoning models."
  },
  {
    "title": "Bayesian Hierarchical Invariant Prediction",
    "abstract": "We propose Bayesian Hierarchical Invariant Prediction (BHIP) reframing Invariant Causal Prediction (ICP) through the lens of Hierarchical Bayes. We leverage the hierarchical structure to explicitly test invariance of causal mechanisms under heterogeneous data, resulting in improved computational scalability for a larger number of predictors compared to ICP. Moreover, given its Bayesian nature BHIP enables the use of prior information. In this paper, we test two sparsity inducing priors: horseshoe and spike-and-slab, both of which allow us a more reliable identification of causal features. We test BHIP in synthetic and real-world data showing its potential as an alternative inference method to ICP."
  },
  {
    "title": "NoPE: The Counting Power of Transformers with No Positional Encodings",
    "abstract": "Positional Encodings (PEs) seem to be indispensable for ensuring expressiveness of transformers; without them attention transformers reduce to a bag-of-word model. NoPE-transformers (i.e. with No PEs) with unique hard attention mechanisms were very recently shown to only be able to express regular languages, i.e., with limited counting ability. This paper shows that, with average hard attention mechanisms, NoPE-transformers are still surprisingly expressive: they can express counting languages corresponding to nonnegative integer solutions to multivariate polynomial equations (i.e. Diophantine equations), reasoning about which is well-known to be undecidable. In fact, we provide a precise characterization of languages expressible by Average Hard Attention NoPE-Transformers (NoPE-AHATs): they correspond precisely to what we call \\emph{semi-algebraic sets}, i.e., finite unions of sets of nonnegative integer solutions to systems of multivariate polynomial inequations. We obtain several interesting consequences of our characterization. Firstly, NoPE-transformers can express counting properties that are far more complex than established models like simplified counter machines and Petri nets, but cannot express a very simple counting property of PARITY. Secondly, the problem of analyzing NoPE-transformers is undecidable, e.g., whether a given NoPE transformer classifies all input strings in one class. To complement our results, we exhibit a counting language that is not expressible by average hard attention transformers even with arbitrary PEs but is expressible in the circuit complexity class TC$^0$, answering an open problem."
  },
  {
    "title": "DiCo: Revitalizing ConvNets for Scalable and Efficient Diffusion Modeling",
    "abstract": "Diffusion Transformer (DiT), a promising diffusion model for visual generation, demonstrates impressive performance but incurs significant computational overhead. Intriguingly, analysis of pre-trained DiT models reveals that global self-attention is often redundant, predominantly capturing local patterns-highlighting the potential for more efficient alternatives. In this paper, we revisit convolution as an alternative building block for constructing efficient and expressive diffusion models. However, naively replacing self-attention with convolution typically results in degraded performance. Our investigations attribute this performance gap to the higher channel redundancy in ConvNets compared to Transformers. To resolve this, we introduce a compact channel attention mechanism that promotes the activation of more diverse channels, thereby enhancing feature diversity. This leads to Diffusion ConvNet (DiCo), a family of diffusion models built entirely from standard ConvNet modules, offering strong generative performance with significant efficiency gains. On class-conditional ImageNet benchmarks, DiCo outperforms previous diffusion models in both image quality and generation speed. Notably, DiCo-XL achieves an FID of 2.05 at 256x256 resolution and 2.53 at 512x512, with a 2.7x and 3.1x speedup over DiT-XL/2, respectively. Furthermore, our largest model, DiCo-H, scaled to 1B parameters, reaches an FID of 1.90 on ImageNet 256x256-without any additional supervision during training. Code: https://github.com/shallowdream204/DiCo."
  },
  {
    "title": "Decentralized Framework for Teleportation in Quantum Core Interconnects",
    "abstract": "Multi-core quantum computing architectures offer a promising and scalable solution to the challenges of integrating large number of qubits into existing monolithic chip design. However, the issue of transferring quantum information across the cores remains unresolved. Quantum Teleportation offers a potential approach for efficient qubit transfer, but existing methods primarily rely on centralized interconnection mechanisms for teleportation, which may limit scalability and parallel communication. We proposes a decentralized framework for teleportation in multi-core quantum computing systems, aiming to address these limitations. We introduce two variants of teleportation within the decentralized framework and evaluate their impact on reducing end-to-end communication delay and quantum circuit depth. Our findings demonstrate that the optimized teleportation strategy, termed two-way teleportation, results in a substantial 40% reduction in end-to-end communication latency for synthetic benchmarks and a 30% reduction for real benchmark applications, and 24% decrease in circuit depth compared to the baseline teleportation strategy. These results highlight the significant potential of decentralized teleportation to improve the performance of large-scale quantum systems, offering a scalable and efficient solution for future quantum architectures."
  },
  {
    "title": "CheX-DS: Improving Chest X-ray Image Classification with Ensemble Learning Based on DenseNet and Swin Transformer",
    "abstract": "The automatic diagnosis of chest diseases is a popular and challenging task. Most current methods are based on convolutional neural networks (CNNs), which focus on local features while neglecting global features. Recently, self-attention mechanisms have been introduced into the field of computer vision, demonstrating superior performance. Therefore, this paper proposes an effective model, CheX-DS, for classifying long-tail multi-label data in the medical field of chest X-rays. The model is based on the excellent CNN model DenseNet for medical imaging and the newly popular Swin Transformer model, utilizing ensemble deep learning techniques to combine the two models and leverage the advantages of both CNNs and Transformers. The loss function of CheX-DS combines weighted binary cross-entropy loss with asymmetric loss, effectively addressing the issue of data imbalance. The NIH ChestX-ray14 dataset is selected to evaluate the model's effectiveness. The model outperforms previous studies with an excellent average AUC score of 83.76\\%, demonstrating its superior performance."
  },
  {
    "title": "Sliding Speed Influences Electrovibration-Induced Finger Friction Dynamics on Touchscreens",
    "abstract": "Electrovibration technology can render tactile textures on capacitive touchscreens by modulating friction between the finger and the screen through electrostatic attraction force generated by applying an alternating voltage signal to the screen. This signal should be carefully calibrated for realistic and robust texture rendering. However, this process is challenging due to variations in sliding speed, applied force, and individual skin mechanics, which affect friction in complex and unpredictable ways. Here, we investigate how exploration conditions affect electrovibration-induced finger friction on touchscreens and the role of skin mechanics in this process. Ten participants slid their index fingers across an electrovibration-enabled touchscreen at five sliding speeds ($20\\sim100$ mm/s) and applied force levels ($0.2\\sim0.6$ N) while we measured contact forces and skin accelerations. The touchscreen was excited with amplitude-modulated voltage signals across frequencies relevant to touch. We modeled the finger-touchscreen friction response as a first-order system and the skin mechanics as a mass-spring-damper system. Our results showed that the sliding speed influenced the cutoff frequency of the friction response as well as the moving mass and stiffness of the finger for the tested exploration ranges. Specifically, for every 1 mm/s increase in speed, the cutoff frequency, the finger moving mass, and stiffness increased by $13.8$ Hz, $3.23\\times 10^{-5}$ kg, and $4.04$ N/m, respectively. Further correlation analysis revealed that finger stiffness affected the cutoff frequency more than the moving mass. Finally, we developed a practical model for electrovibration-induced finger friction on touchscreens that accounts for sliding speed variations, paving the way for delivering consistent haptic feedback through electrovibration."
  },
  {
    "title": "Sonification of entanglement dynamics in many-qubit systems",
    "abstract": "Quantum mechanics poses significant challenges for audio-visual representation, particularly concerning quantum entanglement. Sonification -- the auditory representation of data -- offers a promising complementary approach. This paper investigates sonification techniques applied to dynamical entanglement generation in many-qubit systems with the help of phase space methods and entanglement measure. We study dynamics of entanglement generation in many-qubit system in dynamical protocol governed by two models: the one-axis twisting model, and a quantum kicked-rotor exhibiting both regular and quantum chaotic behavior. We present a procedure of entanglement dynamics sonification, allowing mapping the phase-space representation of a many-qubit quantum state and von Neuman entanglement entropy to sound. Results demonstrate how sonification enhances perception of dynamic entanglement offering intuitive and artistic insight into quantum correlations behaviors."
  },
  {
    "title": "Attention on the Sphere",
    "abstract": "We introduce a generalized attention mechanism for spherical domains, enabling Transformer architectures to natively process data defined on the two-dimensional sphere - a critical need in fields such as atmospheric physics, cosmology, and robotics, where preserving spherical symmetries and topology is essential for physical accuracy. By integrating numerical quadrature weights into the attention mechanism, we obtain a geometrically faithful spherical attention that is approximately rotationally equivariant, providing strong inductive biases and leading to better performance than Cartesian approaches. To further enhance both scalability and model performance, we propose neighborhood attention on the sphere, which confines interactions to geodesic neighborhoods. This approach reduces computational complexity and introduces the additional inductive bias for locality, while retaining the symmetry properties of our method. We provide optimized CUDA kernels and memory-efficient implementations to ensure practical applicability. The method is validated on three diverse tasks: simulating shallow water equations on the rotating sphere, spherical image segmentation, and spherical depth estimation. Across all tasks, our spherical Transformers consistently outperform their planar counterparts, highlighting the advantage of geometric priors for learning on spherical domains."
  },
  {
    "title": "MPMA: Preference Manipulation Attack Against Model Context Protocol",
    "abstract": "Model Context Protocol (MCP) standardizes interface mapping for large language models (LLMs) to access external data and tools, which revolutionizes the paradigm of tool selection and facilitates the rapid expansion of the LLM agent tool ecosystem. However, as the MCP is increasingly adopted, third-party customized versions of the MCP server expose potential security vulnerabilities. In this paper, we first introduce a novel security threat, which we term the MCP Preference Manipulation Attack (MPMA). An attacker deploys a customized MCP server to manipulate LLMs, causing them to prioritize it over other competing MCP servers. This can result in economic benefits for attackers, such as revenue from paid MCP services or advertising income generated from free servers. To achieve MPMA, we first design a Direct Preference Manipulation Attack ($\\mathtt{DPMA}$) that achieves significant effectiveness by inserting the manipulative word and phrases into the tool name and description. However, such a direct modification is obvious to users and lacks stealthiness. To address these limitations, we further propose Genetic-based Advertising Preference Manipulation Attack ($\\mathtt{GAPMA}$). $\\mathtt{GAPMA}$ employs four commonly used strategies to initialize descriptions and integrates a Genetic Algorithm (GA) to enhance stealthiness. The experiment results demonstrate that $\\mathtt{GAPMA}$ balances high effectiveness and stealthiness. Our study reveals a critical vulnerability of the MCP in open ecosystems, highlighting an urgent need for robust defense mechanisms to ensure the fairness of the MCP ecosystem."
  },
  {
    "title": "Bi-directional Recurrence Improves Transformer in Partially Observable Markov Decision Processes",
    "abstract": "In real-world reinforcement learning (RL) scenarios, agents often encounter partial observability, where incomplete or noisy information obscures the true state of the environment. Partially Observable Markov Decision Processes (POMDPs) are commonly used to model these environments, but effective performance requires memory mechanisms to utilise past observations. While recurrence networks have traditionally addressed this need, transformer-based models have recently shown improved sample efficiency in RL tasks. However, their application to POMDPs remains underdeveloped, and their real-world deployment is constrained due to the high parameter count. This work introduces a novel bi-recurrent model architecture that improves sample efficiency and reduces model parameter count in POMDP scenarios. The architecture replaces the multiple feed forward layers with a single layer of bi-directional recurrence unit to better capture and utilize sequential dependencies and contextual information. This approach improves the model's ability to handle partial observability and increases sample efficiency, enabling effective learning from comparatively fewer interactions. To evaluate the performance of the proposed model architecture, experiments were conducted on a total of 23 POMDP environments. The proposed model architecture outperforms existing transformer-based, attention-based, and recurrence-based methods by a margin ranging from 87.39% to 482.04% on average across the 23 POMDP environments."
  },
  {
    "title": "Piezomagnetic effect in 5$d$ transition metal oxides Y$_2$Ir$_2$O$_7$ and Cd$_2$Os$_2$O$_7$ with all-in/all-out magnetic order",
    "abstract": "We investigated the piezomagnetic effect in pyrochlore-type oxides Y$_2$Ir$_2$O$_7$ and Cd$_2$Os$_2$O$_7$, which show a non-coplanar magnetic structure called the all-in/all-out antiferromagnetic order at low temperatures. The all-in/all-out magnetic order can be viewed as a ferroic order of the $xyz$-type magnetic octupoles. We observed a linear development of magnetization with applying stress for both materials. We then estimated the powder-averaged piezomagnetic tensor at 50 K to be $Q = 5.74 \\times 10^{-6}$ $\\mu_{\\text{B}}$/Ir$\\cdot$MPa for Y$_2$Ir$_2$O$_7$, and $Q = 3.49 \\times 10^{-7}$ $\\mu_{\\text{B}}$/Os$\\cdot$MPa for Cd$_2$Os$_2$O$_7$. We discuss the microscopic mechanism of the piezomagnetic effect in terms of the stress-induced modification of the g-tensor anisotropy and Dzyaloshinskii-Moriya (D-M) interactions. This work paves the way for the further development of piezomagnetic materials using a strategy based on magnetic multipoles."
  },
  {
    "title": "GraphOracle: A Foundation Model for Knowledge Graph Reasoning",
    "abstract": "Foundation models have demonstrated remarkable capabilities across various domains, but developing analogous models for knowledge graphs presents unique challenges due to their dynamic nature and the need for cross-domain reasoning. To address these issues, we introduce \\textbf{\\textsc{GraphOracle}}, a relation-centric foundation model that unifies reasoning across knowledge graphs by converting them into Relation-Dependency Graphs (RDG), explicitly encoding compositional patterns with fewer edges than prior methods. A query-dependent attention mechanism is further developed to learn inductive representations for both relations and entities. Pre-training on diverse knowledge graphs, followed by minutes-level fine-tuning, enables effective generalization to unseen entities, relations, and entire graphs. Through comprehensive experiments on 31 diverse benchmarks spanning transductive, inductive, and cross-domain settings, we demonstrate consistent state-of-the-art performance with minimal adaptation, improving the prediction performance by up to 35\\% compared to the strongest baselines."
  },
  {
    "title": "Navigating the Alpha Jungle: An LLM-Powered MCTS Framework for Formulaic Factor Mining",
    "abstract": "Alpha factor mining is pivotal in quantitative investment for identifying predictive signals from complex financial data. While traditional formulaic alpha mining relies on human expertise, contemporary automated methods, such as those based on genetic programming or reinforcement learning, often suffer from search inefficiency or yield poorly interpretable alpha factors. This paper introduces a novel framework that integrates Large Language Models (LLMs) with Monte Carlo Tree Search (MCTS) to overcome these limitations. Our approach leverages the LLM's instruction-following and reasoning capability to iteratively generate and refine symbolic alpha formulas within an MCTS-driven exploration. A key innovation is the guidance of MCTS exploration by rich, quantitative feedback from financial backtesting of each candidate factor, enabling efficient navigation of the vast search space. Furthermore, a frequent subtree avoidance mechanism is introduced to bolster search efficiency and alpha factor performance. Experimental results on real-world stock market data demonstrate that our LLM-based framework outperforms existing methods by mining alphas with superior predictive accuracy, trading performance, and improved interpretability, while offering a more efficient solution for formulaic alpha mining."
  },
  {
    "title": "Redundancy-Aware Pretraining of Vision-Language Foundation Models in Remote Sensing",
    "abstract": "The development of foundation models through pretraining of vision-language models (VLMs) has recently attracted great attention in remote sensing (RS). VLM pretraining aims to learn image and language alignments from a large number of image-text pairs. Each pretraining image is often associated with multiple captions containing redundant information due to repeated or semantically similar phrases, resulting in increased pretraining and inference time. To overcome this, we introduce a weighted feature aggregation (WFA) strategy for VLM pretraining in RS. Our strategy aims to extract and exploit complementary information from multiple captions per image while reducing redundancies through feature aggregation with importance weighting. To calculate adaptive importance weights for different captions of each image, we propose two techniques: (i) non-parametric uniqueness and (ii) learning-based attention. In the first technique, importance weights are calculated based on the bilingual evaluation understudy (BLEU) scores of the captions to emphasize unique sentences and reduce the influence of repetitive ones. In the second technique, importance weights are learned through an attention mechanism instead of relying on hand-crafted features. The effectiveness of the proposed WFA strategy with the two techniques is analyzed in terms of downstream performance on text-to-image retrieval in RS. Experimental results show that the proposed strategy enables efficient and effective pretraining of VLMs in RS. Based on the experimental analysis, we derive guidelines for selecting appropriate techniques depending on downstream task requirements and resource constraints. The code of this work is publicly available at https://git.tu-berlin.de/rsim/redundacy-aware-rs-vlm."
  },
  {
    "title": "FairSHAP: Preprocessing for Fairness Through Attribution-Based Data Augmentation",
    "abstract": "Ensuring fairness in machine learning models is critical, particularly in high-stakes domains where biased decisions can lead to serious societal consequences. Existing preprocessing approaches generally lack transparent mechanisms for identifying which features or instances are responsible for unfairness. This obscures the rationale behind data modifications. We introduce FairSHAP, a novel pre-processing framework that leverages Shapley value attribution to improve both individual and group fairness. FairSHAP identifies fairness-critical instances in the training data using an interpretable measure of feature importance, and systematically modifies them through instance-level matching across sensitive groups. This process reduces discriminative risk - an individual fairness metric - while preserving data integrity and model accuracy. We demonstrate that FairSHAP significantly improves demographic parity and equality of opportunity across diverse tabular datasets, achieving fairness gains with minimal data perturbation and, in some cases, improved predictive performance. As a model-agnostic and transparent method, FairSHAP integrates seamlessly into existing machine learning pipelines and provides actionable insights into the sources of bias.Our code is on https://github.com/youlei202/FairSHAP."
  },
  {
    "title": "Hybrid-Emba3D: Geometry-Aware and Cross-Path Feature Hybrid Enhanced State Space Model for Point Cloud Classification",
    "abstract": "The point cloud classification tasks face the dual challenge of efficiently extracting local geometric features while maintaining model complexity. The Mamba architecture utilizes the linear complexity advantage of state space models (SSMs) to overcome the computational bottleneck of Transformers while balancing global modeling capabilities. However, the inherent contradiction between its unidirectional dependency and the unordered nature of point clouds impedes modeling spatial correlation in local neighborhoods, thus constraining geometric feature extraction. This paper proposes Hybrid-Emba3D, a bidirectional Mamba model enhanced by geometry-feature coupling and cross-path feature hybridization. The Local geometric pooling with geometry-feature coupling mechanism significantly enhances local feature discriminative power via coordinated propagation and dynamic aggregation of geometric information between local center points and their neighborhoods, without introducing additional parameters. The designed Collaborative feature enhancer adopts dual-path hybridization, effectively handling local mutations and sparse key signals, breaking through the limitations of traditional SSM long-range modeling. Experimental results demonstrate that the proposed model achieves a new SOTA classification accuracy of 95.99% on ModelNet40 with only 0.03M additional."
  },
  {
    "title": "Verifiably Forgotten? Gradient Differences Still Enable Data Reconstruction in Federated Unlearning",
    "abstract": "Federated Unlearning (FU) has emerged as a critical compliance mechanism for data privacy regulations, requiring unlearned clients to provide verifiable Proof of Federated Unlearning (PoFU) to auditors upon data removal requests. However, we uncover a significant privacy vulnerability: when gradient differences are used as PoFU, honest-but-curious auditors may exploit mathematical correlations between gradient differences and forgotten samples to reconstruct the latter. Such reconstruction, if feasible, would face three key challenges: (i) restricted auditor access to client-side data, (ii) limited samples derivable from individual PoFU, and (iii) high-dimensional redundancy in gradient differences. To overcome these challenges, we propose Inverting Gradient difference to Forgotten data (IGF), a novel learning-based reconstruction attack framework that employs Singular Value Decomposition (SVD) for dimensionality reduction and feature extraction. IGF incorporates a tailored pixel-level inversion model optimized via a composite loss that captures both structural and semantic cues. This enables efficient and high-fidelity reconstruction of large-scale samples, surpassing existing methods. To counter this novel attack, we design an orthogonal obfuscation defense that preserves PoFU verification utility while preventing sensitive forgotten data reconstruction. Experiments across multiple datasets validate the effectiveness of the attack and the robustness of the defense. The code is available at https://anonymous.4open.science/r/IGF."
  },
  {
    "title": "Fault Diagnosis across Heterogeneous Domains via Self-Adaptive Temporal-Spatial Attention and Sample Generation",
    "abstract": "Deep learning methods have shown promising performance in fault diagnosis for multimode process. Most existing studies assume that the collected health state categories from different operating modes are identical. However, in real industrial scenarios, these categories typically exhibit only partial overlap. The incompleteness of the available data and the large distributional differences between the operating modes pose a significant challenge to existing fault diagnosis methods. To address this problem, a novel fault diagnosis model named self-adaptive temporal-spatial attention network (TSA-SAN) is proposed. First, inter-mode mappings are constructed using healthy category data to generate multimode samples. To enrich the diversity of the fault data, interpolation is performed between healthy and fault samples. Subsequently, the fault diagnosis model is trained using real and generated data. The self-adaptive instance normalization is established to suppress irrelevant information while retaining essential statistical features for diagnosis. In addition, a temporal-spatial attention mechanism is constructed to focus on the key features, thus enhancing the generalization ability of the model. The extensive experiments demonstrate that the proposed model significantly outperforms the state-of-the-art methods. The code will be available on Github at https://github.com/GuangqiangLi/TSA-SAN."
  },
  {
    "title": "Pseudo-Label Quality Decoupling and Correction for Semi-Supervised Instance Segmentation",
    "abstract": "Semi-Supervised Instance Segmentation (SSIS) involves classifying and grouping image pixels into distinct object instances using limited labeled data. This learning paradigm usually faces a significant challenge of unstable performance caused by noisy pseudo-labels of instance categories and pixel masks. We find that the prevalent practice of filtering instance pseudo-labels assessing both class and mask quality with a single score threshold, frequently leads to compromises in the trade-off between the qualities of class and mask labels. In this paper, we introduce a novel Pseudo-Label Quality Decoupling and Correction (PL-DC) framework for SSIS to tackle the above challenges. Firstly, at the instance level, a decoupled dual-threshold filtering mechanism is designed to decouple class and mask quality estimations for instance-level pseudo-labels, thereby independently controlling pixel classifying and grouping qualities. Secondly, at the category level, we introduce a dynamic instance category correction module to dynamically correct the pseudo-labels of instance categories, effectively alleviating category confusion. Lastly, we introduce a pixel-level mask uncertainty-aware mechanism at the pixel level to re-weight the mask loss for different pixels, thereby reducing the impact of noise introduced by pixel-level mask pseudo-labels. Extensive experiments on the COCO and Cityscapes datasets demonstrate that the proposed PL-DC achieves significant performance improvements, setting new state-of-the-art results for SSIS. Notably, our PL-DC shows substantial gains even with minimal labeled data, achieving an improvement of +11.6 mAP with just 1% COCO labeled data and +15.5 mAP with 5% Cityscapes labeled data. The code will be public."
  }
]