[
  {
    "title": "Generalizing imaging biomarker repeatability studies using Bayesian inference: Applications in detecting heterogeneous treatment response in whole-body diffusion-weighted MRI of metastatic prostate cancer",
    "abstract": "The assessment of imaging biomarkers is critical for advancing precision medicine and improving disease characterization. Despite the availability of methods to derive disease heterogeneity metrics in imaging studies, a robust framework for evaluating measurement uncertainty remains underdeveloped. To address this gap, we propose a novel Bayesian framework to assess the precision of disease heterogeneity measures in biomarker studies. Our approach extends traditional methods for evaluating biomarker precision by providing greater flexibility in statistical assumptions and enabling the analysis of biomarkers beyond univariate or multivariate normally-distributed variables. Using Hamiltonian Monte Carlo sampling, the framework supports both, for example, normally-distributed and Dirichlet-Multinomial distributed variables, enabling the derivation of posterior distributions for biomarker parameters under diverse model assumptions. Designed to be broadly applicable across various imaging modalities and biomarker types, the framework builds a foundation for generalizing reproducible and objective biomarker evaluation. To demonstrate utility, we apply the framework to whole-body diffusion-weighted MRI (WBDWI) to assess heterogeneous therapeutic responses in metastatic bone disease. Specifically, we analyze data from two patient studies investigating treatments for metastatic castrate-resistant prostate cancer (mCRPC). Our results reveal an approximately 70% response rate among individual tumors across both studies, objectively characterizing differential responses to systemic therapies and validating the clinical relevance of the proposed methodology. This Bayesian framework provides a powerful tool for advancing biomarker research across diverse imaging-based studies while offering valuable insights into specific clinical applications, such as mCRPC treatment response."
  },
  {
    "title": "Signal-based AI-driven software solution for automated quantification of metastatic bone disease and treatment response assessment using Whole-Body Diffusion-Weighted MRI (WB-DWI) biomarkers in Advanced Prostate Cancer",
    "abstract": "We developed an AI-driven software solution to quantify metastatic bone disease from WB-DWI scans. Core technologies include: (i) a weakly-supervised Residual U-Net model generating a skeleton probability map to isolate bone; (ii) a statistical framework for WB-DWI intensity normalisation, obtaining a signal-normalised b=900s/mm^2 (b900) image; and (iii) a shallow convolutional neural network that processes outputs from (i) and (ii) to generate a mask of suspected bone lesions, characterised by higher b900 signal intensity due to restricted water diffusion. This mask is applied to the gADC map to extract TDV and gADC statistics. We tested the tool using expert-defined metastatic bone disease delineations on 66 datasets, assessed repeatability of imaging biomarkers (N=10), and compared software-based response assessment with a construct reference standard based on clinical, laboratory and imaging assessments (N=118). Dice score between manual and automated delineations was 0.6 for lesions within pelvis and spine, with an average surface distance of 2mm. Relative differences for log-transformed TDV (log-TDV) and median gADC were below 9% and 5%, respectively. Repeatability analysis showed coefficients of variation of 4.57% for log-TDV and 3.54% for median gADC, with intraclass correlation coefficients above 0.9. The software achieved 80.5% accuracy, 84.3% sensitivity, and 85.7% specificity in assessing response to treatment compared to the construct reference standard. Computation time generating a mask averaged 90 seconds per scan. Our software enables reproducible TDV and gADC quantification from WB-DWI scans for monitoring metastatic bone disease response, thus providing potentially useful measurements for clinical decision-making in APC patients."
  },
  {
    "title": "Predicting Surgical Safety Margins in Osteosarcoma Knee Resections: An Unsupervised Approach",
    "abstract": "According to the Pan American Health Organization, the number of cancer cases in Latin America was estimated at 4.2 million in 2022 and is projected to rise to 6.7 million by 2045. Osteosarcoma, one of the most common and deadly bone cancers affecting young people, is difficult to detect due to its unique texture and intensity. Surgical removal of osteosarcoma requires precise safety margins to ensure complete resection while preserving healthy tissue. Therefore, this study proposes a method for estimating the confidence interval of surgical safety margins in osteosarcoma surgery around the knee. The proposed approach uses MRI and X-ray data from open-source repositories, digital processing techniques, and unsupervised learning algorithms (such as k-means clustering) to define tumor boundaries. Experimental results highlight the potential for automated, patient-specific determination of safety margins."
  },
  {
    "title": "A Mechanism-Guided Inverse Engineering Framework to Unlock Design Principles of H-Bonded Organic Frameworks for Gas Separation",
    "abstract": "The diverse combinations of novel building blocks offer a vast design space for hydrogen-boned frameworks (HOFs), rendering it a great promise for gas separation and purification. However, the underlying separation mechanism facilitated by their unique hydrogen-bond networks has not yet been fully understood. In this work, a comprehensive understanding of the separation mechanisms was achieved through an iterative data-driven inverse engineering approach established upon a hypothetical HOF database possessing nearly 110,000 structures created by a material genomics method. Leveraging a simple yet universal feature extracted from hydrogen bonding information with unambiguous physical meanings, the entire design space was exploited to rapidly identify the optimization route towards novel HOF structures with superior Xe/Kr separation performance (selectivity >103). This work not only provides the first large-scale HOF database, but also demonstrates the enhanced machine learning interpretability of our model-driven iterative inverse design framework, offering new insights into the rational design of nanoporous materials for gas separation."
  },
  {
    "title": "Path and Bone-Contour Regularized Unpaired MRI-to-CT Translation",
    "abstract": "Accurate MRI-to-CT translation promises the integration of complementary imaging information without the need for additional imaging sessions. Given the practical challenges associated with acquiring paired MRI and CT scans, the development of robust methods capable of leveraging unpaired datasets is essential for advancing the MRI-to-CT translation. Current unpaired MRI-to-CT translation methods, which predominantly rely on cycle consistency and contrastive learning frameworks, frequently encounter challenges in accurately translating anatomical features that are highly discernible on CT but less distinguishable on MRI, such as bone structures. This limitation renders these approaches less suitable for applications in radiation therapy, where precise bone representation is essential for accurate treatment planning. To address this challenge, we propose a path- and bone-contour regularized approach for unpaired MRI-to-CT translation. In our method, MRI and CT images are projected to a shared latent space, where the MRI-to-CT mapping is modeled as a continuous flow governed by neural ordinary differential equations. The optimal mapping is obtained by minimizing the transition path length of the flow. To enhance the accuracy of translated bone structures, we introduce a trainable neural network to generate bone contours from MRI and implement mechanisms to directly and indirectly encourage the model to focus on bone contours and their adjacent regions. Evaluations conducted on three datasets demonstrate that our method outperforms existing unpaired MRI-to-CT translation approaches, achieving lower overall error rates. Moreover, in a downstream bone segmentation task, our approach exhibits superior performance in preserving the fidelity of bone structures. Our code is available at: https://github.com/kennysyp/PaBoT."
  },
  {
    "title": "GAME: Learning Multimodal Interactions via Graph Structures for Personality Trait Estimation",
    "abstract": "Apparent personality analysis from short videos poses significant chal-lenges due to the complex interplay of visual, auditory, and textual cues. In this paper, we propose GAME, a Graph-Augmented Multimodal Encoder designed to robustly model and fuse multi-source features for automatic personality prediction. For the visual stream, we construct a facial graph and introduce a dual-branch Geo Two-Stream Network, which combines Graph Convolutional Networks (GCNs) and Convolutional Neural Net-works (CNNs) with attention mechanisms to capture both structural and appearance-based facial cues. Complementing this, global context and iden-tity features are extracted using pretrained ResNet18 and VGGFace back-bones. To capture temporal dynamics, frame-level features are processed by a BiGRU enhanced with temporal attention modules. Meanwhile, audio representations are derived from the VGGish network, and linguistic se-mantics are captured via the XLM-Roberta transformer. To achieve effective multimodal integration, we propose a Channel Attention-based Fusion module, followed by a Multi-Layer Perceptron (MLP) regression head for predicting personality traits. Extensive experiments show that GAME con-sistently outperforms existing methods across multiple benchmarks, vali-dating its effectiveness and generalizability."
  },
  {
    "title": "OBD-Finder: Explainable Coarse-to-Fine Text-Centric Oracle Bone Duplicates Discovery",
    "abstract": "Oracle Bone Inscription (OBI) is the earliest systematic writing system in China, while the identification of Oracle Bone (OB) duplicates is a fundamental issue in OBI research. In this work, we design a progressive OB duplicate discovery framework that combines unsupervised low-level keypoints matching with high-level text-centric content-based matching to refine and rank the candidate OB duplicates with semantic awareness and interpretability. We compare our approach with state-of-the-art content-based image retrieval and image matching methods, showing that our approach yields comparable recall performance and the highest simplified mean reciprocal rank scores for both Top-5 and Top-15 retrieval results, and with significantly accelerated computation efficiency. We have discovered over 60 pairs of new OB duplicates in real-world deployment, which were missed by OBI researchers for decades. The models, video illustration and demonstration of this work are available at: https://github.com/cszhangLMU/OBD-Finder/."
  },
  {
    "title": "Accelerating Volumetric Medical Image Annotation via Short-Long Memory SAM 2",
    "abstract": "Manual annotation of volumetric medical images, such as magnetic resonance imaging (MRI) and computed tomography (CT), is a labor-intensive and time-consuming process. Recent advancements in foundation models for video object segmentation, such as Segment Anything Model 2 (SAM 2), offer a potential opportunity to significantly speed up the annotation process by manually annotating one or a few slices and then propagating target masks across the entire volume. However, the performance of SAM 2 in this context varies. Our experiments show that relying on a single memory bank and attention module is prone to error propagation, particularly at boundary regions where the target is present in the previous slice but absent in the current one. To address this problem, we propose Short-Long Memory SAM 2 (SLM-SAM 2), a novel architecture that integrates distinct short-term and long-term memory banks with separate attention modules to improve segmentation accuracy. We evaluate SLM-SAM 2 on three public datasets covering organs, bones, and muscles across MRI and CT modalities. We show that the proposed method markedly outperforms the default SAM 2, achieving average Dice Similarity Coefficient improvement of 0.14 and 0.11 in the scenarios when 5 volumes and 1 volume are available for the initial adaptation, respectively. SLM-SAM 2 also exhibits stronger resistance to over-propagation, making a notable step toward more accurate automated annotation of medical images for segmentation model development."
  },
  {
    "title": "Myosin-driven advection and actin reorganization control the geometry of confined actomyosin gel",
    "abstract": "Harnessing nanoscale motor proteins to actively control material shape is a promising strategy in nanotechnology and material science. One notable system is the actomyosin network, composed of actin filaments and myosin motor proteins, providing a natural platform for constructing contractile, shape-adaptive materials. While the role of actomyosin in shaping cells has been extensively studied, the reverse question - how boundary shape affects the actomyosin system - remains poorly understood. Here, we present a microfabricated system that reveals how geometrical confinement directs the organization of actomyosin networks within microwells. By combining experimental and numerical analysis, we show that the asymmetric shape of the microwells is transferred to contracted actomyosin gels via myosin-driven actin flow. Furthermore, tuning myosin contractility and actin polymerization rate allows control over the size and shape of actomyosin gels. Our findings provide a bottom-up framework for integrating molecular motors and cytoskeletons into confined architectures to create responsive biomaterials."
  },
  {
    "title": "Speculative Evolution Through 3D Cellular Automata",
    "abstract": "This project explores speculative evolution through a 3D implementation of Conway's Game of Life, using procedural simulation to generate unfamiliar extraterrestrial organic forms. By applying a volumetric optimized workflow, the raw cellular structures are smoothed into unified, bone-like geometries that resemble hypothetical non-terrestrial morphologies. The resulting forms, strange yet organic, are 3D printed as fossil-like artifacts, presenting a tangible representation of generative structures. This process situates the work at the intersection of artificial life, evolutionary modeling, and digital fabrication, illustrating how simple rules can simulate complex biological emergence and challenge conventional notions of organic form."
  },
  {
    "title": "Hacktive Matter: data-driven discovery through hackathon-based cross-disciplinary coding",
    "abstract": "The past decade has seen unprecedented growth in active matter and autonomous biomaterials research, yielding diverse classes of materials that promise revolutionary applications such as self-healing infrastructure and self-sensing tissue implants. However, inconsistencies in metrics, definitions, and analysis algorithms across research groups, as well as the high-dimension data streams, has hindered identification of performance intersections. Progress in this arena demands multi-disciplinary team approaches to discovery with scaffolded training and cross-pollination of ideas, and requires new learning and collaboration methods. To address this challenge, we have developed a hackathon platform to train future scientists and engineers in big data, interdisciplinary collaboration, and community coding; and to design and beta-test high-throughput (HTP) biomaterials analysis software and workflows. We enforce a flat hierarchy, pairing participants ranging from high school students to faculty with varied experiences and skills to collectively contribute to data acquisition and processing, ideation, coding, testing and dissemination. With clearly-defined goals and deliverables, participants achieve success through a series of tutorials, small group coding sessions, facilitated breakouts, and large group report-outs and discussions. These modules facilitate efficient iterative algorithm development and optimization; strengthen community and collaboration skills; and establish teams, benchmarks, and community standards for continued productive work. Our hackathons provide a powerful model for the soft matter community to educate and train students and collaborators in cutting edge data-driven analysis, which is critical for future innovation in complex materials research."
  },
  {
    "title": "Topology, Kinetics and Inheritance in Clonal Colonies of Bone Marrow Stromal Cells",
    "abstract": "Bone marrow stromal cells (BMSCs), whose populations contain multipotent skeletal stem cells with relevant therapeutic applications, are known to produce very heterogeneous colonies upon in vitro culture, a trait that may severely hinder the clinical usefulness of BMSC-based therapies. Therefore, reaching a better insight on the nature of such heterogeneity, as well as on the factors determining it, is important. Here, by using time-lapse microscopy, we study the structure of N=28 human BMSC colonies from six donors, each colony derived from a single cell, and trace their lineage trees up to the seventh generation. We confirm the presence of very significant inter-colony and intra-colony heterogeneities, both in the topology of the lineages and in the replicative kinetics of the colonies. We also find that topology and kinetics are strongly correlated, consistent with the existence of regulating factors linking the sub-population of inactive cells, which uniquely determine a lineage's topology, and that of active cells, which are the sole responsible for the proliferation rate of the colony. Finally, we submit each colony to an entropy-based inheritance test, which measures the degree of non-random clustering of inactive cells within the same branches of the lineage, and find a clear signature of hereditary transmission of the probability of emergence of inactive cells in the largest majority of the experimental lineages."
  },
  {
    "title": "Thermoregulation Variation in Vertebrates Reveals Differences in Thermal Fatigue Resistance of Bones",
    "abstract": "In this study, we propose the hypothesis that there is a significant difference in thermal cycling fatigue resistance between the bones of ectothermic and endothermic animals. We performed an experiment to test whether bones of endothermic animals, having potentially lost their ability to adapt to thermal cycling, exhibit reduced resistance to thermal fatigue compared to ectothermic animals, which may have retained this adaptive trait due to their environmental conditions. The change in stiffness were determined using shifts in the resonant peaks of the frequency spectrum obtained from Resonant Ultrasonic Spectroscopy (RUS). To achieve this, samples of compact (cortical) and spongy bone tissue were extracted and polished before undergoing a 29-day period of thermal cycling. The changes in the resonance frequencies were then observed. Changes in resonant frequencies imply corresponding changes in elastic constants. The primary findings indicated that bones from ectothermic species exhibited minimal changes in elastic properties compared to those from endothermic species, as evidenced by the smaller shifts in resonant peak magnitudes following thermal cycling."
  },
  {
    "title": "Conditional-Marginal Nonparametric Estimation for Stage Waiting Times from Multi-Stage Models under Dependent Right Censoring",
    "abstract": "We investigate two population-level quantities (corresponding to complete data) related to uncensored stage waiting times in a progressive multi-stage model, conditional on a prior stage visit. We show how to estimate these quantities consistently using right-censored data. The first quantity is the stage waiting time distribution (survival function), representing the proportion of individuals who remain in stage j within time t after entering stage j. The second quantity is the cumulative incidence function, representing the proportion of individuals who transition from stage j to stage j' within time t after entering stage j. To estimate these quantities, we present two nonparametric approaches. The first uses an inverse probability of censoring weighting (IPCW) method, which reweights the counting processes and the number of individuals at risk (the at-risk set) to address dependent right censoring. The second method utilizes the notion of fractional observations (FRE) that modifies the at-risk set by incorporating probabilities of individuals (who might have been censored in a prior stage) eventually entering the stage of interest in the uncensored or full data experiment. Neither approach is limited to the assumption of independent censoring or Markovian multi-stage frameworks. Simulation studies demonstrate satisfactory performance for both sets of estimators, though the IPCW estimator generally outperforms the FRE estimator in the setups considered in our simulations. These estimations are further illustrated through applications to two real-world datasets: one from patients undergoing bone marrow transplants and the other from patients diagnosed with breast cancer."
  },
  {
    "title": "DataS^3: Dataset Subset Selection for Specialization",
    "abstract": "In many real-world machine learning (ML) applications (e.g. detecting broken bones in x-ray images, detecting species in camera traps), in practice models need to perform well on specific deployments (e.g. a specific hospital, a specific national park) rather than the domain broadly. However, deployments often have imbalanced, unique data distributions. Discrepancy between the training distribution and the deployment distribution can lead to suboptimal performance, highlighting the need to select deployment-specialized subsets from the available training data. We formalize dataset subset selection for specialization (DS3): given a training set drawn from a general distribution and a (potentially unlabeled) query set drawn from the desired deployment-specific distribution, the goal is to select a subset of the training data that optimizes deployment performance. We introduce DataS^3; the first dataset and benchmark designed specifically for the DS3 problem. DataS^3 encompasses diverse real-world application domains, each with a set of distinct deployments to specialize in. We conduct a comprehensive study evaluating algorithms from various families--including coresets, data filtering, and data curation--on DataS^3, and find that general-distribution methods consistently fail on deployment-specific tasks. Additionally, we demonstrate the existence of manually curated (deployment-specific) expert subsets that outperform training on all available data with accuracy gains up to 51.3 percent. Our benchmark highlights the critical role of tailored dataset curation in enhancing performance and training efficiency on deployment-specific distributions, which we posit will only become more important as global, public datasets become available across domains and ML models are deployed in the real world."
  },
  {
    "title": "Functional Amyloid Fibrils as Versatile Tools for Novel Biomaterials",
    "abstract": "Functional amyloid fibrils, once primarily associated with amyloidosis, are now recognized for their exceptional potential as biomaterials due to their unique structural features, including remarkable mechanical strength, high stability, and self-assembly capabilities. This review highlights their transformative applications across a wide range of industries, from cutting-edge drug delivery systems and next-generation biosensors to tissue engineering, surface technologies, energy storage, and environmental solutions. Their versatility extends into innovative sectors like information transfer systems, cell adhesion, protein fusion, food technology, and novel catalytic systems. Despite significant progress, critical gaps remain in the research. This review not only consolidates current applications but also underscores the vast potential for future advancements, positioning functional amyloids as key players in emerging biomaterials technologies."
  },
  {
    "title": "OBIFormer: A Fast Attentive Denoising Framework for Oracle Bone Inscriptions",
    "abstract": "Oracle bone inscriptions (OBIs) are the earliest known form of Chinese characters and serve as a valuable resource for research in anthropology and archaeology. However, most excavated fragments are severely degraded due to thousands of years of natural weathering, corrosion, and man-made destruction, making automatic OBI recognition extremely challenging. Previous methods either focus on pixel-level information or utilize vanilla transformers for glyph-based OBI denoising, which leads to tremendous computational overhead. Therefore, this paper proposes a fast attentive denoising framework for oracle bone inscriptions, i.e., OBIFormer. It leverages channel-wise self-attention, glyph extraction, and selective kernel feature fusion to reconstruct denoised images precisely while being computationally efficient. Our OBIFormer achieves state-of-the-art denoising performance for PSNR and SSIM metrics on synthetic and original OBI datasets. Furthermore, comprehensive experiments on a real oracle dataset demonstrate the great potential of our OBIFormer in assisting automatic OBI recognition. The code will be made available at https://github.com/LJHolyGround/OBIFormer."
  },
  {
    "title": "One Model to Rig Them All: Diverse Skeleton Rigging with UniRig",
    "abstract": "The rapid evolution of 3D content creation, encompassing both AI-powered methods and traditional workflows, is driving an unprecedented demand for automated rigging solutions that can keep pace with the increasing complexity and diversity of 3D models. We introduce UniRig, a novel, unified framework for automatic skeletal rigging that leverages the power of large autoregressive models and a bone-point cross-attention mechanism to generate both high-quality skeletons and skinning weights. Unlike previous methods that struggle with complex or non-standard topologies, UniRig accurately predicts topologically valid skeleton structures thanks to a new Skeleton Tree Tokenization method that efficiently encodes hierarchical relationships within the skeleton. To train and evaluate UniRig, we present Rig-XL, a new large-scale dataset of over 14,000 rigged 3D models spanning a wide range of categories. UniRig significantly outperforms state-of-the-art academic and commercial methods, achieving a 215% improvement in rigging accuracy and a 194% improvement in motion accuracy on challenging datasets. Our method works seamlessly across diverse object categories, from detailed anime characters to complex organic and inorganic structures, demonstrating its versatility and robustness. By automating the tedious and time-consuming rigging process, UniRig has the potential to speed up animation pipelines with unprecedented ease and efficiency. Project Page: https://zjp-shadow.github.io/works/UniRig/"
  },
  {
    "title": "Quantum sensing with arbitrary frequency resolution via correlation measurements",
    "abstract": "Achieving high-frequency spectral resolution with quantum sensors, while crucial in fields ranging from physical to biological sciences, is challenging due to their finite coherence time. Here, we introduce a novel protocol that achieves this goal by measuring phase correlations of AC magnetic fields using ensembles of NV centers. Our method extends the sensing dynamic range to frequencies higher than the system's Rabi frequency while achieving arbitrary frequency resolution, limited only by the target field coherence time. Moreover, our approach operates more robustly with respect to the magnetic field's amplitude. Thanks to this robustness, our protocol allows the application of more $\\pi$-pulses in pulse sequences such as CPMG, enabling the decoupling of a broader range of frequency noise. The higher harmonics generated in this process continue to act as a part of the signal, ultimately improving the frequency resolution. This method paves the way for achieving arbitrary frequency resolution with improved performances, making it highly versatile for quantum sensing applications across diverse scientific fields."
  },
  {
    "title": "A Category-Fragment Segmentation Framework for Pelvic Fracture Segmentation in X-ray Images",
    "abstract": "Pelvic fractures, often caused by high-impact trauma, frequently require surgical intervention. Imaging techniques such as CT and 2D X-ray imaging are used to transfer the surgical plan to the operating room through image registration, enabling quick intraoperative adjustments. Specifically, segmenting pelvic fractures from 2D X-ray imaging can assist in accurately positioning bone fragments and guiding the placement of screws or metal plates. In this study, we propose a novel deep learning-based category and fragment segmentation (CFS) framework for the automatic segmentation of pelvic bone fragments in 2D X-ray images. The framework consists of three consecutive steps: category segmentation, fragment segmentation, and post-processing. Our best model achieves an IoU of 0.91 for anatomical structures and 0.78 for fracture segmentation. Results demonstrate that the CFS framework is effective and accurate."
  },
  {
    "title": "ICAFS: Inter-Client-Aware Feature Selection for Vertical Federated Learning",
    "abstract": "Vertical federated learning (VFL) enables a paradigm for vertically partitioned data across clients to collaboratively train machine learning models. Feature selection (FS) plays a crucial role in Vertical Federated Learning (VFL) due to the unique nature that data are distributed across multiple clients. In VFL, different clients possess distinct subsets of features for overlapping data samples, making the process of identifying and selecting the most relevant features a complex yet essential task. Previous FS efforts have primarily revolved around intra-client feature selection, overlooking vital feature interaction across clients, leading to subpar model outcomes. We introduce ICAFS, a novel multi-stage ensemble approach for effective FS in VFL by considering inter-client interactions. By employing conditional feature synthesis alongside multiple learnable feature selectors, ICAFS facilitates ensemble FS over these selectors using synthetic embeddings. This method bypasses the limitations of private gradient sharing and allows for model training using real data with refined embeddings. Experiments on multiple real-world datasets demonstrate that ICAFS surpasses current state-of-the-art methods in prediction accuracy."
  },
  {
    "title": "Mitigating Long-tail Distribution in Oracle Bone Inscriptions: Dataset, Model, and Benchmark",
    "abstract": "The oracle bone inscription (OBI) recognition plays a significant role in understanding the history and culture of ancient China. However, the existing OBI datasets suffer from a long-tail distribution problem, leading to biased performance of OBI recognition models across majority and minority classes. With recent advancements in generative models, OBI synthesis-based data augmentation has become a promising avenue to expand the sample size of minority classes. Unfortunately, current OBI datasets lack large-scale structure-aligned image pairs for generative model training. To address these problems, we first present the Oracle-P15K, a structure-aligned OBI dataset for OBI generation and denoising, consisting of 14,542 images infused with domain knowledge from OBI experts. Second, we propose a diffusion model-based pseudo OBI generator, called OBIDiff, to achieve realistic and controllable OBI generation. Given a clean glyph image and a target rubbing-style image, it can effectively transfer the noise style of the original rubbing to the glyph image. Extensive experiments on OBI downstream tasks and user preference studies show the effectiveness of the proposed Oracle-P15K dataset and demonstrate that OBIDiff can accurately preserve inherent glyph structures while transferring authentic rubbing styles effectively."
  },
  {
    "title": "X2BR: High-Fidelity 3D Bone Reconstruction from a Planar X-Ray Image with Hybrid Neural Implicit Methods",
    "abstract": "Accurate 3D bone reconstruction from a single planar X-ray remains a challenge due to anatomical complexity and limited input data. We propose X2BR, a hybrid neural implicit framework that combines continuous volumetric reconstruction with template-guided non-rigid registration. The core network, X2B, employs a ConvNeXt-based encoder to extract spatial features from X-rays and predict high-fidelity 3D bone occupancy fields without relying on statistical shape models. To further refine anatomical accuracy, X2BR integrates a patient-specific template mesh, constructed using YOLOv9-based detection and the SKEL biomechanical skeleton model. The coarse reconstruction is aligned to the template using geodesic-based coherent point drift, enabling anatomically consistent 3D bone volumes. Experimental results on a clinical dataset show that X2B achieves the highest numerical accuracy, with an IoU of 0.952 and Chamfer-L1 distance of 0.005, outperforming recent baselines including X2V and D2IM-Net. Building on this, X2BR incorporates anatomical priors via YOLOv9-based bone detection and biomechanical template alignment, leading to reconstructions that, while slightly lower in IoU (0.875), offer superior anatomical realism, especially in rib curvature and vertebral alignment. This numerical accuracy vs. visual consistency trade-off between X2B and X2BR highlights the value of hybrid frameworks for clinically relevant 3D reconstructions."
  },
  {
    "title": "Customizing Spider Silk: Generative Models with Mechanical Property Conditioning for Protein Engineering",
    "abstract": "The remarkable mechanical properties of spider silk, including its tensile strength and extensibility, are primarily governed by the repetitive regions of the proteins that constitute the fiber, the major ampullate spidroins (MaSps). However, establishing correlations between mechanical characteristics and repeat sequences is challenging due to the intricate sequence-structure-function relationships of MaSps and the limited availability of annotated datasets. In this study, we present a novel computational framework for designing MaSp repeat sequences with customizable mechanical properties. To achieve this, we developed a lightweight GPT-based generative model by distilling the pre-trained ProtGPT2 protein language model. The distilled model was subjected to multilevel fine-tuning using curated subsets of the Spider Silkome dataset. Specifically, we adapt the model for MaSp repeat generation using 6,000 MaSp repeat sequences and further refine it with 572 repeats associated with experimentally determined fiber-level mechanical properties. Our model generates biologically plausible MaSp repeat regions tailored to specific mechanical properties while also predicting those properties for given sequences. Validation includes sequence-level analysis, assessing physicochemical attributes and expected distribution of key motifs as well as secondary structure compositions. A correlation study using BLAST on the Spider Silkome dataset and a test set of MaSp repeats with known mechanical properties further confirmed the predictive accuracy of the model. This framework advances the rational design of spider silk-inspired biomaterials, offering a versatile tool for engineering protein sequences with tailored mechanical attributes."
  },
  {
    "title": "Synthetic CT Generation from Time-of-Flight Non-Attenutaion-Corrected PET for Whole-Body PET Attenuation Correction",
    "abstract": "Positron Emission Tomography (PET) imaging requires accurate attenuation correction (AC) to account for photon loss due to tissue density variations. In PET/MR systems, computed tomography (CT), which offers a straightforward estimation of AC is not available. This study presents a deep learning approach to generate synthetic CT (sCT) images directly from Time-of-Flight (TOF) non-attenuation corrected (NAC) PET images, enhancing AC for PET/MR. We first evaluated models pre-trained on large-scale natural image datasets for a CT-to-CT reconstruction task, finding that the pre-trained model outperformed those trained solely on medical datasets. The pre-trained model was then fine-tuned using an institutional dataset of 35 TOF NAC PET and CT volume pairs, achieving the lowest mean absolute error (MAE) of 74.49 HU and highest peak signal-to-noise ratio (PSNR) of 28.66 dB within the body contour region. Visual assessments demonstrated improved reconstruction of both bone and soft tissue structures from TOF NAC PET images. This work highlights the effectiveness of using pre-trained deep learning models for medical image translation tasks. Future work will assess the impact of sCT on PET attenuation correction and explore additional neural network architectures and datasets to further enhance performance and practical applications in PET imaging."
  },
  {
    "title": "UKBOB: One Billion MRI Labeled Masks for Generalizable 3D Medical Image Segmentation",
    "abstract": "In medical imaging, the primary challenge is collecting large-scale labeled data due to privacy concerns, logistics, and high labeling costs. In this work, we present the UK Biobank Organs and Bones (UKBOB), the largest labeled dataset of body organs, comprising 51,761 MRI 3D samples (equivalent to 17.9 million 2D images) and more than 1.37 billion 2D segmentation masks of 72 organs, all based on the UK Biobank MRI dataset. We utilize automatic labeling, introduce an automated label cleaning pipeline with organ-specific filters, and manually annotate a subset of 300 MRIs with 11 abdominal classes to validate the quality (referred to as UKBOB-manual). This approach allows for scaling up the dataset collection while maintaining confidence in the labels. We further confirm the validity of the labels by demonstrating zero-shot generalization of trained models on the filtered UKBOB to other small labeled datasets from similar domains (e.g., abdominal MRI). To further mitigate the effect of noisy labels, we propose a novel method called Entropy Test-time Adaptation (ETTA) to refine the segmentation output. We use UKBOB to train a foundation model, Swin-BOB, for 3D medical image segmentation based on the Swin-UNetr architecture, achieving state-of-the-art results in several benchmarks in 3D medical imaging, including the BRATS brain MRI tumor challenge (with a 0.4% improvement) and the BTCV abdominal CT scan benchmark (with a 1.3% improvement). The pre-trained models and the code are available at https://emmanuelleb985.github.io/ukbob , and the filtered labels will be made available with the UK Biobank."
  },
  {
    "title": "Decoding the Ishango Bone: Unveiling Prehistoric Mathematical Art",
    "abstract": "The Ishango Bone, discovered in 1950 near the Semliki River in present-day Democratic Republic of Congo and dated to over 24,000 years ago, features a series of 16 grouped numerical notches arranged across three columns. The interpretation of these markings has long been debated, ranging from numerical intention to decorative symbolism. This study presents a newly identified structural pattern, uncovering four irregularities in the numerical groupings that, when resolved, reveal a consistent internal logic across all three columns. The analysis identifies repeating sums, dualistic pairing structures, and cross-column symmetry, pointing toward a deliberate and complex mathematical arrangement. These findings suggest the notches may have functioned as a form of reference system, potentially using stone markers for visual or narrative purposes. Hypotheses include links to cosmic cycles, mathematical instruction, or mythological integration. While interpretations remain speculative, this study argues for an interdisciplinary reevaluation of the Ishango Bone's significance in terms of mathematical, cultural, and cosmological understanding. It offers new insights into the symbolic thinking and cognitive capacities of prehistoric societies and challenges conventional assumptions about the origins of numeracy."
  },
  {
    "title": "Class Imbalance Correction for Improved Universal Lesion Detection and Tagging in CT",
    "abstract": "Radiologists routinely detect and size lesions in CT to stage cancer and assess tumor burden. To potentially aid their efforts, multiple lesion detection algorithms have been developed with a large public dataset called DeepLesion (32,735 lesions, 32,120 CT slices, 10,594 studies, 4,427 patients, 8 body part labels). However, this dataset contains missing measurements and lesion tags, and exhibits a severe imbalance in the number of lesions per label category. In this work, we utilize a limited subset of DeepLesion (6\\%, 1331 lesions, 1309 slices) containing lesion annotations and body part label tags to train a VFNet model to detect lesions and tag them. We address the class imbalance by conducting three experiments: 1) Balancing data by the body part labels, 2) Balancing data by the number of lesions per patient, and 3) Balancing data by the lesion size. In contrast to a randomly sampled (unbalanced) data subset, our results indicated that balancing the body part labels always increased sensitivity for lesions >= 1cm for classes with low data quantities (Bone: 80\\% vs. 46\\%, Kidney: 77\\% vs. 61\\%, Soft Tissue: 70\\% vs. 60\\%, Pelvis: 83\\% vs. 76\\%). Similar trends were seen for three other models tested (FasterRCNN, RetinaNet, FoveaBox). Balancing data by lesion size also helped the VFNet model improve recalls for all classes in contrast to an unbalanced dataset. We also provide a structured reporting guideline for a ``Lesions'' subsection to be entered into the ``Findings'' section of a radiology report. To our knowledge, we are the first to report the class imbalance in DeepLesion, and have taken data-driven steps to address it in the context of joint lesion detection and tagging."
  },
  {
    "title": "GARF: Learning Generalizable 3D Reassembly for Real-World Fractures",
    "abstract": "3D reassembly is a challenging spatial intelligence task with broad applications across scientific domains. While large-scale synthetic datasets have fueled promising learning-based approaches, their generalizability to different domains is limited. Critically, it remains uncertain whether models trained on synthetic datasets can generalize to real-world fractures where breakage patterns are more complex. To bridge this gap, we propose GARF, a generalizable 3D reassembly framework for real-world fractures. GARF leverages fracture-aware pretraining to learn fracture features from individual fragments, with flow matching enabling precise 6-DoF alignments. At inference time, we introduce one-step preassembly, improving robustness to unseen objects and varying numbers of fractures. In collaboration with archaeologists, paleoanthropologists, and ornithologists, we curate Fractura, a diverse dataset for vision and learning communities, featuring real-world fracture types across ceramics, bones, eggshells, and lithics. Comprehensive experiments have shown our approach consistently outperforms state-of-the-art methods on both synthetic and real-world datasets, achieving 82.87\\% lower rotation error and 25.15\\% higher part accuracy. This sheds light on training on synthetic data to advance real-world 3D puzzle solving, demonstrating its strong generalization across unseen object shapes and diverse fracture types."
  },
  {
    "title": "Performance Analysis of Deep Learning Models for Femur Segmentation in MRI Scan",
    "abstract": "Convolutional neural networks like U-Net excel in medical image segmentation, while attention mechanisms and KAN enhance feature extraction. Meta's SAM 2 uses Vision Transformers for prompt-based segmentation without fine-tuning. However, biases in these models impact generalization with limited data. In this study, we systematically evaluate and compare the performance of three CNN-based models, i.e., U-Net, Attention U-Net, and U-KAN, and one transformer-based model, i.e., SAM 2 for segmenting femur bone structures in MRI scan. The dataset comprises 11,164 MRI scans with detailed annotations of femoral regions. Performance is assessed using the Dice Similarity Coefficient, which ranges from 0.932 to 0.954. Attention U-Net achieves the highest overall scores, while U-KAN demonstrated superior performance in anatomical regions with a smaller region of interest, leveraging its enhanced learning capacity to improve segmentation accuracy."
  },
  {
    "title": "Plasma-Treated Polymeric Biomaterials for Improved Surface and Cell Adhesion",
    "abstract": "Surface modification of polymeric biomaterials using plasma has emerged as an effective strategy to optimize the cell-material interface without compromising the structural properties of the material. This work presents a critical review of the impact of low-temperature plasma treatment on enhancing cell adhesion, with emphasis on the physicochemical changes induced on the surface of polymers commonly used in biomedical applications. The mechanisms of interaction between reactive plasma species and the polymer surface are analyzed, along with techniques used to introduce hydrophilic functional groups that improve wettability and biocompatibility. Scientific evidence demonstrates that this type of surface modification promotes greater cell spreading, anchorage, and proliferation, making it particularly useful in the design of tissue engineering scaffolds, implantable devices, and vascular prostheses. Finally, current and future trends in the development of smart plasma-functionalized biomaterials are discussed, highlighting their role in regenerative medicine."
  },
  {
    "title": "Continuum Damage Modeling of Biaxial Fatigue Failure in Whole Bone: A Hybrid Approach with Machine Learning Integration",
    "abstract": "Repetitive loading of bone is associated with microdamage accumulation and material property degradation that may ultimately result in fatigue fracture. Our previous work used continuum damage mechanics (CDM)-based finite element (FE) modeling to predict stiffness loss and fatigue failure in whole bone; however, this model did not account for inter-specimen variability in fatigue behaviour and multiaxial loading effects, which limited its applied efficacy. In this study, we refined the CDM-based FE model to predict experimental fatigue-life measurements from 21 whole rabbit tibiae subjected to cyclic axial compression with different magnitudes of superposed torsion. Machine learning (ML) methods were used to predict damage parameters from initial, undamaged, conditions, which were then used to predicted stiffness degradation and fatigue failure with the CDM-based FE modeling pipeline. Regression analysis was used to compare CDM-based FE fatigue-life predictions with experimental measurements. A random forest ML model predicted specimen-specific damage parameters with high accuracy (R2 = 0.85) and the CDM-based FE models demonstrated remarkable predictive capability, explaining up to 91% of the variance in fatigue-life measurements. Stiffness degradation profiles also followed a similar trend to experimental measurements; however, this agreement worsened with the level of superposed torsion suggesting additional refinements to the model may be necessary. These findings demonstrate the efficacy of integrating ML with CDM-based FE modeling to predict fatigue life and stiffness degradation. The observed agreement with experimental measurements suggests the modeling framework may provide valuable information regarding the mechanisms of fatigue fracture in whole bone"
  },
  {
    "title": "Effect of new healthy and live food supplement on Anemia disease in Wistar rats",
    "abstract": "Anemia is a decrease in hemoglobin and red blood cells and due to a decrease in hemoglobin, oxygen carrying capacity reduce. In this disease, the red blood cell the amount and volume decrease. In this research, healthy and live food powder were synthesized by a green route. This organic biomaterial was named NBS. The NBS healthy and live food powder has various vitamins, macro and micro molecules, and ingredients. Twenty Wistar rats were randomly divided into 4 equal groups, including control and treatment groups 1, 2 and 3. Nutritional supplements for healthy living were administered orally via gavage to rats in groups 1, 2, and 3 at 12.5, 25, and 50 mg/ kg, respectively, and within a period of 20 days, one day in between. There was no intervention in the control group in order to reach baseline blood factors. At the end of the study, blood samples were taken from the heart, including blood-red blood cells, hemoglobin, hematocrit and platelets using a fully automated blood cell counting machine. The results showed that the new dietary supplement reduced the level of hematocrit and platelets in the studied rats. The healthy and live food supplement at a concentration of 50 mg / kg increased blood levels compared to the control group. The results of this study showed that the use of healthy and live food supplement increased blood factors compared to the control group."
  },
  {
    "title": "Anisotropy analysis of bamboo and tooth using 4-angle polarization micro-spectroscopy",
    "abstract": "To investigate the anisotropic properties of biomaterials, two distinct classes are considered: polymer-based (e.g., cellulose in plants) and crystalline-based (e.g., enamel in teeth), each demonstrating distinct structural and functional characteristics. Four-angle polarization (4-pol.) spectral mapping of sub-1 {\\mu}m bamboo slices was carried out in the mid-IR spectral range (2.5-20 {\\mu}m) to reveal the 3D organization of the chemical bonding of cellulose using the key characteristic absorption bands associated with C-O-C and C-N vibrational modes. The longitudinal and transverse microtome slices revealed a switch between the presence and absence of dichroism in parenchyma cell walls and vascular bundles. The cell wall showed continuous alignment of the C-O-C stretching vibrational mode (8.6 {\\mu}m/1163 cm-1) down to the pixel resolution of ~ 4 {\\mu}m (the step size in imaging) in the transverse slice; the cell wall thickness is ~ 1 {\\mu}m. Thin microtomed slices of a tooth were measured in transmission and reflection modes. The single-point reflection measurements, performed using two perpendicular orientations, revealed orientational anisotropy in the enamel, which was absent in the dentin region. High sub-diffraction limited lateral resolution was numerically validated using a simplified-model of a Gaussian beam reading out material pixels with a defined orientation of absorption. It is shown that the orientation of small ~ {\\lambda}/10 ~ 1 {\\mu}m objects can be revealed using a focal spot of ~ {\\lambda}/NA ~ 20 {\\mu}m, defining the diffraction limit for the objective lens with a numerical aperture NA ~ 0.5."
  },
  {
    "title": "Benchmark of Segmentation Techniques for Pelvic Fracture in CT and X-ray: Summary of the PENGWIN 2024 Challenge",
    "abstract": "The segmentation of pelvic fracture fragments in CT and X-ray images is crucial for trauma diagnosis, surgical planning, and intraoperative guidance. However, accurately and efficiently delineating the bone fragments remains a significant challenge due to complex anatomy and imaging limitations. The PENGWIN challenge, organized as a MICCAI 2024 satellite event, aimed to advance automated fracture segmentation by benchmarking state-of-the-art algorithms on these complex tasks. A diverse dataset of 150 CT scans was collected from multiple clinical centers, and a large set of simulated X-ray images was generated using the DeepDRR method. Final submissions from 16 teams worldwide were evaluated under a rigorous multi-metric testing scheme. The top-performing CT algorithm achieved an average fragment-wise intersection over union (IoU) of 0.930, demonstrating satisfactory accuracy. However, in the X-ray task, the best algorithm attained an IoU of 0.774, highlighting the greater challenges posed by overlapping anatomical structures. Beyond the quantitative evaluation, the challenge revealed methodological diversity in algorithm design. Variations in instance representation, such as primary-secondary classification versus boundary-core separation, led to differing segmentation strategies. Despite promising results, the challenge also exposed inherent uncertainties in fragment definition, particularly in cases of incomplete fractures. These findings suggest that interactive segmentation approaches, integrating human decision-making with task-relevant information, may be essential for improving model reliability and clinical applicability."
  },
  {
    "title": "Dichotomies for \\#CSP on graphs that forbid a clique as a minor",
    "abstract": "We prove complexity dichotomies for \\#CSP problems (not necessarily symmetric) with Boolean domain and complex range on several typical minor-closed graph classes. These dichotomies give a complete characterization of the complexity of \\#CSP on graph classes that forbid a complete graph as a minor. In particular, we also demonstrate that, whether the maximum degree of vertices is bounded may influence the complexity on specific minor-closed graph classes, and this phenomenon has never been observed in the previous related studies. Furthermore, our proofs integrate the properties of each graph class with the techniques from counting complexity, and develop a systematic approach for analyzing the complexity of \\#CSP on these graph classes."
  },
  {
    "title": "Graph Classification and Radiomics Signature for Identification of Tuberculous Meningitis",
    "abstract": "Introduction: Tuberculous meningitis (TBM) is a serious brain infection caused by Mycobacterium tuberculosis, characterized by inflammation of the meninges covering the brain and spinal cord. Diagnosis often requires invasive lumbar puncture (LP) and cerebrospinal fluid (CSF) analysis. Objectives: This study aims to classify TBM patients using T1-weighted (T1w) non-contrast Magnetic Resonance Imaging (MRI) scans. We hypothesize that specific brain regions, such as the interpeduncular cisterns, bone, and corpus callosum, contain visual markers that can non-invasively distinguish TBM patients from healthy controls. We propose a novel Pixel-array Graphs Classifier (PAG-Classifier) that leverages spatial relationships between neighbouring 3D pixels in a graph-based framework to extract significant features through eigen decomposition. These features are then used to train machine learning classifiers for effective patient classification. We validate our approach using a radiomics-based methodology, classifying TBM patients based on relevant radiomics features. Results: We utilized an internal dataset consisting of 52 scans, 32 from confirmed TBM patients based on mycobacteria detection in CSF, and 20 from healthy individuals. We achieved a 5-fold cross-validated average F1 score of 85.71% for cistern regions with our PAG-Classifier and 92.85% with the radiomics features classifier, surpassing current state-of-the-art benchmarks by 15% and 22%, respectively. However, bone and corpus callosum regions showed poor classification effectiveness, with average F1 scores below 50%. Conclusion: Our study suggests that algorithms like the PAG-Classifier serve as effective tools for non-invasive TBM analysis, particularly by targeting the interpeduncular cistern. Findings indicate that the bone and corpus callosum regions lack distinctive patterns for differentiation."
  },
  {
    "title": "User authentication on earable devices via bone-conducted occlusion sounds",
    "abstract": "With the rapid development of mobile devices and the fast increase of sensitive data, secure and convenient mobile authentication technologies are desired. Except for traditional passwords, many mobile devices have biometric-based authentication methods (e.g., fingerprint, voiceprint, and face recognition), but they are vulnerable to spoofing attacks. To solve this problem, we study new biometric features which are based on the dental occlusion and find that the bone-conducted sound of dental occlusion collected in binaural canals contains unique features of individual bones and teeth. Motivated by this, we propose a novel authentication system, TeethPass+, which uses earbuds to collect occlusal sounds in binaural canals to achieve authentication. First, we design an event detection method based on spectrum variance to detect bone-conducted sounds. Then, we analyze the time-frequency domain of the sounds to filter out motion noises and extract unique features of users from four aspects: teeth structure, bone structure, occlusal location, and occlusal sound. Finally, we train a Triplet network to construct the user template, which is used to complete authentication. Through extensive experiments including 53 volunteers, the performance of TeethPass+ in different environments is verified. TeethPass+ achieves an accuracy of 98.6% and resists 99.7% of spoofing attacks."
  },
  {
    "title": "Computational Orthodontic Force Simulation: A Review",
    "abstract": "In orthodontic treatment, the biological response of the tooth, periodontal ligament, and bone complex to orthodontic force is crucial in influencing treatment outcomes. The challenge lies in accurately measuring, estimating, and predicting these forces during clinical procedures. This review aims to fill the gap in the literature by systematically summarizing existing research on orthodontic force simulation, examining common loading techniques and technologies, and discussing the potential for refining the orthodontic force simulation process. The literature was comprehensively reviewed, with an emphasis on the exploration of the biological mechanism of tooth movement. Studies were categorized based on force-loading techniques for both fixed and invisible orthodontic appliances. Finite element (FE) analysis stands out as the predominant technique for orthodontic force simulation, with a significant focus on fixed orthodontics but limited emphasis on invisible orthodontics. Current orthodontic force simulations tend to be fragmented, often considering only the instantaneous response to applied forces. There exists an urgent demand for a sophisticated analytical simulation model. Such a model, possibly leveraging advanced technologies like deep learning, holds the promise of forecasting orthodontic treatment outcomes with heightened precision and efficiency."
  },
  {
    "title": "Simple Feedfoward Neural Networks are Almost All You Need for Time Series Forecasting",
    "abstract": "Time series data are everywhere -- from finance to healthcare -- and each domain brings its own unique complexities and structures. While advanced models like Transformers and graph neural networks (GNNs) have gained popularity in time series forecasting, largely due to their success in tasks like language modeling, their added complexity is not always necessary. In our work, we show that simple feedforward neural networks (SFNNs) can achieve performance on par with, or even exceeding, these state-of-the-art models, while being simpler, smaller, faster, and more robust. Our analysis indicates that, in many cases, univariate SFNNs are sufficient, implying that modeling interactions between multiple series may offer only marginal benefits. Even when inter-series relationships are strong, a basic multivariate SFNN still delivers competitive results. We also examine some key design choices and offer guidelines on making informed decisions. Additionally, we critique existing benchmarking practices and propose an improved evaluation protocol. Although SFNNs may not be optimal for every situation (hence the ``almost'' in our title) they serve as a strong baseline that future time series forecasting methods should always be compared against."
  },
  {
    "title": "Internal Organ Localization Using Depth Images",
    "abstract": "Automated patient positioning is a crucial step in streamlining MRI workflows and enhancing patient throughput. RGB-D camera-based systems offer a promising approach to automate this process by leveraging depth information to estimate internal organ positions. This paper investigates the feasibility of a learning-based framework to infer approximate internal organ positions from the body surface. Our approach utilizes a large-scale dataset of MRI scans to train a deep learning model capable of accurately predicting organ positions and shapes from depth images alone. We demonstrate the effectiveness of our method in localization of multiple internal organs, including bones and soft tissues. Our findings suggest that RGB-D camera-based systems integrated into MRI workflows have the potential to streamline scanning procedures and improve patient experience by enabling accurate and automated patient positioning."
  },
  {
    "title": "A Multi-Site Study on AI-Driven Pathology Detection and Osteoarthritis Grading from Knee X-Ray",
    "abstract": "Introduction: Bone health disorders like osteoarthritis and osteoporosis pose major global health challenges, often leading to delayed diagnoses due to limited diagnostic tools. This study presents an AI-powered system that analyzes knee X-rays to detect key pathologies, including joint space narrowing, sclerosis, osteophytes, tibial spikes, alignment issues, and soft tissue anomalies. It also grades osteoarthritis severity, enabling timely, personalized treatment. Study Design: The research used 1.3 million knee X-rays from a multi-site Indian clinical trial across government, private, and SME hospitals. The dataset ensured diversity in demographics, imaging equipment, and clinical settings. Rigorous annotation and preprocessing yielded high-quality training datasets for pathology-specific models like ResNet15 for joint space narrowing and DenseNet for osteoarthritis grading. Performance: The AI system achieved strong diagnostic accuracy across diverse imaging environments. Pathology-specific models excelled in precision, recall, and NPV, validated using Mean Squared Error (MSE), Intersection over Union (IoU), and Dice coefficient. Subgroup analyses across age, gender, and manufacturer variations confirmed generalizability for real-world applications. Conclusion: This scalable, cost-effective solution for bone health diagnostics demonstrated robust performance in a multi-site trial. It holds promise for widespread adoption, especially in resource-limited healthcare settings, transforming bone health management and enabling proactive patient care."
  },
  {
    "title": "High efficiency quantification of $^{90}$Sr contamination in cow milk after a nuclear accident",
    "abstract": "Monitoring $^{90}$Sr contamination in milk following a nuclear accident is critical due to its radiotoxicity and calcium-mimicking behaviour, leading to accumulation in bones and teeth. This study presents a high-efficiency protocol for quantifying$^{90}$Sr in cow milk by integrating freeze-drying, high-temperature calcination, ion exchange chromatography and liquid scintillation spectroscopy (LSC). The method was validated using reference milk samples with 0.45~Bq/mL of $^{90}$Sr, achieving a chemical yield of 100 $\\pm$ 2\\%, ensuring near-complete recovery and accurate quantification. The minimum detectable activity (MDA) was estimated at 0.33 Bq/L under optimal conditions, demonstrating the protocol's sensitivity for low-level detection. A comparative analysis with existing methods centrifugation-based approaches and Dowex resin techniques revealed that our protocol outperforms in both strontium recovery and organic matter elimination. Alternative methods showed lower recovery rates (68 $\\pm$ 2\\% for Gu\\'erin's method, 65 $\\pm$6\\% for Dowex resin) and suffered from procedural drawbacks, such as incomplete organic matter removal. Applying this methodology to compare samples from certified laboratories confirmed its robustness, with liquid scintillation spectroscopy radioactivity values doubling after 14 days, consistent with secular equilibrium between $^{90}$Sr and $^{90}$Y. While the protocol is optimized for milk, future research should explore its applicability to other food matrices. The high yield, reliability, and ease of implementation position this method as an effective tool for nuclear emergency response and routine radiological monitoring."
  },
  {
    "title": "Regulation of Dendritic Cell Function by Ermiaosan via the EP4-cAMP-CREB Signaling Pathway",
    "abstract": "Ermiao San (EMS), a traditional Chinese medicine composed of Atractylodes macrocephala and Cortex Phellodendron, has demonstrated therapeutic efficacy in rheumatoid arthritis (RA). Studies suggest that EMS modulates dendritic cell (DC) maturation in adjuvant arthritis (AA) rats, though the precise mechanisms remain unclear. Prostaglandin receptor 4 (EP4) is critical in inflammation and DC function, while cyclic adenosine monophosphate (cAMP) regulates cellular signaling, potentially influencing RA pathogenesis via protein kinase A (PKA) and cAMP response element-binding protein (CREB) activation. EMS exerts protective effects in RA rats by suppressing DC functions, including reduced EP4 mRNA/protein expression, diminished cAMP levels, and impaired CREB phosphorylation. Additionally, serum from EMS-treated rats inhibited antigen uptake by bone marrow-derived DCs (BMDCs), downregulating CD40, CD80, and CD86 expression and altering pro-inflammatory cytokine secretion. Mechanistically, EMS-treated serum suppressed the EP4-cAMP pathway by decreasing EP4 protein expression and CREB activation, alongside reduced intracellular cAMP and PKA levels in BMDCs co-stimulated with PGE2 and TNF-a. These findings indicate that EMS alleviates RA by inhibiting the EP4-cAMP-CREB signaling axis in DCs, providing a scientific rationale for its clinical application in RA treatment."
  },
  {
    "title": "Matchgate signatures under variable permutations",
    "abstract": "In this article, we give a sufficient and necessary condition for determining whether a matchgate signature retains its property under a certain variable permutation, which can be checked in polynomial time. We also define the concept of permutable matchgate signatures, and use it to erase the gap between Pl-\\#CSP and \\#CSP on planar graphs in the previous study. We provide a detailed characterization of permutable matchgate signatures as well, by presenting their relation to symmetric matchgate signatures. In addition, we prove a dichotomy for Pl-$\\#R_D$-CSP where $D\\ge 3$ is an integer."
  },
  {
    "title": "Domain-incremental White Blood Cell Classification with Privacy-aware Continual Learning",
    "abstract": "White blood cell (WBC) classification plays a vital role in hematology for diagnosing various medical conditions. However, it faces significant challenges due to domain shifts caused by variations in sample sources (e.g., blood or bone marrow) and differing imaging conditions across hospitals. Traditional deep learning models often suffer from catastrophic forgetting in such dynamic environments, while foundation models, though generally robust, experience performance degradation when the distribution of inference data differs from that of the training data. To address these challenges, we propose a generative replay-based Continual Learning (CL) strategy designed to prevent forgetting in foundation models for WBC classification. Our method employs lightweight generators to mimic past data with a synthetic latent representation to enable privacy-preserving replay. To showcase the effectiveness, we carry out extensive experiments with a total of four datasets with different task ordering and four backbone models including ResNet50, RetCCL, CTransPath, and UNI. Experimental results demonstrate that conventional fine-tuning methods degrade performance on previously learned tasks and struggle with domain shifts. In contrast, our continual learning strategy effectively mitigates catastrophic forgetting, preserving model performance across varying domains. This work presents a practical solution for maintaining reliable WBC classification in real-world clinical settings, where data distributions frequently evolve."
  },
  {
    "title": "Advancing atom probe tomography capabilities to understand bone microstructures at the near-atomic scale",
    "abstract": "Bone structure is generally hierarchically organized into organic (collagen, proteins,...), inorganic (hydroxyapatite (HAP)) components. However, many fundamental mechanisms of the biomineralization processes such as HAP formation, the influence of trace elements, the mineral-collagen arrangement, etc., are not clearly understood. This is partly due to the analytical challenge of simultaneously characterizing the three-dimensional (3D) structure and chemical composition of biominerals in general at the nanometer scale, which can, in principle be achieved by atom probe tomography (APT). Yet, the hierarchical structures of bone represent a critical hurdle for APT analysis in terms of sample yield and analytical resolution, particularly for trace elements, and organic components from the collagen appear to systematically get lost from the analysis. Here, we applied in-situ metallic coating of APT specimens within the focused ion beam (FIB) used for preparing specimens, and demonstrate that the sample yield and chemical sensitivity are tremendously improved, allowing the analysis of individual collagen fibrils and trace elements such as Mg and Na. We explored a range of measurement parameters with and without coating, in terms of analytical resolution performance and determined the best practice parameters for analyzing bone samples in APT. To decipher the complex mass spectra of the bone specimens, reference spectra from pure HAP and collagen were acquired to unambiguously identify the signals, allowing us to analyze entire collagen fibrils and interfaces at the near-atomic scale. Our results open new possibilities for understanding the hierarchical structure and chemical heterogeneity of bone structures at the near-atomic level and demonstrate the potential of this new method to provide new, unexplored insights into biomineralization processes in the future."
  },
  {
    "title": "Micro-Macro Coupling for Optimizing Scaffold Mediated Bone Regeneration",
    "abstract": "This work presents a framework for modeling three-dimensional scaffold-mediated bone regeneration and the associated optimization problem. By incorporating microstructure into the model through periodic homogenization, we capture the effects of microscale fluctuations on the bone growth process. Numerical results and optimized scaffold designs that explicitly account for the microstructure are presented, demonstrating the potential of this approach for improving scaffold performance."
  },
  {
    "title": "Ex vivo experiment on vertebral body with defect representing bone metastasis",
    "abstract": "Osteolytic metastases located in the vertebrae reduce strength and enhance the risk of vertebral fractures. This risk can be predicted by means of validated finite element models, but their reproducibility needs to be assessed. For that purpose, experimental data are requested. The aim of this study was to conduct open-access experiments on vertebrae, with artificial defect representing lytic metastasis and using well-defined boundary conditions. Twelve lumbar vertebral bodies (L1) were prepared by removing the cortical endplates and creating defects that represent lytic metastases, by drilling the cancellous bone. Vertebral bodies were scanned using clinical High Resolution peripherical Quantitative Computed Tomography before and after defect creation for 3D reconstruction. The specimens were then tested under compression loading until failure. Surface Digital Image Correlation was used to assess strain fields on the anterior wall of the vertebral body. These data (biomechanics data and the tomographic images needed to build subject-specific models) are shared with the scientific community in order to assess different vertebral models on the same dataset."
  },
  {
    "title": "Modelling Material Injection Into Porous Structures With the Theory of Porous Media Under Non-isothermal Conditions",
    "abstract": "In this work, the Theory of Porous Media (TPM) is employed to model percutaneous vertebroplasty, a medical procedure in which acrylic cement is injected into cancellous vertebral bone. Previously, isothermal macroscale models have been derived to describe this material injection and the mechanical interactions which arise. However, the temperature of the injected cement is typically below the human body temperature, necessitating the extension of these models to the non-isothermal case. Following the modelling principles of the TPM and considering local thermal non-equilibrium conditions, our model introduces three energy balances as well as additional constitutive relations. If restricted to local thermal equilibrium conditions, our model equations are in agreement with other examples of TPM-based models. We observe that our model elicits physically reasonable behaviour in numerical simulations which employ parameter values and initial and boundary conditions relevant for our application. Noting that we neglect capillary effects, we claim our model to be thermodynamically consistent despite the employment of simplifying assumptions during its derivation, such as the Coleman and Noll procedure."
  }
]