[
  {
    "title": "SoftCoT++: Test-Time Scaling with Soft Chain-of-Thought Reasoning",
    "abstract": "Test-Time Scaling (TTS) refers to approaches that improve reasoning performance by allocating extra computation during inference, without altering the model's parameters. While existing TTS methods operate in a discrete token space by generating more intermediate steps, recent studies in Coconut and SoftCoT have demonstrated that thinking in the continuous latent space can further enhance the reasoning performance. Such latent thoughts encode informative thinking without the information loss associated with autoregressive token generation, sparking increased interest in continuous-space reasoning. Unlike discrete decoding, where repeated sampling enables exploring diverse reasoning paths, latent representations in continuous space are fixed for a given input, which limits diverse exploration, as all decoded paths originate from the same latent thought. To overcome this limitation, we introduce SoftCoT++ to extend SoftCoT to the Test-Time Scaling paradigm by enabling diverse exploration of thinking paths. Specifically, we perturb latent thoughts via multiple specialized initial tokens and apply contrastive learning to promote diversity among soft thought representations. Experiments across five reasoning benchmarks and two distinct LLM architectures demonstrate that SoftCoT++ significantly boosts SoftCoT and also outperforms SoftCoT with self-consistency scaling. Moreover, it shows strong compatibility with conventional scaling techniques such as self-consistency. Source code is available at https://github.com/xuyige/SoftCoT."
  },
  {
    "title": "UMArm: Untethered, Modular, Wearable, Soft Pneumatic Arm",
    "abstract": "Robotic arms are essential to modern industries, however, their adaptability to unstructured environments remains limited. Soft robotic arms, particularly those actuated pneumatically, offer greater adaptability in unstructured environments and enhanced safety for human-robot interaction. However, current pneumatic soft arms are constrained by limited degrees of freedom, precision, payload capacity, and reliance on bulky external pressure regulators. In this work, a novel pneumatically driven rigid-soft hybrid arm, ``UMArm'', is presented. The shortcomings of pneumatically actuated soft arms are addressed by densely integrating high-force-to-weight-ratio, self-regulated McKibben actuators onto a lightweight rigid spine structure. The modified McKibben actuators incorporate valves and controllers directly inside, eliminating the need for individual pressure lines and external regulators, significantly reducing system weight and complexity. Full untethered operation, high payload capacity, precision, and directionally tunable compliance are achieved by the UMArm. Portability is demonstrated through a wearable assistive arm experiment, and versatility is showcased by reconfiguring the system into an inchworm robot. The results of this work show that the high-degree-of-freedom, external-regulator-free pneumatically driven arm systems like the UMArm possess great potential for real-world unstructured environments."
  },
  {
    "title": "Polarization Signatures of Quasi-Periodic Oscillations in Simulated Tilted, Truncated Disks",
    "abstract": "We utilize the Monte-Carlo radiation transport code, \\pan, to create images, spectra, polarization maps, and light curves from a set of general relativistic magnetohydrodynamic simulations of tilted, truncated, black hole accretion disks. Truncation can have spectral and polarization signatures all its own; tilt introduces both inclination and azimuthal dependencies into the spectra and polarization; and precession and oscillations of the tilted accretion flow inside the truncation radius (what we posit to be the \"corona\") introduce time dependencies or periodicity to all of this. We use the ray-traced results from our simulations to evaluate the feasibility of measuring these effects, particularly in the context of current and future X-ray polarization observatories. Such detections could greatly improve our understanding of the geometry of accretion disks and coronae in the hard state, the physics of quasi-periodic oscillations (QPOs), and how system properties evolve as sources approach the hard-to-soft state transition."
  },
  {
    "title": "Chemically active droplets in crowded environments",
    "abstract": "Biomolecular condensates are essential for cellular organization and result from phase separation in systems far from thermodynamic equilibrium. Among various models, chemically active droplets play a significant role, consisting of proteins that switch between attractive and repulsive states via nonequilibrium chemical reactions. While field-based simulations have provided insights into their behavior, these coarse-grained approaches fail to capture molecular-scale effects, particularly in crowded cellular environments. Macromolecular crowding, a key feature of intracellular organization, strongly influences molecular transport within condensates, yet its quantitative impact remains underexplored. This study investigates the interplay between chemically active droplets and crowders by using particle-based models, that provide molecular insight, and a field-based model, that complements this picture. Surprisingly, crowding reduces droplet size while expanding the overall dense phase volume, challenging equilibrium-based expectations. This effect arises from the interplay between depletion interactions, diffusion hindrance, and nonequilibrium particle fluxes. Our findings provide a step towards a more comprehensive understanding of chemically active droplets in complex, realistic cellular environments."
  },
  {
    "title": "Delayed Active Swimmer in a Velocity Landscape",
    "abstract": "Self-propelled active particles exhibit delayed responses to environmental changes, modulating their propulsion speed through intrinsic sensing and feedback mechanisms. This adaptive behavior fundamentally determines their dynamics and self-organization in active matter systems, with implications for biological microswimmers and engineered microrobots. Here, we investigate active Brownian particles whose propulsion speed is governed by spatially varying activity landscapes, incorporating a temporal delay between environmental sensing and speed adaptation. Through analytical solutions derived for both short-time and long-time delay regimes, we demonstrate that steady-state density and polarization profiles exhibit maxima at characteristic delays. Significantly, we observe that the polarization profile undergoes sign reversal when the swimming distance during the delay time exceeds the characteristic diffusion length, providing a novel mechanism for controlling particle transport without external fields. Our theoretical predictions, validated through experimental observations and numerical simulations, establish time delay as a crucial control parameter for particle transport and organization in active matter systems. These findings provide insights into how biological microorganisms might use response delays to gain navigation advantages and suggest design principles for synthetic microswimmers with programmable responses to heterogeneous environments."
  },
  {
    "title": "Structure and dynamics of ionic liquids under shear flow",
    "abstract": "We investigate the intrinsic behavior of ionic liquids under shear flow, using a coarse-grained model of C4mim-PF6 as a prototypical example. The importance of long-ranged electrostatics is assessed as a function of shear rate by comparing Ewald and reaction field treatments. An appropriate comparison is achieved through the implementation of the proper Lees-Edwards boundary conditions within the ESPResSo++ simulation software. Our results demonstrate that while structural properties are relatively insensitive to the electrostatic treatment, the more accurate treatment via the Ewald approach is essential for studies of dynamics, in particular, at lower shear rates. Furthermore, we identify a critical shear rate beyond which structural and dynamical properties begin to deviate from equilibrium behavior, while remaining largely unchanged below this threshold. Finally, we demonstrate that the dynamic heterogeneity of the liquid decreases as a function of increasing shear rate, which can be primarily explained by the faster dynamics induced by the shear flow. These results hold relevance for investigations of process-dependent properties of ionic-liquid-based materials."
  },
  {
    "title": "DRL-Based Injection Molding Process Parameter Optimization for Adaptive and Profitable Production",
    "abstract": "Plastic injection molding remains essential to modern manufacturing. However, optimizing process parameters to balance product quality and profitability under dynamic environmental and economic conditions remains a persistent challenge. This study presents a novel deep reinforcement learning (DRL)-based framework for real-time process optimization in injection molding, integrating product quality and profitability into the control objective. A profit function was developed to reflect real-world manufacturing costs, incorporating resin, mold wear, and electricity prices, including time-of-use variations. Surrogate models were constructed to predict product quality and cycle time, enabling efficient offline training of DRL agents using soft actor-critic (SAC) and proximal policy optimization (PPO) algorithms. Experimental results demonstrate that the proposed DRL framework can dynamically adapt to seasonal and operational variations, consistently maintaining product quality while maximizing profit. Compared to traditional optimization methods such as genetic algorithms, the DRL models achieved comparable economic performance with up to 135x faster inference speeds, making them well-suited for real-time applications. The framework's scalability and adaptability highlight its potential as a foundation for intelligent, data-driven decision-making in modern manufacturing environments."
  },
  {
    "title": "Universal scaling of segment fluctuations in polymer and chromatin dynamics",
    "abstract": "We demonstrate how center-of-mass (COM) motion influences polymer segment fluctuations. Cancellation of internal forces, together with spatially uncorrelated external noise, generally yields COM diffusivity scaling as $1/s$ with segment length $s$, regardless of fractal dimension, viscoelasticity, or activity. This introduces distinct dynamic scaling corrections to two-point fluctuations and quenched-induced tangential correlations, validated by theory, simulations, and chromatin imaging data. In the latter, the extracted dynamic exponent reveals topological constraints, thereby resolving the discrepancy between chromatin's crumpled structure and its Rouse-like dynamics."
  },
  {
    "title": "Estimating Deformable-Rigid Contact Interactions for a Deformable Tool via Learning and Model-Based Optimization",
    "abstract": "Dexterous manipulation requires careful reasoning over extrinsic contacts. The prevalence of deforming tools in human environments, the use of deformable sensors, and the increasing number of soft robots yields a need for approaches that enable dexterous manipulation through contact reasoning where not all contacts are well characterized by classical rigid body contact models. Here, we consider the case of a deforming tool dexterously manipulating a rigid object. We propose a hybrid learning and first-principles approach to the modeling of simultaneous motion and force transfer of tools and objects. The learned module is responsible for jointly estimating the rigid object's motion and the deformable tool's imparted contact forces. We then propose a Contact Quadratic Program to recover forces between the environment and object subject to quasi-static equilibrium and Coulomb friction. The results is a system capable of modeling both intrinsic and extrinsic motions, contacts, and forces during dexterous deformable manipulation. We train our method in simulation and show that our method outperforms baselines under varying block geometries and physical properties, during pushing and pivoting manipulations, and demonstrate transfer to real world interactions. Video results can be found at https://deform-rigid-contact.github.io/."
  },
  {
    "title": "Simulating fluid-fluid displacement in a soft capillary tube: How compliance delays interfacial instability and bubble pinch-off",
    "abstract": "The displacement of a more viscous fluid by a less viscous immiscible fluid in confined geometries is a fundamental problem in multiphase flows. Recent experiments have shown that such fluid-fluid displacement in micro-capillary tubes can lead to interfacial instabilities and, eventually, bubble pinch-off. A critical yet often overlooked aspect of this system is the effect of the tube's deformability on the onset of interfacial instability and bubble pinch-off. Here, we present a computational fluid-structure interaction model and an algorithm to simulate this fluid-fluid displacement problem in a soft capillary tube. We use a phase-field model for the fluids and a nonlinear hyperelastic model for the solid. Our fluid-structure interaction formulation uses a boundary-fitted approach and we use isogeometric analysis for the spatial discretization. Using this computational framework, we study the effects of inlet capillary number and tube stiffness on the control of interfacial instabilities in a soft capillary tube for both imbibition and drainage. We find that tube compliance delays or even suppresses interfacial instability and bubble pinch-off, a finding that has important implications for flow in soft porous media, bio-microfluidics, and manufacturing processes."
  },
  {
    "title": "Microscopic description of the liquid-gas coexistence curve for Morse fluids in the immediate vicinity of the critical point",
    "abstract": "The present work is aimed at investigating the behavior of Morse fluids in the immediate vicinity of the critical point within the framework of a cell model. This region is of both fundamental and practical importance, yet presents analytical challenges due to the significant influence of order parameter fluctuations. An analytical procedure is developed to construct the upper part of the liquid-gas coexistence curve and calculate its diameter, incorporating the non-Gaussian (quartic) distribution of fluctuations. An explicit expression is derived for the temperature-dependent analytical term appearing in the expression for the rectilinear diameter. The numerical evaluation of the relevant quantities is carried out using Morse potential parameters representative of sodium. The coexistence curve is constructed both with and without the inclusion of the analytical temperature-dependent term in the calculation. A specific condition is identified under which the agreement between the presented binodal branches and Monte Carlo simulation data from other study, extrapolated to the immediate vicinity of the critical point, is improved. It is shown that better agreement is achieved when the analytical term is included in the calculation of the liquid branch and omitted in the gas branch. The proposed analytical approach may provide useful insight for the theoretical study of critical phenomena in more complex fluid systems."
  },
  {
    "title": "Primordial black holes as dark matter candidates: Multi-frequency constraints from cosmic radiation backgrounds",
    "abstract": "Aims. This study investigates the role of primordial black holes (PBHs) in shaping cosmic radiation backgrounds--the cosmic X-ray background (CXB), the Lyman-Werner background (LWB), and the cosmic radio background (CRB)--and evaluates their viability as dark matter (DM) candidates based on observational constraints and theoretical limits. Methods. PBH accretion is modelled using analytical frameworks that include electron advection-dominated accretion flows (eADAF), standard advection-dominated accretion flows (ADAF), luminous hot accretion flows (LHAF), and thin disks. Emission from PBHs in both dark matter halos and the intergalactic medium (IGM) is computed. We assess the impact of variations in model assumptions, such as halo gas density profiles, gas velocities, and emission models. The results are compared with observational limits and theoretical thresholds to constrain the PBH fraction as DM for masses between 1 and 100 solar masses Results. PBHs may contribute up to 99, 93, 80, and 91 per cent of the unresolved soft X-ray background for masses of 1, 10, 33, and 100 solar masses, respectively, and about 33-39 per cent of the hard X-ray background. These contributions limit the PBH DM fraction to 7e-3, 6e-4, 6e-4, and 7e-4, respectively, in our baseline model. These constraints are consistent with those from the LWB, ensuring molecular cooling and early star formation are preserved. However, explaining the radio background excess and the EDGES signal would require PBH fractions well above these limits. For 1 solar mass, excluding ADAF subregimes relaxes the constraint to 3e-2, highlighting the sensitivity to accretion physics. Variations in model assumptions introduce only minor differences in the predicted backgrounds."
  },
  {
    "title": "Spatially patterned phases in a reaction-time-symmetry-broken model of flocking",
    "abstract": "We introduce a Vicsek-like flocking model with a minimal form of time-delayed orientational interactions, in which the delays occur on a time scale that is well-separated from other time scales in the model. We achieve this by implementing an ``index-ordered'' update rule, mimicking a scenario in which agents have a distribution of times with which they react to information. This model retains the usual disorder-to-order transition common in flocking models, but we show that it also possesses a second transition, deep in the polar flocking phase, to a state with spatially patterned transverse velocities. We characterize this transition and its sensitivity to finite-size effects using the Binder cumulant, and demonstrate -- via direct measurements and by measuring a susceptibility of the phase to particle index permutations -- that the stability of this phase is directly tied to a subtle spatial organization of a slow-relaxing index-order field. These results highlight the potential for even seemingly insignificant temporal asymmetries to fundamentally alter the collective behavior of active matter."
  },
  {
    "title": "Loop closure grasping: Topological transformations enable strong, gentle, and versatile grasps",
    "abstract": "Grasping mechanisms must both create and subsequently hold grasps that permit safe and effective object manipulation. Existing mechanisms address the different functional requirements of grasp creation and grasp holding using a single morphology, but have yet to achieve the simultaneous strength, gentleness, and versatility needed for many applications. We present \"loop closure grasping\", a class of robotic grasping that addresses these different functional requirements through topological transformations between open-loop and closed-loop morphologies. We formalize these morphologies for grasping, formulate the loop closure grasping method, and present principles and a design architecture that we implement using soft growing inflated beams, winches, and clamps. The mechanisms' initial open-loop topology enables versatile grasp creation via unencumbered tip movement, and closing the loop enables strong and gentle holding with effectively infinite bending compliance. Loop closure grasping circumvents the tradeoffs of single-morphology designs, enabling grasps involving historically challenging objects, environments, and configurations."
  },
  {
    "title": "QCD splitting functions beyond kinematical limits",
    "abstract": "We present a systematic decomposition of QCD splitting functions into scalar dipole radiators and pure splitting remainders up to second order in the strong coupling. The individual components contain terms that are formally sub-leading in soft or collinear scaling parameters, but well understood and universal due to their origin in scalar QCD. The multipole radiator functions which we derive share essential features of the known double-soft and one-loop soft gluon currents, and are not based on kinematical approximations."
  },
  {
    "title": "Computer simulations show that liquid-liquid phase separation enhances self-assembly",
    "abstract": "Biomolecular condensates are liquid- or gel-like droplets of proteins and nucleic acids formed at least in part through liquid-liquid phase separation. Condensates enable diverse functions of cells and the pathogens that infect them, including self-assembly reactions. For example, it has been shown that many viruses form condensates within their host cells to compartmentalize capsid assembly and packaging of the viral genome. Yet, the physical principles controlling condensate-mediated self-assembly remain incompletely understood. In this article we use coarse-grained molecular dynamics simulations to study the effect of a condensate on the assembly of icosahedral capsids. The capsid subunits are represented by simple shape-based models to enable simulating a wide range of length and time scales, while the condensate is modeled implicitly to study the effects of phase separation independent of the molecular details of biomolecular condensates. Our results show that condensates can significantly enhance assembly rates, yields, and robustness to parameter variations, consistent with previous theoretical predictions. However, extending beyond those predictions, the computational models also show that excluded volume enables control over the number of capsids that assemble within condensates. Moreover, long-lived aberrant off-pathway assembly intermediates can suppress yields within condensates. In addition to elucidating condensate-mediated assembly of viruses and other biological structures, these results may guide the use of condensates as a generic route to enhance and control self-assembly in human-engineered systems."
  },
  {
    "title": "S241125n: Binary Black Hole Merger Produces Short GRB in AGN Disk",
    "abstract": "Recently, the gravitational wave (GW) event for black hole (BH)-BH mergers, S241125n, has been reported to be associated with a short gamma-ray burst (GRB) and X-ray afterglow emission. Such an association could potentially unveil the environments of mergers and provide attractive targets for multi-messenger observations. We summarize these observations and model it as a binary BH merger occurring within an active galactic nucleus (AGN), where the merger remnant accretes disk material at hyper-Eddington rates. The resulting jet could lead to the GRB associated with the GW event. The GRB, detected by Swift-BAT, exhibits a Comptonized spectrum with an unusually soft photon index, which is consistent with emission from the jet interacting the emission associated with the dense AGN disk environment. Its X-ray afterglow shows an unusually hard spectrum, indicating possible strong absorption by a high column density typical of AGN disks. We highlight the importance of identifying the host galaxy and conducting more sensitive infrared observations to test the model."
  },
  {
    "title": "Invariant-mass threshold resummation for the production of four top quarks at the LHC",
    "abstract": "Using invariant-mass threshold resummation, we compute the invariant-mass distribution and the total cross section for $t\\bar{t}t\\bar{t}$ production at the LHC with centre-of-mass energy of 13.6 TeV at NLL' accuracy. This accuracy includes next-to-leading logarithmic contributions together with relative $\\mathcal{O}(\\alpha_s)$ non-logarithmic terms present in the threshold limit. We match the NLL' results to NLO in QCD and to complete NLO with electroweak corrections. We find that the inclusion of NLL' soft-gluon corrections significantly reduces the size of the theoretical uncertainties and greatly improves the convergence of the predictions when considering various choices of renormalisation and factorisation scales."
  },
  {
    "title": "Tuning the morphology of aerosolised cellulose nanocrystals via controlled aggregation",
    "abstract": "Cellulose nanocrystals (CNCs) are polycrystalline, rod-shaped nanoparticles isolated from cellulose, which have attracted increasing attention for a wide variety of applications. While there has been significant research into CNCs in suspensions, hydrogels and films, there have been remarkably few studies that investigated their properties during and after aerosolisation. Here, we studied how aerosolisation impacts the size and morphology of different CNCs suspensions with different surface functionalities. By building a new experimental setup, we observed that colloidally-metastable aqueous CNC suspensions, achieved by carboxylation of the surface hydroxy groups or by exposure to high intensity ultrasonication, yield large particulates upon aerosolisation under ambient temperatures. In contrast, aqueous suspensions of unfunctionalised CNCs tend to produce, upon aerosolisation, smaller particulates, despite suffering from poor colloidal stability in liquid suspension. Our results demonstrate that both the aerosolisation process itself and the properties of the CNC suspension play a crucial role in determining the final particle size and morphology of CNC-based particles, highlighting the need to consider colloidal stability and surface functionality when designing CNC-based materials for applications involving aerosol delivery or spray drying."
  },
  {
    "title": "Enhancing IoT Cyber Attack Detection in the Presence of Highly Imbalanced Data",
    "abstract": "Due to the rapid growth in the number of Internet of Things (IoT) networks, the cyber risk has increased exponentially, and therefore, we have to develop effective IDS that can work well with highly imbalanced datasets. A high rate of missed threats can be the result, as traditional machine learning models tend to struggle in identifying attacks when normal data volume is much higher than the volume of attacks. For example, the dataset used in this study reveals a strong class imbalance with 94,659 instances of the majority class and only 28 instances of the minority class, making it quite challenging to determine rare attacks accurately. The challenges presented in this research are addressed by hybrid sampling techniques designed to improve data imbalance detection accuracy in IoT domains. After applying these techniques, we evaluate the performance of several machine learning models such as Random Forest, Soft Voting, Support Vector Classifier (SVC), K-Nearest Neighbors (KNN), Multi-Layer Perceptron (MLP), and Logistic Regression with respect to the classification of cyber-attacks. The obtained results indicate that the Random Forest model achieved the best performance with a Kappa score of 0.9903, test accuracy of 0.9961, and AUC of 0.9994. Strong performance is also shown by the Soft Voting model, with an accuracy of 0.9952 and AUC of 0.9997, indicating the benefits of combining model predictions. Overall, this work demonstrates the value of hybrid sampling combined with robust model and feature selection for significantly improving IoT security against cyber-attacks, especially in highly imbalanced data environments."
  },
  {
    "title": "Inferring activity from the flow field around active colloidal particles using deep learning",
    "abstract": "Active colloidal particles create flow around them due to non-equilibrium process on their surfaces. In this paper, we infer the activity of such colloidal particles from the flow field created by them via deep learning. We first explain our method for one active particle, inferring the $2s$ mode (or the stresslet) and the $3t$ mode (or the source dipole) from the flow field data, along with the position and orientation of the particle. We then apply the method to a system of many active particles. We find excellent agreements between the predictions and the true values of activity. Our method presents a principled way to predict arbitrary activity from the flow field created by active particles."
  },
  {
    "title": "Subcellular nano-chemical characterization in photothermal spectroscopic imaging of antimicrobial interaction in model system Bacillus subtilis & vancomycin",
    "abstract": "The power of photothermal spectroscopic imaging to visualize antimicrobial interaction on the surface of individual bacteria cells has been demonstrated on the model system Bacillus subtilis (B. subtilis) and vancomycin using mid-infrared photo-induced force microscopy (PiF-IR, also mid-IR PiFM). High-resolution PiF contrasts obtained by merging subsequent PiF-IR scans at two different illumination frequencies revealed chemical details of cell wall destruction after 30 and 60 min incubation with vancomycin with a spatial resolution of $\\approx 5$ nm. This approach compensates local intensity variations induced by near-field coupling of the illuminating electric field with nanostructured surfaces, which appear in single-frequency contrasts in photothermal imaging methods, as shown by [Anindo et al., J. Phys. Chem C, 2025, 129, 4517]. Spectral shifts associated with hydrogen bond formation between vancomycin and the N-acyl-D-Ala4-D-Ala5 termini in the peptidoglycan cell wall have been observed in chemometrics of PiF-IR spectra from treated and untreated B. subtilis harvested after 30 min from the same experiment. The vancomyin interaction in the piecrust of a progressing septum is located with $\\approx 10$ nm resolution exemplarily using PiF contrasts of three selected bands of a PiF-IR hyperspectral scan of an individual B. subtilis cell harvested after 30 min incubation. Our results provide a new perspective for visualizing the chemical interaction of antibiotics on the surface of microbes with few nanometer resolution."
  },
  {
    "title": "Modeling droplet-particle interactions on solid surfaces by coupling the lattice Boltzmann and discrete element methods",
    "abstract": "We introduce a numerical method for investigating interfacial flows coupled with frictional solid particles. Our method combines the lattice Boltzmann method (LBM) to model the dynamics of a two-component fluid and the discrete element method (DEM) to model contact forces (normal reaction, sliding friction, rolling friction) between solid particles and between solid particles and flat solid surfaces. To couple the fluid and particle dynamics, we (1) use the momentum exchange method to transfer hydrodynamic forces between the fluids and particles, (2) account for different particle wettability using a geometric boundary condition, and (3) explicitly account for capillary forces between particles and liquid-fluid interfaces using a 3D capillary force model. We benchmark the contact forces by investigating the dynamics of a particle bouncing off a solid surface and rolling down an inclined plane. To benchmark the hydrodynamic and capillary forces, we investigate the Segr\\`e-Silberberg effect and measure the force required to detach a particle from a liquid-fluid interface, respectively. Motivated by the self-cleaning properties of the lotus leaf, we apply our method to investigate how drops remove contaminant particles from surfaces and quantify the forces acting on particles during removal. Our method makes it possible to investigate the influence of various parameters that are often difficult to tune independently in experiments, including contact angles, surface tension, viscosity, and coefficient of friction between the surface and particles. Our results highlight that friction plays a crucial role when drops remove particles from surfaces."
  },
  {
    "title": "Accelerated snapping of slender beams under lateral forcing",
    "abstract": "The hysteretic snapping under lateral forcing of a compressed, buckled beam is fundamental for many devices and mechanical metamaterials. For a single-tip lateral pusher, an important limitation is that snapping requires the pusher to cross the centerline of the beam. Here, we show that dual-tip pushers allow accelerated snapping, where the beam snaps before the pusher reaches the centerline. As a consequence, we show that when a buckled beam under increased compression comes in contact with a dual-tip pusher, it can snap to the opposite direction -- this is impossible with a single-tip pusher. Additionally, we reveal a novel two-step snapping regime, in which the beam sequentially loses contact with the two tips of the dual-tip pusher. To characterize this class of snapping instabilities, we employ a systematic modal expansion of the beam shape. This expansion allows us to capture and analyze the transition from one-step to two-step snapping geometrically. Finally we demonstrate how to maximize the distance between the pusher and the beam's centerline at the moment of snapping. Together, our work opens up a new avenue for quantitatively and qualitatively controlling and modifying the snapping of buckled beams, with potential applications in mechanical sensors, actuators, and metamaterials."
  },
  {
    "title": "Enhanced coercive force of nanoparticles of special morphology in the Stoner-Wohlfarth model",
    "abstract": "We have found an unusual effect of increasing the coercive force in the Stoner-Wohlfarth model applied to magnetic nanoparticles of a special morphology. The particles consist of a ferromagnetic single-domain core surrounding by a magnetically soft shell. We have studied thoroughly individual and collective properties of these particles both through numerical calculations and analytical analysis. Fairly accurate approximate analytical formulas have been obtained for determining magnetization, hysteresis loop, coercive force, and other magnetic properties of the particles. The physical reason of the coercivity enhancement effect is the magnetic screening of a particle core by its shell. We have found the unambiguous conditions necessary for the existence of this effect. The large magnetization and moderate magnetic anisotropy of the core favor the effect of the coercivity enhancement."
  },
  {
    "title": "Low-Complexity Decoding for Low-Rate Block Codes of Short Length Based on Concatenated Coding Structure",
    "abstract": "To decode a short linear block code, ordered statics decoding (OSD) and/or the $A^*$ decoding are usually considered. Either OSD or the $A^*$ decoding utilizes the magnitudes of the received symbols to establish the most reliable and independent positions (MRIP) frame. A restricted searched space can be employed to achieve near-optimum decoding with reduced decoding complexity. For a low-rate code with large minimum distance, the restricted search space is still very huge. We propose to use concatenated coding to further restrict the search space by proposing an improved MRIP frame. The improved MRIP frame is founded according to magnitudes of log likelihood ratios (LLRs) obtained by the soft-in soft-out (SISO) decoder for the inner code. We focus on the construction and decoding of several $(n,k)$ = (128,36) binary linear block codes based on concatenated coding. We use the (128,36) extended BCH (eBCH) code as a benchmark for comparison. Simulation shows that there exist constructed concatenated codes which are much more efficient than the (128,36) eBCH code. Some other codes of length 128 or close to 128 are also constructed to demonstrate the efficiency of the proposed scheme."
  },
  {
    "title": "Quantization Rules in Holographic QCD Models",
    "abstract": "In this paper, we investigate quasinormal modes in holographic QCD models from the perspective of the WKB approximation. We derive the generalized Bohr Sommerfeld quantization rules for quasi-stationary states in holographic QCD models. As a simple application of these formulas, we compute the quasinormal modes of scalar and vector fields in the soft wall model, where an analytic expression for the real part of the frequency can be found in the low temperature regime. Additionally, this study provides useful insights into the dissociation process in holographic QCD models."
  },
  {
    "title": "Charge density waves and soft phonon evolution in the superconductor BaNi$_2$(As$_{1-x}$P$_x$)$_2$",
    "abstract": "The superconductor BaNi$_2$As$_2$ exhibits a soft-phonon-driven, incommensurate charge density wave (I-CDW) which is accompanied by a small orthorhombic structural phase transition. Upon further cooling, BaNi$_2$As$_2$ undergoes a first-order structural transition to a triclinic phase in which a commensurate CDW (C-CDW) appears. The relationship and interplay between the I-CDW, C-CDW and structural phase transitions has remained elusive. To investigate this issue, we present a complementary study of thermal diffuse X-Ray scattering and inelastic X-Ray scattering for phosphorus substituted BaNi$_2$(As$_{1-x}$P$_x$)$_2$ $(x\\lessapprox0.12)$ and down to 2.2 K. We show that most of the diffuse scattering signal can be well described by first-principles lattice dynamics calculations. Furthermore, we find that although phosphorus substitution rapidly suppresses the structural transition temperatures, the temperature dependence of the correlation length of the I-CDW fluctuations and the formation of Bragg-like superstructure peaks associated with long-range ordering of this order depends only weakly on the substitution level. Finally, we present the absence of signatures of the I-CDW to C-CDW or triclinic transition in the lattice dynamics, indicating that these instabilities are not (soft) phonon driven."
  },
  {
    "title": "Brownian Dynamics Simulations of Inclusions in an Active Fluid Bath",
    "abstract": "We carry out two-dimensional Brownian dynamics simulations of the behavior of rigid inclusion particles immersed in an active fluid bath. The active fluid is modeled as a collection of self-propelled circular disks interacting via a soft repulsive potential and a nematic alignment interaction. The fluid is characterized by its nematic order, polar order and orientational correlation length. The active fluid bath transitions from the isotropic to the nematic phase with increasing number density, increasing nematic interaction strength or increasing P\\'eclet number. The inclusion particles are modeled as rigid assemblies of passive circular disks. Four types of inclusions are considered: a rod-like $I$ shape, a boomerang-like $L$ shape, and stair-like shapes $Z$ and $Z^*$, with opposite handedness. When inclusions are introduced into the active fluid bath, their diffusion is significantly enhanced by the force and torque exerted by the active fluid particles and the chiral inclusion particles exhibit constant rotational drift. These diffusion and rotation enhancements increase as the swimming speed of the active fluid particles increases. The translational motion of the inclusion particles also couples with their orientational motion, and the correlation is modulated by the active fluid particles' swimming speed. This work paves the way for future simulations of inclusions in active fluid baths and suggests potential avenues for controlling transport properties in active materials."
  },
  {
    "title": "Role of structural biaxiality on the phase behaviour of chiral liquid crystals",
    "abstract": "We report a computer simulation study on the effect of molecular structural biaxiality in the phase formation of chiral molecules. In this study, we have done coarse-grained modeling to observe self-assembled phase behavior. In our molecular dynamics simulation study we varied both the chiral interaction strength and molecular biaxiality. Uniaxial molecules give rise to cholesteric phase, blue phase whereas molecular biaxiality favours cholesteric phase. At higher chirality, small chiral domains are formed creating twisted cylindrical networks with each cylinder having elliptical cross-sections instead of circular nature as found in uniaxial systems. The value of cholesteric pitch decreases when chirality and molecular biaxiality becomes higher. Coaction of biaxiality and chirality is crucial for fabricating liquid crystal materials with optical properties suitable for displays, sensors and chiral photonic devices."
  },
  {
    "title": "Radiation and Magnetic Pressure Support in Accretion Disks around Supermassive Black Holes and The Physical Origin of the Extreme Ultraviolet to Soft X-ray Spectrum",
    "abstract": "We present the results of four three-dimensional radiation magnetohydrodynamic simulations of accretion disks around a $10^8$ solar mass black hole, which produce the far ultraviolet spectrum peak and demonstrate a robust physical mechanism to produce the extreme ultraviolet to soft X-ray power-law continuum component. The disks are fed from rotating tori and reach accretion rates ranging from $0.03$ to $4$ times the Eddington value. The disks become radiation pressure or magnetic pressure dominated depending on the relative timescales of radiative cooling and gas inflow. Magnetic pressure supported disks can form with or without net poloidal magnetic fields as long as the inflowing gas can cool quickly enough, which can typically happen when the accretion rate is low. We calculate the emerging spectra from these disks using multi-group radiation transport with realistic opacities and find that they typically peak around $10$ eV. At accretion rates close to or above the Eddington limit, a power-law component can appear for photon energies between $10$ eV and 1 keV with a spectral slope varying between $L_\\nu\\propto\\nu^{-1}$ and $\\nu^{-2}$, comparable to what is observed in radio quiet quasars. The disk with $3\\%$ Eddington accretion rate does not exhibit this component. These high energy photons are produced in an optically thick region $\\approx 30^{\\circ}-45^{\\circ}$ from the disk midplane by compressible bulk Comptonization within the converging accretion flow. Strongly magnetized disks that have a very small surface density will produce a spectrum that is very different from what is observed."
  },
  {
    "title": "Learned Free-Energy Functionals from Pair-Correlation Matching for Dynamical Density Functional Theory",
    "abstract": "Classical density functional theory (cDFT) and dynamical density functional theory (DDFT) are modern statistical mechanical theories for modelling many-body colloidal systems at the one-body density level. The theories hinge on knowing the excess free-energy accurately, which is however not feasible for most practical applications. Dijkman et al. [Phys. Rev. Lett. 134, 056103 (2025)] recently showed how a neural excess free-energy functional for cDFT can be learned from inexpensive bulk simulations via pair-correlation matching. In this Letter, we demonstrate how this same functional can be applied to DDFT, without any retraining, to simulate non-equilibrium overdamped dynamics of inhomogeneous densities. We evaluate this on a 3D Lennard-Jones system with planar geometry under various complex external potentials and observe good agreement of the dynamical densities with those from expensive Brownian dynamic simulations, up to the limit of the adiabatic approximation. We further develop and apply an extension of DDFT to a grand-canonical system modeled after breakthrough gas adsorption studies, finding similarly good agreement. Our results demonstrate a practical route for leveraging learned free-energy functionals in DDFT, paving the way for accurate and efficient modeling of non-equilibrium systems."
  },
  {
    "title": "Atomic Confinement Potentials",
    "abstract": "Motivated by the development of reusable software for computational chemistry [Lehtola, J. Chem. Phys. 159, 180901 (2023)], we aim to establish novel open source infrastructure for calculations with numerical atomic orbital (NAO) basis sets. Soft confinement potentials are typically used in this context to force the NAO radial basis functions {\\psi}nl (r) to vanish smoothly in increasing r and to generate localized unoccupied states; we review such potentials in this work as a follow-up to our recent study on hard-wall confinement [{\\AA}str\\\"om and Lehtola, J. Phys. Chem. A 129, 2791 (2025)]. We also note that in addition to their use in NAO generation, confinement potentials are also employed to simulate environmental effects in other research areas, such as studies of (i) atoms in solids, (ii) quantum dots, and (iii) high-pressure chemistry. As in our earlier work, we perform fully numerical density functional theory (DFT) calculations with the Perdew-Burke-Ernzerhof (PBE) exchange-correlation functional, and employ spherically averaged, spin-restricted densities, as is usual in NAO studies. Our calculations employ the HelFEM program, which implements the finite element method (FEM), yielding variational energies and enabling the use of various boundary conditions. We consider four families of potentials to study the Mg and Ca atoms, which are textbook examples of extended electronic structures. We show that the resulting ground-state orbitals are surprisingly insensitive to the employed form of the confinement potential, and that the orbitals decay quickly under confinement. We study increasingly steep potentials and point out how they approach the hard-wall limit in a systematic and smooth manner. Finally, we assess NAO basis set truncation errors arising from various parameter choices for the singular potentials that are now broadly used in the NAO literature."
  },
  {
    "title": "Transients and multiperiodic responses: a hierarchy of material bits",
    "abstract": "When cyclically driven, certain disordered materials exhibit transient and multiperiodic responses that are difficult to reproduce in synthetic materials. Here, we show that elementary multiperiodic elements with period T=2, togglerons, can serve as building blocks for such responses. We experimentally realize metamaterials composed of togglerons with tunable transients and periodic responses - including odd periods. Our approach suggests a hierarchy of increasingly complex elements in frustrated media, and opens a new strategy for rational design of sequential metamaterials."
  },
  {
    "title": "Shadow Celestial Operator Product Expansions",
    "abstract": "The linearized massless wave equation in four-dimensional asymptotically flat spacetimes is known to admit two families of solutions that transform in highest-weight representations of the Lorentz group ${\\rm SL}(2, \\mathbb{C})$. The two families are related to each other by a two-dimensional shadow transformation. The scattering states of one family are constructed from standard momentum eigenstates by a Mellin transformation with respect to energy. Their operator product expansion (OPE) is directly related to collinear limits of momentum space amplitudes. The scattering states of the other family are a priori non-local on the celestial sphere and lack a standard notion of OPE. Such states appear naturally in the context of asymptotic symmetries, but their properties as operators remain largely unexplored. Here we initiate a study, to be continued in a forthcoming companion paper, of a definition of an OPE for shadow operators. We present a useful technical ingredient: the transformation of the OPE coefficients associated to collinear limits under a shadow. Our results can be used to find the coefficients of all three-point functions involving any combination of celestial and shadow primaries. An OPE block is used to account for the contribution from a primary together with its global conformal descendants, all of which contribute when deriving the shadowed OPE coefficients. Applications involving $U(1)$ currents and stress tensors as well as a chiral current algebra of soft gluons are discussed."
  },
  {
    "title": "Glassy dynamics and a growing structural length scale in supercooled nanoparticles",
    "abstract": "We use molecular dynamics simulation to study the relationship between structure and dynamics in supercooled binary Lennard--Jones nanoparticles over a range of particle sizes. The glass transition temperature of the nanoparticles is found to be significantly lowered relative to the bulk, decreasing as $N^{-1/3}$ with decreasing particle size. This allows the nanoparticles to sample low energy states on the potential energy landscape and we are able to study their relaxation times, measured in terms of the intermediate scattering function, and their structure, measured in terms of locally favoured structures, to low temperatures. Our work shows that the growing relaxation times in the supercooled nanoparticles are coupled with the growth of physical clusters formed from favoured local structures in a way that is well described by the Random First Order Transition entropic droplet model, but with exponents that are dependent on the nanoparticle size."
  },
  {
    "title": "Nonmonotonic diffusion in sheared active suspensions of squirmers",
    "abstract": "We investigate how shear influences the dynamics of active particles in dilute to concentrated suspensions. Specifically, we focus on apolar active suspensions of squirmers, which are individually immotile but display activity-induced hydrodynamic diffusion. Under shear, the instantaneous particle velocities fluctuate more rapidly, similar to passive suspensions; however, surprisingly, the long-time diffusive dynamics can slow down and exhibit a nonmonotonic dependence on the shear rate. We show that this behavior arises from an interplay between the activity-induced persistent motion and shear-induced negative velocity autocorrelation, both of which are more pronounced at lower volume fractions. Simulations of self-propelled particles with tunable persistence support this explanation and further offer a simple mechanism to understand the observed coupling. Our results reveal a generic effect of shear on diffusion in active suspensions, elucidate how internal and external forcing interact, and provide new possibilities to modulate transport in active fluids."
  },
  {
    "title": "The Voice Timbre Attribute Detection 2025 Challenge Evaluation Plan",
    "abstract": "Voice timbre refers to the unique quality or character of a person's voice that distinguishes it from others as perceived by human hearing. The Voice Timbre Attribute Detection (VtaD) 2025 challenge focuses on explaining the voice timbre attribute in a comparative manner. In this challenge, the human impression of voice timbre is verbalized with a set of sensory descriptors, including bright, coarse, soft, magnetic, and so on. The timbre is explained from the comparison between two voices in their intensity within a specific descriptor dimension. The VtaD 2025 challenge starts in May and culminates in a special proposal at the NCMMSC2025 conference in October 2025 in Zhenjiang, China."
  },
  {
    "title": "Flavour Non-Singlet Splitting Functions at Four Loops in QCD -- The Fermionic Contributions",
    "abstract": "We have determined the fourth-order $n_f$ contributions to the two splitting functions governing the evolution of all flavor differences of quark distributions of hadrons in perturbative quantum chromodynamics with $n_f$ light flavors. The analytic forms of these functions are presented in both Mellin $N$-space and momentum-fraction $x$-space for a general gauge group. In the small-$x$ limit double logarithms occur, but the small-$x$ rise of both splitting functions is confined to extremely small $x$-values, $x \\lesssim 10^{-6}$. The large-$x$ limit includes the $n_f$-part of the four-loop quark virtual anomalous dimension. Using this result we obtain also the $n_f$ contributions to the corresponding gluonic quantity and the complete threshold-enhanced logarithms from soft-gluon emission for a large class of inclusive observables, including Higgs boson production in gluon-gluon fusion."
  },
  {
    "title": "Predicting butterfly species presence from satellite imagery using soft contrastive regularisation",
    "abstract": "The growing demand for scalable biodiversity monitoring methods has fuelled interest in remote sensing data, due to its widespread availability and extensive coverage. Traditionally, the application of remote sensing to biodiversity research has focused on mapping and monitoring habitats, but with increasing availability of large-scale citizen-science wildlife observation data, recent methods have started to explore predicting multi-species presence directly from satellite images. This paper presents a new data set for predicting butterfly species presence from satellite data in the United Kingdom. We experimentally optimise a Resnet-based model to predict multi-species presence from 4-band satellite images, and find that this model especially outperforms the mean rate baseline for locations with high species biodiversity. To improve performance, we develop a soft, supervised contrastive regularisation loss that is tailored to probabilistic labels (such as species-presence data), and demonstrate that this improves prediction accuracy. In summary, our new data set and contrastive regularisation method contribute to the open challenge of accurately predicting species biodiversity from remote sensing data, which is key for efficient biodiversity monitoring."
  },
  {
    "title": "MetaUAS: Universal Anomaly Segmentation with One-Prompt Meta-Learning",
    "abstract": "Zero- and few-shot visual anomaly segmentation relies on powerful vision-language models that detect unseen anomalies using manually designed textual prompts. However, visual representations are inherently independent of language. In this paper, we explore the potential of a pure visual foundation model as an alternative to widely used vision-language models for universal visual anomaly segmentation. We present a novel paradigm that unifies anomaly segmentation into change segmentation. This paradigm enables us to leverage large-scale synthetic image pairs, featuring object-level and local region changes, derived from existing image datasets, which are independent of target anomaly datasets. We propose a one-prompt Meta-learning framework for Universal Anomaly Segmentation (MetaUAS) that is trained on this synthetic dataset and then generalizes well to segment any novel or unseen visual anomalies in the real world. To handle geometrical variations between prompt and query images, we propose a soft feature alignment module that bridges paired-image change perception and single-image semantic segmentation. This is the first work to achieve universal anomaly segmentation using a pure vision model without relying on special anomaly detection datasets and pre-trained visual-language models. Our method effectively and efficiently segments any anomalies with only one normal image prompt and enjoys training-free without guidance from language. Our MetaUAS significantly outperforms previous zero-shot, few-shot, and even full-shot anomaly segmentation methods. The code and pre-trained models are available at https://github.com/gaobb/MetaUAS."
  },
  {
    "title": "The high-energy protons of the ground level enhancement (GLE74) event on 11 May 2024",
    "abstract": "High energy solar protons were observed by particle detectors aboard spacecraft in near-Earth orbit on May 11, 2024 and produced the 74th ground level enhancement (GLE74) event registered by ground-based neutron monitors. This study involves a detailed reconstruction of the neutron monitor response, along with the identification of the solar eruption responsible for the emission of the primary particles, utilizing both in situ and remote-sensing. Observations spanning proton energies from a few MeV to around 1.64 GeV, collected from the Solar and Heliospheric Observatory (SOHO), the Geostationary Operational Environmental Satellite (GOES), the Solar Terrestrial Relations Observatory (STEREO-A), and neutron monitors, were integrated with records of the associated solar soft X-ray flare, coronal mass ejection, and radio bursts, to identify the solar origin of the GLE74. Additionally, a time-shift analysis was conducted to link the detected particles to their solar sources. Finally, a comparison of GLE74 to previous ones is carried out. GLE74 reached a maximum particle rigidity of at least 2.4 GV and was associated with a series of type III, type II, and type IV radio bursts. The release time of the primary solar energetic particles (SEPs) with an energy of 500 MeV was estimated to be around 01:21 UT. A significant SEP flux was observed from the anti-Sun direction with a relatively broad angular distribution, rather than a narrow, beam-like pattern, particularly during the main phase at the particle peak flux. Comparisons with previous GLEs suggest that GLE74 was a typical event in terms of solar eruption dynamics."
  },
  {
    "title": "Optimization via First-Order Switching Methods: Skew-Symmetric Dynamics and Optimistic Discretization",
    "abstract": "Large-scale constrained optimization problems are at the core of many tasks in control, signal processing, and machine learning. Notably, problems with functional constraints arise when, beyond a performance{\\nobreakdash-}centric goal (e.g., minimizing the empirical loss), one desires to satisfy other requirements such as robustness, fairness, etc. A simple method for such problems, which remarkably achieves optimal rates for non-smooth, convex, strongly convex, and weakly convex functions under first-order oracle, is Switching Gradient Method (SGM): in each iteration depending on a predetermined constraint violation tolerance, use the gradient of objective or the constraint as the update vector. While the performance of SGM is well-understood for non-smooth functions and in fact matches its unconstrained counterpart, i.e., Gradient Descent (GD), less is formally established about its convergence properties under the smoothness of loss and constraint functions. In this work, we aim to fill this gap. First, we show that SGM may not benefit from faster rates under smoothness, in contrast to improved rates for GD under smoothness. By taking a continuous-time limit perspective, we show the issue is fundamental to SGM's dynamics and not an artifact of our analysis. Our continuous-time limit perspective further provides insights towards alleviating SGM's shortcomings. Notably, we show that leveraging the idea of optimism, a well-explored concept in variational inequalities and min-max optimization, could lead to faster methods. This perspective further enables designing a new class of ``soft'' switching methods, for which we further analyze their iteration complexity under mild assumptions."
  },
  {
    "title": "Imitation Learning for Adaptive Control of a Virtual Soft Exoglove",
    "abstract": "The use of wearable robots has been widely adopted in rehabilitation training for patients with hand motor impairments. However, the uniqueness of patients' muscle loss is often overlooked. Leveraging reinforcement learning and a biologically accurate musculoskeletal model in simulation, we propose a customized wearable robotic controller that is able to address specific muscle deficits and to provide compensation for hand-object manipulation tasks. Video data of a same subject performing human grasping tasks is used to train a manipulation model through learning from demonstration. This manipulation model is subsequently fine-tuned to perform object-specific interaction tasks. The muscle forces in the musculoskeletal manipulation model are then weakened to simulate neurological motor impairments, which are later compensated by the actuation of a virtual wearable robotics glove. Results shows that integrating the virtual wearable robotic glove provides shared assistance to support the hand manipulator with weakened muscle forces. The learned exoglove controller achieved an average of 90.5\\% of the original manipulation proficiency."
  },
  {
    "title": "Investigation of possible precursors of solar flares in the active region 12230 On December 9, 2014",
    "abstract": "The question of the nature of precursors of solar flares, as well as their relationship with subsequent flares, still has no unambiguous answer. This is due, in particular, to the lack of systematic statistical work, the relative incompleteness (in isolation from the context of the development of the entire active region) of studies of individual events and the ambiguity of the term 'precursor' itself. In this paper, we consider the dynamics of the NOAA 12230 active region (AR), in which a series of homologous flares (C5-C9) occurred on December 9, 2014 within 12 hours, with an average frequency of about 2 hours. This AR was characterized by a rapid increase in flare activity followed by a rapid decay, which can be considered as a good example for studying potential precursors of flare series. We investigated the evolution of AR 12230 over a relatively long period (several days) and its transition from the 'no-flare' state to the flare-active regime. For this purpose, we study the magnetic field dynamics using SDO/HMI vector magnetograms, UV-EUV images based on SDO/AIA data, and X-ray observations from GOES/XRS and RHESSI data. We conclude that the significant increase in the chromospheric radiation variations against the background of a small flux of soft X-ray and UV emission from the corona observed on December 8, 2014, together with the magnetic flux emergence, can be considered as a precursor to a series of flares. The results show the importance and prospects of applying new methods of synoptic observations of the Sun in the context of collecting statistics (\"history\") of the AR energy release in different ranges of the electromagnetic spectrum."
  },
  {
    "title": "Deep reinforcement learning-based longitudinal control strategy for automated vehicles at signalised intersections",
    "abstract": "Developing an autonomous vehicle control strategy for signalised intersections (SI) is one of the challenging tasks due to its inherently complex decision-making process. This study proposes a Deep Reinforcement Learning (DRL) based longitudinal vehicle control strategy at SI. A comprehensive reward function has been formulated with a particular focus on (i) distance headway-based efficiency reward, (ii) decision-making criteria during amber light, and (iii) asymmetric acceleration/ deceleration response, along with the traditional safety and comfort criteria. This reward function has been incorporated with two popular DRL algorithms, Deep Deterministic Policy Gradient (DDPG) and Soft-Actor Critic (SAC), which can handle the continuous action space of acceleration/deceleration. The proposed models have been trained on the combination of real-world leader vehicle (LV) trajectories and simulated trajectories generated using the Ornstein-Uhlenbeck (OU) process. The overall performance of the proposed models has been tested using Cumulative Distribution Function (CDF) plots and compared with the real-world trajectory data. The results show that the RL models successfully maintain lower distance headway (i.e., higher efficiency) and jerk compared to human-driven vehicles without compromising safety. Further, to assess the robustness of the proposed models, we evaluated the model performance on diverse safety-critical scenarios, in terms of car-following and traffic signal compliance. Both DDPG and SAC models successfully handled the critical scenarios, while the DDPG model showed smoother action profiles compared to the SAC model. Overall, the results confirm that DRL-based longitudinal vehicle control strategy at SI can help to improve traffic safety, efficiency, and comfort."
  },
  {
    "title": "XMM-Newton Conclusively Identifies an Active Galactic Nucleus in a Green Pea Galaxy",
    "abstract": "Green Pea galaxies are a class of compact, low-mass, low-metallicity star-forming galaxies in the relatively local universe. They are believed to be analogues of high-redshift galaxies that re-ionised the universe and, indeed, the James Webb Space Telescope (JWST) is now uncovering such populations at record redshifts. Intriguingly, JWST finds evidence suggestive of active galactic nuclei (AGN) in many of these distant galaxies, including the elusive Little Red Dots, that broadly lack any detectable X-ray counterparts. Intuitively, one would expect to detect an AGN in their low-redshift analogues with X-rays, yet no study to date has conclusively identified an X-ray AGN within a Green Pea galaxy. Here we present the deepest X-ray campaign of a Green Pea galaxy performed to date, obtained with the goal of discerning the presence of a (potentially low-luminosity) AGN. The target $-$ SDSS J082247.66 +224144.0 (J0822+2241 hereafter) $-$ was previously found to display a comparable X-ray spectral shape to more local AGN ($\\Gamma$ $\\sim$ 2) and a high luminosity ($L_{2-10\\,{\\rm keV}}$ $\\sim$ 10$^{42}$ erg s$^{-1}$). We show that over 6.2 years (rest-frame), the 2$-$10 keV luminosity of J0822+2241 is constant, whereas the soft 0.5$-$2 keV flux has decreased significantly by $\\sim$60%. We discuss possible scenarios to explain the X-ray properties of J0822+2241, finding transient low-column density obscuration surrounding an AGN to be the only plausible scenario. J0822+2241 thus provides further evidence that low-luminosity AGN activity could have contributed to the epoch of reionisation, and that local analogues are useful to derive a complete multi-wavelength picture of black hole growth in high redshift low luminosity AGN."
  },
  {
    "title": "High-throughput Screening of the Mechanical Properties of Peptide Assemblies",
    "abstract": "Peptides are recognized for their varied self-assembly behaviors, forming a wide array of structures and geometries, such as spheres, fibers, and hydrogels, each presenting a unique set of material properties. The functionalities of these materials hold exceptional interest for applications in biology, medicine, photonics, nanotechnology and the food industry. In specific, the ability to exploit peptides as viable and sustainable mechanical materials requires sequence design that enables superior performance, notably a high Young's modulus. As the peptide sequence space is vast, however, even a slight increase in sequence length leads to an exponential increase in the number of potential peptide sequences to be characterized. Here, we combine coarse-grained molecular dynamics simulations, atomic force microscopy experiments and machine learning models to correlate the sequence length and composition with the mechanical properties of self-assembled peptides. We calculate the Young's modulus for all possible amino acid sequences of di- and tripeptides using high-throughput coarse-grained methods, and validate these calculations through in-situ mechanical characterization. For pentapeptides, we select and calculate properties for a subset of sequences to train a machine learning model, which allows us to predict the modulus for other sequences. The combined workflow not only identifies promising peptide candidates with exceptional mechanical performances, but also extends current understanding of the sequence-to-function relationships for peptide materials, for specific applications."
  },
  {
    "title": "Time as a test-field: the no-boundary universe in motion and a smooth radiation bounce",
    "abstract": "We review two arguments for using the Schr\\\"odinger equation in quantum cosmology and propose restricting to solutions in which time acts as a component with negligible backreaction on the metric - that is, it plays the role of a test field. We apply this idea to various minisuperspace models. In the semiclassical regime we recover expected results: the wavefunction peaks on the classical solution and, in models with a scalar field, the variance of $\\zeta$ (a mini-superspace analogue of the comoving curvature perturbation) is conserved in time. Applied to the no-boundary wavefunction, our model highlights a bouncing behavior, which gives a straightforward quantum representation of global de Sitter space. We argue that the inevitable time dependence of the variance of the wavefunction breaks some of the classical de Sitter symmetries. Then, by modeling radiation as a fluid, we analyze the epoch of radiation domination near the singularity. The problem is equivalent to an $s$-wave scattering off a central power-law potential of the form $-r^{-2/3}$. Such a potential admits bound states, so the system is stable and the wavepacket undergoes unitary scattering. The radiation bounce, as opposed to the no-boundary bounce, does not have a classical counterpart as the corresponding classical solutions are singular. During the radiation bounce, the uncertainty and the expectation value of the scale factor become comparable. By selecting a large initial variance, the bounce can be made arbitrarily smooth, the mean value of the Hubble parameter correspondingly soft."
  },
  {
    "title": "Bubble formation in active binary mixture model",
    "abstract": "Phase separation, the spontaneous segregation of density, is a ubiquitous phenomenon observed across diverse physical and biological systems. Within a crowd of self-propelled elements, active phase separation emerges from the interplay of activity and density interactions. A striking feature of active phase separation is the persistent formation of dilute-phase bubbles within the dense phase, which has been explored in theoretical models. However, the fundamental parameters that systematically control bubble formation remain unclear in conventional active particle models. Here, we introduce an active binary mixture model, where active solutes and solvents dynamically exchange their positions, and find that spontaneous bubble formation can be tuned by the asymmetry in their activities. Numerical simulations reveal that moderate solvent activity enhances bubble formation, while larger solvent activity, comparable to solute activity, suppresses it. By employing mean-field theory, which captures essential phase behaviors, we consider the mechanism for the enhancement of bubble formation induced by solvent activity. Beyond these findings, when solute and solvent activities are equal, numerical simulations indicate that critical phenomena of active phase separation under the suppression of bubbles belong to the Ising universality class. Our findings establish activity asymmetry as a key control parameter for active matter phase transitions, offering new insights into universality in nonequilibrium systems."
  }
]