[
  {
    "title": "Improving Assembly Code Performance with Large Language Models via Reinforcement Learning",
    "abstract": "Large language models (LLMs) have demonstrated strong performance across a wide range of programming tasks, yet their potential for code optimization remains underexplored. This work investigates whether LLMs can optimize the performance of assembly code, where fine-grained control over execution enables improvements that are difficult to express in high-level languages. We present a reinforcement learning framework that trains LLMs using Proximal Policy Optimization (PPO), guided by a reward function that considers both functional correctness, validated through test cases, and execution performance relative to the industry-standard compiler gcc -O3. To support this study, we introduce a benchmark of 8,072 real-world programs. Our model, Qwen2.5-Coder-7B-PPO, achieves 96.0% test pass rates and an average speedup of 1.47x over the gcc -O3 baseline, outperforming all 20 other models evaluated, including Claude-3.7-sonnet. These results indicate that reinforcement learning can unlock the potential of LLMs to serve as effective optimizers for assembly code performance."
  },
  {
    "title": "Coherent Spectroscopic Probes of Topology: A Velocity-Gauge Perspective",
    "abstract": "We present a velocity-gauge formalism for computing nonlinear current response functions in periodic systems and apply it to the Su-Schrieffer-Heeger (SSH) model as a minimal topological testbed. By retaining the full minimal coupling Hamiltonian and avoiding the rotating wave approximation, we construct gauge-consistent expressions for the linear and third-order current susceptibilities using retarded Green's functions. Our results reveal how nonlinear optical spectra encode not only energy-level transitions but also interband phase coherence and topological winding. In the topological phase, the third-order response exhibits characteristic phase inversions and spectral asymmetries that are absent in the trivial phase. These features reflect geometric changes in the Bloch eigenstates and highlight the role of virtual pathways in shaping the nonlinear signal. Our framework offers a robust and extensible platform for modeling nonlinear light-matter interactions in topological materials beyond the dipole approximation and the standard Coulomb-gauge formulation in molecular spectroscopy."
  },
  {
    "title": "Theory of Quasi-Statically Screened Electron-Polar Optical Phonon Scattering",
    "abstract": "The scattering of electrons with polar optical phonons (POP) is an important mechanism that limits electronic transport and determines electron mobility in polar materials. This is typically a stronger mechanism compared to non-polar acoustic and optical phonon scattering, and of similar strength to the Coulomb ionized impurity scattering. At high densities, on the other hand, the cloud of charge carriers screens the dipoles that are responsible for POP scattering, and weakens the electron-POP scattering strength. However, in contrast to ionized impurity scattering, for which the well-known Brooks-Herring equation provides the scattering rates with the effect of screening included, for scattering with POP there is no such closed-form mathematical expression. In this work, we derive such an expression based on Fermi's Golden Rule, which would prove particularly useful in understanding electronic transport in complex crystal and complex band structure materials, in which electron-POP scattering could dominate electronic transport."
  },
  {
    "title": "Understanding and Characterizing Obfuscated Funds Transfers in Ethereum Smart Contracts",
    "abstract": "Scam contracts on Ethereum have rapidly evolved alongside the rise of DeFi and NFT ecosystems, utilizing increasingly complex code obfuscation techniques to avoid early detection. This paper systematically investigates how obfuscation amplifies the financial risks of fraudulent contracts and undermines existing auditing tools. We propose a transfer-centric obfuscation taxonomy, distilling seven key features, and introduce ObfProbe, a framework that performs bytecode-level smart contract analysis to uncover obfuscation techniques and quantify obfuscation complexity via Z-score ranking. In a large-scale study of 1.03 million Ethereum contracts, we isolate over 3 000 highly obfuscated contracts and identify two scam archetypes, three high-risk contract categories, and MEV bots that employ a variety of obfuscation maneuvers such as inline assembly, dead code insertion, and deep function splitting. We further show that obfuscation substantially increases both the scale of financial damage and the time until detection. Finally, we evaluate SourceP, a state-of-the-art Ponzi detection tool, on obfuscated versus non-obfuscated samples and observe its accuracy drop from approximately 80 percent to approximately 12 percent in real-world scenarios. These findings highlight the urgent need for enhanced anti-obfuscation analysis techniques and broader community collaboration to stem the proliferation of scam contracts in the expanding DeFi ecosystem."
  },
  {
    "title": "Resistivity of non-Galilean invariant two dimensional Dirac system",
    "abstract": "We revisited the influence of electron-electron scattering on the resistivity of a two-dimensional system with linear spectrum. In conventional systems with parabolic spectrum, where Umklapp scattering is either prohibited or ineffective due to small Fermi surface, particle-particle scattering does not contribute to conductivity because it does not change the total momentum. However, within the framework of Boltzmann kinetic model, we demonstrate that electron-electron scattering in Dirac systems can significantly contribute to conductivity, producing distinct temperature-dependent corrections: a T\\textsuperscript{4} behavior at low temperatures and T\\textsuperscript{2} dependence at moderate temperatures. While the predicted T\\textsuperscript{4} scaling is not observed experimentally -- likely suppressed by dominant weak localization effects -- the T\\textsuperscript{2} scaling is clearly confirmed in our measurements. Specifically, temperature-dependent resistivity data from gapless single-valley HgTe quantum well exhibit T\\textsuperscript{2} corrections, which align well with theoretical predictions. Thus, we challenge the paradigm that T\\textsuperscript{2} term in resistivity is absent in single-band 2D metals."
  },
  {
    "title": "Nitrogen-vacancy centre in lonsdaleite: a novel nanoscale sensor?",
    "abstract": "Hexagonal diamond, often called lonsdaleite, is an exotic allotrope of carbon, predicted to be harder than cubic (conventional) diamond with a wider bandgap. Due to its pure sp$^3$ bonded lattice, it should be expected to host sub-bandgap defect centres (colour centres). Here we perform \\textit{ab initio} modeling of nitrogen-vacancy (NV) colour centres in hexagonal diamond nanocrystals; for both the neutral and negatively charged species (NV$^0$ and NV$^-$). We identify three distinct configurations for the NV center: two of which are analogous to NV in diamond, and one which is a configuration that can only exist in the hexagonal form. The diamond-like NV systems comprise three symmetry equivalent centers which reside on the same carbon plane, and one defect that is split across two planes and replaces a carbon-carbon bond. There is an additional NV centre where the N and V each have four nearest neighbour carbon atoms. The presence of this latter configuration would provide an unambiguous determination of the hexagonal nature of lonsdaleite. Quantum chemical analysis show all derivatives to be thermochemically stable, and each with their own unique photophysical properties, spectral profiles, and magneto-optical characteristics. By assuming that the ground state properties of the NV$^-$ in hexagonal diamond are comparable to those of NV$^-$ in cubic diamond, albeit with increased strain, we predict ground state fine structure splitting for two of the centres of 2.74~GHz and 4.56~MHz, compared with 2.87~GHz for cubic diamond. The possibility of optically detected magnetic resonance with NV$^-$ in lonsdaleite would provide a new carbon-based quantum sensing system, and an unambiguous method to resolve outstanding issues around the structure of lonsdaleite as hexagonal diamond."
  },
  {
    "title": "ForgetMeNot: Understanding and Modeling the Impact of Forever Chemicals Toward Sustainable Large-Scale Computing",
    "abstract": "Fluorinated compounds, often referred to as forever chemicals, are critical in various steps of semiconductor fabrication like lithography, etching, chamber cleaning, and others. Forever chemical emissions can exhibit global warming potentials thousands of times greater than carbon dioxide and persist in the atmosphere for millennia. Despite their severe impact, most sustainability works in computer systems have focused on carbon emissions alone. We address this gap by introducing ForgetMeNot, a modeling tool that quantifies fluorinated compound emissions by integrating fabrication facility-specific practices and hardware specifications, and validate its accuracy using real-world emission data from fabrication facilities. We show how ForgetMeNot can enable fabrication facilities to optimize design and material usage decisions for emission reduction and provide researchers with a methodology to calibrate emission estimates for hardware designs. When ForgetMeNot is applied to analyze emissions for manufacturing CPUs, DRAM, and storage, it illustrates how hardware generations, lithography techniques, and capacities impact fluorinated compound emissions. Finally, we demonstrate how datacenter operators can assemble low-emission servers while balancing performance demands. By factoring in fluorinated emissions into manufacturing decisions, ForgetMeNot paves the way for building more sustainable systems."
  },
  {
    "title": "Non-Ohmic behavior in (Bi$_{1-x}$Sb$_x$)$_2$Te$_3$ by Joule heating",
    "abstract": "A prerequisite to using the net spin polarization generated by a source-drain bias in three-dimensional topological insulators for spintronic applications, is understanding how such a bias alters the transport properties of these materials. At low temperatures, quantum corrections can dominate the temperature dependence of the resistance. Although a DC bias does not break time-reversal symmetry and is therefore not expected to suppress quantum corrections, an increase of the electron temperature due to Joule heating can cause a suppression. This suppression at finite bias can lead to a non-Ohmic differential resistance in the three-dimensional topological insulator (Bi$_{1-x}$Sb$_x$)$_2$Te$_3$, consisting of a zero-bias resistance peak (from electron-electron interactions) and a high-bias background (from weak antilocalization). We show that the bias voltage dependence of quantum corrections can be mapped to the temperature dependence, while the heating effect on the lattice temperature remains small. When searching for non-Ohmic effects due to novel phenomena in three-dimensional topological insulators, Joule heating should not be overlooked."
  },
  {
    "title": "On the Nature of the Fundamental Plasma Excitation in a Plasmonic Crystal",
    "abstract": "We report on the experimental study of the spectrum of plasma excitations in a plasmonic crystal fabricated from the two-dimensional electron system in an AlGaAs/GaAs semiconductor heterostructure. Our results reveal that the plasmonic crystal supports only a single fundamental plasma mode, challenging the current theoretical understanding that anticipates multiple modes. This unexpected finding is supported by comprehensive research on the mode frequency and relaxation as a function of the gate width across different plasmonic crystal periods. Furthermore, we develop an analytical approach that accurately describes the behavior of plasma excitations in plasmonic crystals, providing new insights into the fundamental physics of plasmonic systems."
  },
  {
    "title": "Angle-dependent resonant tunneling and thermoelectric energy management in a hybrid 1D-2D-1D semiconductor nanostructure",
    "abstract": "Low-dimensional semiconductors have been widely exploited in thermoelectric energy conversion for high efficiencies due to their suppressed lattice thermal conduction, sharply defined electronic density of states, and tunable energy-selective electron transmission. However, the widespread challenge of Fermi-level pinning or doping constraints limit precise control over thermoelectric energy management via chemical potential modulation. Here, we proposed an alternative strategy: leveraging angle-dependent electron incidence to dynamically manipulate electron transmission and heat transport, which was implemented theoretically in a two-dimensional InP/InAs/InP double-barrier heterostructure integrated with laterally one-dimensional electrodes. By combining the transfer matrix method and Landauer formalism, we demonstrated the angle-dependent resonant tunneling dynamics, tunable negative differential resistance effect, and near-Carnot limits in thermoelectric energy conversions. Angular modulation enables precise control over transmission resonances, facilitating dynamic transitions among thermoelectric regimes (power generation, cooling, and hybrid heating) without requiring extreme chemical potential shifts. This work establishes angularly resolved electron transmission as a versatile mechanism for on-chip thermal management and cryogenic applications, offering a pathway to circumvent material limitations in next-generation nanoelectronics and quantum devices."
  },
  {
    "title": "Magnetotransport signatures of spin-orbit coupling in high-temperature cuprate superconductors",
    "abstract": "Spin transport in superconductors offers a compelling platform to merge the dissipationless nature of superconductivity with the functional promise of spin-based electronics. A significant challenge in achieving spin polarisation in conventional superconductors stems from the singlet state of Cooper pairs, which exhibit no net spin. The generation of spin-polarised carriers, quasiparticles, or triplet pairs in superconductors has predominantly been realised in hybrid superconductor/ferromagnet systems through proximity-induced spin polarisation. Historically, cuprate superconductors have been characterised by strong electronic correlations but negligible spin-orbit coupling. Here, we report exceptionally large anisotropic magnetoresistance and a pronounced planar Hall effect arising near the superconducting phase transition in the prototypical high-temperature cuprate superconductor YBa2Cu3O7-x without using a proximity ferromagnet. These effects, unprecedented in centrosymmetric cuprates, emerge from spin-polarised quasiparticle transport mediated by strong spin-orbit coupling. By systematically tuning magnetic field strength, orientation, temperature, and doping, we show clear evidence of spin-orbit-driven transport phenomena in a material class long thought to lack such interactions. Our findings reveal an unexpected spin-orbit landscape in cuprates and open a route to engineer spintronic functionalities in high-temperature superconductors."
  },
  {
    "title": "Inelastic tunneling into multipolaronic bound states in single-layer MoS$_2$",
    "abstract": "Polarons are quasiparticles that arise from the interaction of electrons or holes with lattice vibrations. Though polarons are well-studied across multiple disciplines, experimental observations of polarons in two-dimensional crystals are sparse. We use scanning tunneling microscopy and spectroscopy to measure inelastic excitations of polaronic bound states emerging from coupling of non-polar zone-boundary phonons to Bloch electrons in n-doped metallic single-layer MoS$_2$. The latter is kept chemically pristine via contactless chemical doping. Tunneling into the vibrationally coupled polaronic states leads to a series of evenly spaced peaks in the differential conductance on either side of the Fermi level. Combining density functional (perturbation) theory with a recently developed ab initio electron-lattice downfolding technique, we show that the energy spacing stems from the longitudinal-acoustic phonon mode that flattens at the Brillouin zone edge and is responsible for the formation of stable multipolarons in metallic MoS$_2$."
  },
  {
    "title": "Effect of crystallinity on spin-orbit torque in 5$\\textit{d}$ iridium oxide IrO$_{2}$",
    "abstract": "The 5$\\textit{d}$ transition-metal oxides provide an intriguing platform for generating an efficient spin current due to a unique electronic structure dominated by 5d electrons with strong spin-orbit coupling. Here, we report on the effect of crystallinity on current-driven spin-orbit torque (SOT) in binary 5$\\textit{d}$ iridium oxide IrO$_{2}$ thin films by controlling amorphous, polycrystalline, and epitaxial states. By conducting harmonic Hall measurement in bilayers composed of ferromagnetic Co$_{20}$Fe$_{60}$B$_{20}$ and IrO$_{2}$, we find that dampinglike (DL) SOT is larger than fieldlike SOT for all the samples. We also demonstrate that both electrical resistivity and the DL SOT efficiency increase in order of epitaxial, polycrystalline, and amorphous IrO$_{2}$. Despite their different electrical conductivities, spin Hall conductivities of the three states of the IrO$_{2}$ layer are found to be nearly constant, which is consistent with the intrinsic regime of the spin Hall effect scaling relation. Our results highlight the important role that crystallinity plays in the spin-current generation, leading to the potential technological development of spintronic devices based on the 5$\\textit{d}$ transition-metal oxides."
  },
  {
    "title": "Effects of Coupling Between Chiral Vibrations and Spins in Molecular Magnets",
    "abstract": "In single molecular magnets, chiral vibrations carrying vibrational angular momentum ($\\hat{L}^{\\text{vib}}$) emerge due to the splitting of a doubly degenerate vibrational mode. Here, we identify a new type of effective spin-vibrational coupling responsible for lifting this degeneracy, which can facilitate optically selective excitations. In the presence of an external Zeeman field, this coupling breaks both inversion (in-plane parity) $\\mathcal{P}$ and time-reversal $\\mathcal{T}$ symmetries, imparting distinct geometric phases to the resulting dressed spin-vibronic states. The wave function of the spin-vibronic state is characterized by a $\\pi$-Berry phase, which results in magneto-optical circular dichroism. This framework is validated using density functional theory and multi-reference \\emph{ab initio} calculations on the Ce(trenovan) molecular magnet."
  },
  {
    "title": "Surface coupling of NV centers over nanoscale lengths",
    "abstract": "Shallow nitrogen-vacancy (NV-) centers in diamond are among the most promising quantum sensors, offering high sensitivity and nanoscale spatial resolution. These systems are, however, prone to decoherence due to coupling with surface states. Here, we study sub-surface NV- centers embedded into large diamond slabs (8 nm) using various surface orientations (100 and 111) and terminations (hydrogen and nitrogen terminators) and compute the quasiparticle states of the defect. Our results show how dynamical charge fluctuations near the surface influence defect stability. We find that the (100) N-terminated surface introduces strong surface-state instabilities, while the (111) N-terminated surface provides a more favorable configuration. However, many-body calculations (within the GW approximation) reveal that defects placed shallower than ~ 4 nm are prone to surface-induced ionization. These findings establish an accurate theoretical limit on the minimum depth required for stable NV- centers, guiding the design of NV- based quantum sensors."
  },
  {
    "title": "Topological surface states in γ-PtBi$_2$ evidenced by scanning tunneling microscopy",
    "abstract": "For the application of topological materials, the specific location of their topological surface states with respect to the Fermi level are important. {\\gamma}-PtBi2 has been demonstrated to be a Weyl semimetal possessing superconducting Fermi arcs by photoemission spectroscopy. However, the evidence of its topological surface states is lacking by scanning tunneling microscopy (STM), which should be rather sensitive to detect the surface states. Here, we show multiple STM evidences for the existence of topological surface states in {\\gamma}-PtBi2. We observe not only the step-edge and screw dislocation induced quasiparticle interference fringes, originating from the electron scatterings between the Fermi arcs of {\\gamma}-PtBi2, but also the back-scattering prohibition related to the spin-flip process, which is the direct evidence for the topological nature of the surface states. Moreover, we demonstrate that the topological surface states are precisely located over a narrow energy range near the Fermi level, within which sharply enhanced intensity and slow spatial decay of quasiparticle interference are observed."
  },
  {
    "title": "Analyzing Patterns and Influence of Advertising in Print Newspapers",
    "abstract": "This paper investigates advertising practices in print newspapers across India using a novel data-driven approach. We develop a pipeline employing image processing and OCR techniques to extract articles and advertisements from digital versions of print newspapers with high accuracy. Applying this methodology to five popular newspapers that span multiple regions and three languages, English, Hindi, and Telugu, we assembled a dataset of more than 12,000 editions containing several hundred thousand advertisements. Collectively, these newspapers reach a readership of over 100 million people. Using this extensive dataset, we conduct a comprehensive analysis to answer key questions about print advertising: who advertises, what they advertise, when they advertise, where they place their ads, and how they advertise. Our findings reveal significant patterns, including the consistent level of print advertising over the past six years despite declining print circulation, the overrepresentation of company ads on prominent pages, and the disproportionate revenue contributed by government ads. Furthermore, we examine whether advertising in a newspaper influences the coverage an advertiser receives. Through regression analyses on coverage volume and sentiment, we find strong evidence supporting this hypothesis for corporate advertisers. The results indicate a clear trend where increased advertising correlates with more favorable and extensive media coverage, a relationship that remains robust over time and across different levels of advertiser popularity."
  },
  {
    "title": "Sequential topology: iterative topological phase transitions in finite chiral structures",
    "abstract": "We present theoretical and experimental results probing the rich topological structure of arbitrarily disordered finite tight binding Hamiltonians with chiral symmetry. We extend the known classification by considering the topological properties of phase boundaries themselves. That is, can Hamiltonians that are confined to being topologically marginal, also have distinct topological phases? For chiral structures, we answer this in the affirmative, where we define topological phase boundaries as having an unavoidable increase in the degeneracy of real space zero modes. By iterating this question, and considering how to enforce a Hamiltonian to a phase boundary, we give a protocol to find the largest dimension subspace of a disordered parameter space that has a certain order degeneracy of zero energy states, which we call \\textit{sequential topology}. We show such degeneracy alters localisation and transport properties of zero modes, allowing us to experimentally corroborate our theory using a state-of-the-art coaxial cable platform. Our theory applies to systems with an arbitrary underlying connectivity or disorder, and so can be calculated for any finite chiral structure. Technological and theoretical applications of our work are discussed."
  },
  {
    "title": "Crescent domain-wall pairs in anisotropic two-dimensional MnOI monolayer with fast dynamics",
    "abstract": "The controllable and efficient manipulation is always a key challenge for the application of topological magnetic textures in spintronic devices. By first-principles calculations and atomistic simulations, the present work reveals an exotic domain-wall pair in crescent shape, which possesses topology in one dimension and particle-like robustness in two dimensions. Its antiferromagnetic version is observed in the two-dimensional MnOI monolayer with a strong anisotropy, and the ferromagnetic version exists under an appropriate strain. Both of them can be driven efficiently by current to move in a straight line along a certain direction. Hereby, another possible path is provided to realize the application of topological magnetic texture in the next-generation high-speed spintronic devices."
  },
  {
    "title": "Single Vanadium Dioxide Nanoparticle-Enabled Plasmonic switch with Thermal and Electronic Reconfigurability",
    "abstract": "We present an integrated switch that combines plasmonic and neuromorphic technologies with a single sub-stoichiometric VO2-x nanoparticle. The presented device acts as a versatile plasmonic switch with dual thermal and electrical reconfigurability leveraging the near-room temperature phase transition of the VO2-x nanoparticles combined with the rapid phase recovery to drive the device. The change in both the optical and electrical properties of the VO2-x nanoparticle enables simultaneous optical and electrical readouts making the plasmonic device suitable as a phase change memory cell which is crucial in the convergence of computing and communication technologies. Our demonstration of reversible electrical switching, evidenced by a 6dB modulation depth and concurrent optical and electrical outputs, signifies a major stride in merging electronic and photonic functionalities within phase-change material devices. This novel strategy not only harmonizes optical communication with electronic computing but also advances the development of sophisticated integrated neuromorphic devices."
  },
  {
    "title": "New generation of cavity microscope for quantum simulations",
    "abstract": "We present the design and assembly of a cavity microscope for quantum simulations with ultracold atoms. The system integrates a high-finesse optical cavity with a pair of high-numerical aperture lenses sharing a common optical axis, enabling simultaneous operation with light close-to-atomic resonance. The system keeps the advantages of a rigid, single-block structure holding the lenses and cavity together, and improves over existing designs by using most of the solid angle left free by the cavity mode for imaging and atomic manipulation purposes. The cavity has a length of $19.786$mm, a finesse of $2.35\\times 10^4$ and operates $214\\mu\\text{m}$ away from the concentric limit, deep in the strong coupling regime. The two lenses offer a numerical aperture of $0.52$ each and maximal optical access in all directions transverse to the cavity axis, compatible with applications in quantum-gas microscopes, micro-tweezer arrays or few-fermions systems, as well as future cavity-assisted quantum simulation protocols demanding sub-cavity-mode control of the atom-cavity coupling."
  },
  {
    "title": "An infinite grid of mesoscopic resistors: investigation and visualization of ballistic conduction",
    "abstract": "A square lattice of mesoscopic resistors is considered. Each bond is modeled as a narrow waveguide, while junctions are sources of elastic scattering given by a scattering matrix \\mathbf{S}. Symmetry and unitarity constraints are used in a detailed way to simplify all possible matrices \\mathbf{S}. Energetic band structure of the system is determined and visualized for exemplary parameters. Conductance between external electrodes attached to two arbitrary nodes is given by the Landauer formula. Thus the transmittance between the electrodes is calculated. The rest of the paper is devoted to studying wave function patterns arising from an electron injected through one electrode into the system. It is observed that depending on its energy both dull and localized or intricate and expansive patterns occur. It is justified mathematically that fitting electron energy into an energy band can be associated with emergence of complex patterns. Finally, possible experimental realizations of the considered model are briefly mentioned."
  },
  {
    "title": "Are Spatial-Temporal Graph Convolution Networks for Human Action Recognition Over-Parameterized?",
    "abstract": "Spatial-temporal graph convolutional networks (ST-GCNs) showcase impressive performance in skeleton-based human action recognition (HAR). However, despite the development of numerous models, their recognition performance does not differ significantly after aligning the input settings. With this observation, we hypothesize that ST-GCNs are over-parameterized for HAR, a conjecture subsequently confirmed through experiments employing the lottery ticket hypothesis. Additionally, a novel sparse ST-GCNs generator is proposed, which trains a sparse architecture from a randomly initialized dense network while maintaining comparable performance levels to the dense components. Moreover, we generate multi-level sparsity ST-GCNs by integrating sparse structures at various sparsity levels and demonstrate that the assembled model yields a significant enhancement in HAR performance. Thorough experiments on four datasets, including NTU-RGB+D 60(120), Kinetics-400, and FineGYM, demonstrate that the proposed sparse ST-GCNs can achieve comparable performance to their dense components. Even with 95% fewer parameters, the sparse ST-GCNs exhibit a degradation of <1% in top-1 accuracy. Meanwhile, the multi-level sparsity ST-GCNs, which require only 66% of the parameters of the dense ST-GCNs, demonstrate an improvement of >1% in top-1 accuracy. The code is available at https://github.com/davelailai/Sparse-ST-GCN."
  },
  {
    "title": "Plasmonic Nanoparticle-in-nanoslit Antenna as Independently Tunable Dual-Resonant Systems for Efficient Frequency Upconversion",
    "abstract": "Dual-band plasmonic nanoantennas, exhibiting two widely separated user-defined resonances, are fundamental building blocks for the investigation and optimization of plasmon-enhanced optical phenomena, including photoluminescence, Raman scattering, and various nonlinear effects such as harmonic generation or sum-frequency generation, parametric down-conversion, etc. The nanoparticle-in-slit (NPiS) or nanoparticle-in-groove (NPiG) is a recently proposed dual-band antenna with independently tunable resonances at mid-infrared and visible wavelengths. It was used to enhance the corresponding sum- and difference-frequency generation processes from optimally located molecules by an estimated $10^{13}$-fold. However, the theoretical understanding of such structures and their eigenmodes remains poor, hindering further optimization and limiting broader applications. Here, we explore a diverse range of nanocavity-like quasi-normal modes (QNMs) supported by NPiS structures, examining the contributions of both their near-field (i.e., giant photonic density of states) and far-field (i.e., spatial radiation patterns) characteristics to frequency upconversion. We identify methods for independently tuning the visible and mid-infrared resonances while conserving a good mode overlap in the near field, which is essential for efficient nonlinear processes. Moreover, through mode analysis, we unveil an experimentally unexplored fundamental resonance with greater field enhancement and much-improved mode overlap with the mid-infrared field, which could, in principle, further boost the mid-infrared upconversion efficiency by 5-fold compared to existing results. This work helps to rationalize and optimize the enhancement of nonlinear effects across a wide spectral range using a flexible and experimentally attractive nanoplasmonic platform."
  },
  {
    "title": "Nonreciprocal spin waves in out-of-plane magnetized waveguides reconfigured by domain wall displacements",
    "abstract": "Wave-based platforms for novel unconventional computing approaches like neuromorphic computing require a well-defined, but adjustable flow of wave information combined with non-volatile data storage elements to implement weights which allow for training and learning. Due to their inherent nonreciprocal properties and their direct physical interaction with magnetic data storage, spin waves are ideal candidates to realize such platforms. In the present study, we show how spin-wave nonreciprocity induced by dipolar interactions of nanowaveguides with antiparallel, out-of-plane magnetization orientations can be used to create a spin-wave circulator allowing for unidirectional information transport and complex signal routing. In addition, the device can be reconfigured by a magnetic domain wall with adjustable position, which allows for a non-volatile tuning of the nonreciprocity and signal propagation. These properties are demonstrated for a spin-wave directional coupler through a combination of micromagnetic simulations and analytical modeling also showing that it functions as a waveguide crossing element, tunable power splitter, isolator, and frequency multiplexer. As magnetic material, out-of-plane magnetized Bismuth-doped Yttrium Iron Garnet has been considered. For this material, the motion of domain walls by magnonic spin transfer torque has been recently experimentally demonstrated which enables to store results from spin-wave computation. In combination with the presented concept of domain wall based reconfiguration and nonlinear spin-wave dynamics, this enables for the creation of a nano-scaled nonlinear wave computing platform with the capability for self-learning."
  },
  {
    "title": "Temporal coherence of single photons emitted by hexagonal Boron Nitride defects at room temperature",
    "abstract": "Color centers in hexagonal boron nitride (hBN) emerge as promising quantum light sources at room temperature, with potential applications in quantum communications, among others. The temporal coherence of emitted photons (i.e. their capacity to interfere and distribute photonic entanglement) is essential for many of these applications. Hence, it is crucial to study and determine the temporal coherence of this emission under different experimental conditions. In this work, we report the coherence time of the single photons emitted by an hBN defect in a nanocrystal at room temperature, measured via Michelson interferometry. The visibility of this interference vanishes when the temporal delay between the interferometer arms is a few hundred femtoseconds, highlighting that the phonon dephasing processes are four orders of magnitude faster than the spontaneous decay time of the emitter. We also analyze the single photon characteristics of the emission via correlation measurements, defect blinking dynamics, and its Debye-Waller factor. Our room temperature results highlight the presence of a strong phonon-electron coupling, suggesting the need to work at cryogenic temperatures to enable quantum photonic applications based on photon interference."
  },
  {
    "title": "Flat band mediated photon-photon interactions in 2D waveguide QED networks",
    "abstract": "We investigate a Lieb lattice of quantum emitters coupled to a two-dimensional waveguide network and demonstrate that this system supports an energetically isolated flat band, enabling localization despite the presence of long-range photon-mediated couplings. We then explore the two-excitation dynamics in both the softcore and hardcore interaction regimes, which arise from the nonlinearity of the emitters. In the softcore regime, we observe interaction-induced photon transport within the flat band, mediated by the formation of bound photon pairs. In the hardcore regime, corresponding to the two-level atom limit, we instead find the emergence of metastable exciton-like dressed states involving both flat and dispersive bands. Our findings highlight how the interplay between the collective behavior of emitters and effective photon-photon interactions can provide a platform for studying highly correlated photonic states in flat-band systems."
  },
  {
    "title": "The DESI Y1 RR Lyrae catalog II: The metallicity dependency of pulsational properties, the shape of the RR Lyrae instability strip, and metal rich RR Lyrae",
    "abstract": "RR Lyrae stars (RRLs) are valuable probes of both Milky Way assembly and stellar-evolution physics. Using a sample 6,240 RRLs obtained in the first year of the Dark Energy Spectroscopic Instrument (DESI) survey, we investigate the metallicity of RRLs and its correlation with their pulsation properties. We find that (1) a clear correlation between period and [Fe/H] reinforces the view that the longstanding Oosterhoff dichotomy arises from the scarcity of intermediate-metallicity Galactic globular clusters hosting sizeable RRL samples; (2) high-amplitude short-period and small-amplitude short-period variables are comparatively metal-rich, with mean [Fe/H] = $-1.39 \\pm 0.27$ and $-1.30 \\pm 0.28$, respectively; (3) in double-mode pulsators (RRd) the metallicity declines smoothly with increasing fundamental-mode period, and anomalous RRd stars occupy a remarkably narrow [Fe/H] range relative to classical RRd stars; (4) this spectroscopic sample let us, for the first time, place empirical constraints on the metallicity-dependent topology of the instability strip using phase-corrected effective temperatures and a large number of RRLs, where we observe an instability strip that moves towards cooler Teff with declining [Fe/H] with a width consistent with stellar-evolution models; and (5) a subset of metal-rich RRLs exhibits orbits consistent with disk membership and halo kinematics. Our results confirm the tantalizing potential of DESI for Galactic and stellar astrophysics and highlight the importance of the even larger samples of RRLs and data-processing improvements forthcoming in future DESI data releases."
  },
  {
    "title": "High-endurance mechanical switching in a DNA origami snap-through mechanism",
    "abstract": "Switchable elements are key components of dynamic technological and biological systems, enabling reversible transitions between well-defined states. Here, we present a DNA origami-based, mechanically bistable snap-through mechanism that can be electrically controlled. This nanoscale switch exhibits long-term stability in both states in the absence of external stimuli, while achieving millisecond-scale switching times upon application of an electric field. Individual devices sustain hundreds of thousands of switching cycles over several hours, offering a powerful platform for systematically studying the endurance and failure mechanisms of biomolecular nanoswitches. Functionalization with a gold nanorod further allows polarization-dependent optical modulation, opening avenues for applications in plasmonics. This versatile electromechanical interface has potential uses in molecular information processing, optical nanodevices, and the dynamic control of chemical reactions."
  },
  {
    "title": "Giant elastoresistance in magic-angle twisted bilayer graphene",
    "abstract": "Strongly correlated and topological phases in moir\\'e materials are exquisitely sensitive to lattice geometry at both atomic and superlattice length scales. Twist angle, pressure, and strain directly modify the lattice, and thus act as highly effective tuning parameters. Here we examine electrical transport in twisted bilayer graphene subjected to continuous uniaxial strain. Near the magic angle ($\\approx 1.1^{\\circ}$), devices exhibit a pronounced elastoresistance that depends on band filling and temperature, with a gauge factor more than two orders of magnitude larger than that of conventional metals. In selected doping regimes the elastoresistance exhibits a Curie-Weiss-like temperature divergence. We discuss possible microscopic origins, including nematic fluctuations and enhanced electronic entropy from fluctuating isospin moments. Our work establishes uniaxial strain as a versatile probe of correlated physics in a moir\\'e material."
  },
  {
    "title": "Hopf Bifurcation of Nonlinear Non-Hermitian Skin Effect",
    "abstract": "The non-Hermitian skin effect, nonreciprocity-induced anomalous localization of an extensive number of eigenstates, represents a hallmark of non-Hermitian topological systems with no analogs in Hermitian systems. Despite its significance across various open classical and quantum systems, the influence of nonlinearity has remained largely unclear. Here, we reveal the Hopf bifurcation of the nonlinear skin effect as a critical phenomenon unique to nonlinear non-Hermitian systems. We demonstrate that nonlinearity destabilizes skin states and instead gives rise to the emergence of delocalized states associated with limit cycles in phase space. We also uncover the algebraically localized critical skin effect precisely at the Hopf bifurcation point. We illustrate these behavior in a nonlinear extension of the Hatano-Nelson model in both continuum and lattice. Our work shows a significant role of nonlinearity in the skin effect and uncovers rich phenomena arising from the interplay between non-Hermiticity and nonlinearity."
  },
  {
    "title": "Dimensional crossover of class D real-space topological invariants",
    "abstract": "The topological properties of a material depend on its symmetries, parameters, and spatial dimension. Changes in these properties due to parameter and symmetry variations can be understood by computing the corresponding topological invariant. Since topological invariants are typically defined for a fixed spatial dimension, there is no existing framework to understand the effects of changing spatial dimensions via invariants. Here, we introduce a framework to study topological phase transitions as a system's dimensionality is altered using real-space topological markers. Specifically, we consider Shiba lattices, which are class D materials formed by magnetic atoms on the surface of a conventional superconductor, and characterize the evolution of their topology when an initial circular adatom island is deformed into a chain. We also provide a measure of the corresponding protection against disorder. Our framework is generalizable to any symmetry class and spatial dimension, potentially guiding the design of materials by identifying, for example, the minimum thickness of a slab required to maintain three-dimensional topological properties."
  },
  {
    "title": "High-fidelity dispersive spin sensing in a tuneable unit cell of silicon MOS quantum dots",
    "abstract": "Metal-oxide-semiconductor (MOS) technology is a promising platform for developing quantum computers based on spin qubits. Scaling this approach will benefit from compact and sensitive sensors that minimize constraints on qubit connectivity while being industrially manufacturable. Here, we demonstrate a compact dispersive spin-qubit sensor, a single-electron box (SEB), within a bilinear unit cell of planar MOS quantum dots (QDs) fabricated using an industrial grade 300 mm wafer process. By independent gate control of the SEB and double-quantum-dot tunnel rates, we optimize the sensor to achieve a readout fidelity of 99.92% in 340us (99% in 20us), fidelity values on a par with the best obtained with less compact sensors. Furthermore, we develop a Hidden Markov Model of the two-electron spin dynamics that enables a more accurate calculation of the measurement outcome and hence readout fidelity. Our results show how high-fidelity sensors can be introduced within silicon spin-qubit architectures while maintaining sufficient qubit connectivity as well as providing faster readout and more efficient initialisation schemes."
  },
  {
    "title": "Environmental dependences of galaxy properties in the southern regions of the GAMA survey",
    "abstract": "Physical properties of galaxies are correlated with their local environment. Quantifying these environmental correlations is crucial for a better understanding of galaxy formation and evolution. In this work, we investigate how galaxy properties are correlated with the environment through spatial clustering measurements of galaxies. Using two-point correlation functions and marked correlation functions, we measure and compare the environmental dependence of colour, stellar mass, luminosities in the $u$, $g$, $r$, $J$, and $K$ bands, star formation rate, and specific star formation rate. We use galaxy samples from the southern (G02 and G23) regions of the Galaxy and Mass Assembly (GAMA) survey. Furthermore, we explore how redshift completeness affects clustering measurements by comparing different subsets of the G02 region with varying redshift completeness. We show that the $u-r$ and $g-r$ colours correlate the most with the local environment, with stellar mass being the next most reliable indicator of the environment. We also demonstrate that redshift completeness has a significant effect on clustering measurements."
  },
  {
    "title": "Computer simulations show that liquid-liquid phase separation enhances self-assembly",
    "abstract": "Biomolecular condensates are liquid- or gel-like droplets of proteins and nucleic acids formed at least in part through liquid-liquid phase separation. Condensates enable diverse functions of cells and the pathogens that infect them, including self-assembly reactions. For example, it has been shown that many viruses form condensates within their host cells to compartmentalize capsid assembly and packaging of the viral genome. Yet, the physical principles controlling condensate-mediated self-assembly remain incompletely understood. In this article we use coarse-grained molecular dynamics simulations to study the effect of a condensate on the assembly of icosahedral capsids. The capsid subunits are represented by simple shape-based models to enable simulating a wide range of length and time scales, while the condensate is modeled implicitly to study the effects of phase separation independent of the molecular details of biomolecular condensates. Our results show that condensates can significantly enhance assembly rates, yields, and robustness to parameter variations, consistent with previous theoretical predictions. However, extending beyond those predictions, the computational models also show that excluded volume enables control over the number of capsids that assemble within condensates. Moreover, long-lived aberrant off-pathway assembly intermediates can suppress yields within condensates. In addition to elucidating condensate-mediated assembly of viruses and other biological structures, these results may guide the use of condensates as a generic route to enhance and control self-assembly in human-engineered systems."
  },
  {
    "title": "Phonon Edelstein effect in chiral metals",
    "abstract": "We propose a mechanism of current-induced phonon angular momentum, which we call phonon Edelstein effect. We investigate this effect in three-dimensional chiral metals with spin-orbit coupling and chiral phonons, and obtain an analytical expression of phonon angular momentum induced by the current. We also discuss the physical interpretation of this effect and give an estimation of its magnitude."
  },
  {
    "title": "Observations of a New Form of Partial Filament Eruption",
    "abstract": "Coronal mass ejections (CMEs) and coronal jets are two of the best-studied forms of solar eruptions, with the same underlying physics. Previous studies have presented partial eruptions producing coronal jets. We report, for the first time, a detailed analysis of three partial eruptions that segmented after the eruption began and produced CMEs. We use multiwavelength observations from the Solar Dynamics Observatory/Atmospheric Imaging Assembly, Solar TErrestrial RElations Observatory, and Solar Orbiter to reconstruct the three-dimensional evolution of the events. The magnetic field extrapolations indicated that the initial filaments were overlaid by pseudostreamer structures, and the splitting occurred after the interaction between the filament-supporting flux and external open field through their null points. The breakout mechanism seems to play a key role in both halting the system and splitting it. However, this initial evolution and consequent splitting into an erupting flux rope above the prominence segment that failed to erupt poses severe challenges to theories of solar eruptions."
  },
  {
    "title": "Spin-orbit physics stemming from mixed parity superconductivity: A relationship between mixed parity superconductivity and magnetism with spin-orbit coupling",
    "abstract": "We show that Hamiltonian for mixed parity superconductivity can be recast into that for magnetism with spin-orbit coupling by the Schrieffer-Wolff transformation, indicating that mixed parity superconductivity and magnetism with spin-orbit coupling can share the same physics. As demonstrations, we discuss the Dzyaloshinskii-Moriya type interactions, magnetoelectric effect, supercurrent-induced spin current, and altermagnetism in mixed parity superconductors. All these effects originate purely from mixed parity superconductivity."
  },
  {
    "title": "Topological properties of domain walls in antiferromagnetic topological insulators",
    "abstract": "Motivated by the study of stacking faults in weak topological insulators and the observation of magnetic domain walls in MnBi$_{2n}$Te$_{3n+1}$, we explore the topological properties of domain walls in antiferromagnetic topological insulators. We develop two tight-binding models: one based on a strong topological insulator with antiferromagnetic order, and another built from stacked Chern insulators with alternating Chern numbers. Both systems are dual topological insulators, i.e. they are at the same time antiferromagnetic and crystalline topological insulators, but differ by the type of mirror symmetry protecting the crystalline phase: spinful versus spinless. We show that in the spinful case the mirror Chern number is invariant under time reversal and that it changes sign in the spinless case. This influences the properties of the two systems in the presence of a magnetic domain wall, which is created in the system when the magnetization is flipped via a time-reversal transformation. In the first type, the bulk of the domain wall is gapped but the defect will host chiral edge states when it ends on an external ferromagnetic surface. In the second, due to the flip in the mirror Chern number, the domain wall is a two-dimensional embedded semimetal with 2D gapless states protected by mirror symmetry. Our results show that domain walls can be a source of non-trivial topology, allowing to generate and manipulate gapless states within the bulk and the ferromagnetic surfaces of antiferromagnetic topological insulators."
  },
  {
    "title": "Sensing a magnetic rare-earth surface alloy by proximity effect with an open-shell nanographene",
    "abstract": "Open-shell nanographenes have attracted significant attention due to their structurally tunable spin ground state. While most characterization has been conducted on weakly-interacting substrates such as noble metals, the influence of magnetic surfaces remains largely unexplored. In this study, we investigate how TbAu2, a rare-earth-element-based surface alloy, affects the magnetic properties of phenalenyl (or [2]triangulene (2T)), the smallest spin-1/2 nanographene. Scanning tunneling spectroscopy (STS) measurements reveal a striking contrast: while 2T on Au(111) exhibits a zero-bias Kondo resonance - a hallmark of a spin-1/2 impurity screened by the conduction electrons of the underlying metal - deposition on TbAu2 induces a symmetric splitting of this feature by approximately 20 mV. We attribute this splitting to a strong proximity-induced interaction with the ferromagnetic out-of-plane magnetization of TbAu2. Moreover, our combined experimental and first-principles analysis demonstrates that this interaction is spatially modulated, following the periodicity of the TbAu2 surface superstructure. These findings highlight that TbAu2 serves as a viable platform for stabilizing and probing the magnetic properties of spin-1/2 nanographenes, opening new avenues for the integration of {\\pi}-magnetic materials with magnetic substrates."
  },
  {
    "title": "High frequency permeability of the composite with ferromagnetic spherical shells",
    "abstract": "The paper studies high-frequency permeability of the composite materials consisting of hollow ferromagnetic particles embedded into the non-magnetic media. We model the ferromagnetic particles in composite by spherical shell: the thickness of the ferromagnetic region $d$ compared to the particles' diameter $D$ can vary in a wide range, from $d\\ll D$ to $d\\sim D$. We assume that the magnetization distribution in such a particle is non-uniform, but forms a vortex-like structure: the magnetization is twisted in some plain outside two vortex cores placed at the poles of the particle. The high-frequency permeability of such a composite material has been studied in the limit of non-interacting particles. We study the dependence of the permeability on the ratio $d/D$. It was shown, in particular, that in the limit $d/D\\ll1$ the frequency dependence of the particle's susceptibility is quite similar to that for the thin film. At the same time, the magnetization oscillations in the ac field are non-homogeneous."
  },
  {
    "title": "Chiral near-field control of quantum light generation using magneto-optical graphene",
    "abstract": "We theoretically explore strategies to actively control photon emission from quantum light sources by leveraging the large magneto-optical response of graphene. The quantum electrodynamic response of graphene -- characterized by the Purcell factor and the Lamb shift of a proximal emitter -- is analyzed for extended two-dimensional sheets, one-dimensional nanoribbons, and zero-dimensional nanodisks, all of which are endowed with an intrinsic chiral near-field response under a static perpendicular magnetic field. Using rigorous semianalytical models of these systems, we reveal that the emission properties can be readily tuned by variations in doping charge carrier density and applied magnetic field strength, both with respect to magnetoplasmon resonances (at infrared frequencies) and Shubnikov-de-Haas oscillations (entering telecommunication bands) associated with optical transitions between discrete Landau levels. Localized magnetoplasmons in graphene nanoribbons are predicted to induce large dissymmetry in the spontaneous emission from left-hand and right-hand circularly polarized transitions in a proximal quantum emitter, presenting applications for chiral quantum optical waveguiding. This chiral dissymmetry is further enhanced in gyrotropic graphene nanodisks, signaling that the spatial shaping of near-fields in nanostructured graphene can significantly boost the intrinsic chiral response induced by the magnetic field. These results indicate that magneto-optical graphene constitutes a versatile and highly tunable platform for quantum light generation and manipulation at the nanoscale."
  },
  {
    "title": "Flexible-AR display for near-eye operations",
    "abstract": "We propose a new technique to fabricate flexible-near-field Argument-Reality (AR) display using modular-molds. A near-eye flexible-AR-display is fabricated based on parameters extracted from simulations. Our AR-display successfully reconstructed images and videos from a light-engine. It opens a new approach to fabricate flexible-near-field AR display with good physical stress and collision-resilience."
  },
  {
    "title": "Generalized Non-Hermitian Skin Effect",
    "abstract": "In this Letter, we present a unified theory termed the generalized non-Hermitian skin effect. This framework provides a universal characterization of typical one-dimensional non-Hermitian skin effects within the perturbative regime and unveils a novel type of skin effect that beyond the predictions of the generalized Brillouin zone theory, referred to as the relative skin effect. Previously recognized skin effects are classified as global skin effects, thereby explicitly delineating the scope and limitations of existing non-Bloch band theories. Additionally, we establish, for the first time, a phase transition criterion between global skin effects and relative skin effect, demonstrating the competition between these two distinct types of skin effects, emphasizing the pivotal role of real-space non-Hermitian terms in understanding skin effects and challenging the traditional reliance of non-Bloch band theory on momentum space. Our study substantially advances the conceptual framework of non-Hermitian physics and provides new theoretical tools for investigation."
  },
  {
    "title": "Giant spin-to-charge conversion in germanium tin epilayers",
    "abstract": "We report a study of the spin-to-charge current conversion in compressively strained Ge1-xSnx alloy epilayers as a function of the Sn concentration by means of the inverse spin Hall effect (ISHE). The spin current is generated by spin-pumping effect (SPE) from a thin NiFe layer driven into ferromagnetic resonance (FMR). By simultaneously measuring the magnetic damping of the NiFe layer and the ISHE-induced charge current we extract two key spintronics parameters: the spin Hall angle and the effective spin mixing conductance. Our results reveal a giant spin-to-charge conversion and a non-monotonic dependence of the charge current signal on the Sn concentration, consistent with the variation in the magnetic damping observed in FMR. The values of spin Hall angle are comparable to those reported for heavy metals such as Pt and Ta. Furthermore, we show that the spin conductivity at the Au/GeSn interface can be enhanced by tuning the Sn concentration."
  },
  {
    "title": "Alkali Intercalation of Moire Heterostructures for Low-Loss Plasmonics",
    "abstract": "Two-dimensional metals generically support gapless plasmons with wavelengths well below the wavelength of free-space radiation at the same frequency. Typically, however, this substantial confinement of electromagnetic energy is associated with commensurately high losses, and mitigating such losses may only be achieved through judicious band structure engineering near the Fermi level. In a clean system, an isolated, moderately flat, band at the Fermi level with sufficiently high carrier density can support a plasmon that is immune to propagation losses up to some order in the electron-phonon interaction. However, proposed materials that satisfy these criteria have been ferromagnetic, structurally unstable, or otherwise difficult to fabricate. Here, we propose a class of band structure engineered materials that evade these typical pitfalls -- Moire heterostructures of hexagonal boron nitride intercalated with alkali atoms. We find that only sodium atoms engender a sufficiently isolated band with plasmons lossless at first order in the electron-phonon interaction. We calculate higher order electron-phonon losses and find that at frequencies of about $1$eV the electron-phonon decay mechanism is negligible -- leading to a contribution to the decay rate of about 10^7 Hz in a small frequency range. We next calculate losses from the electron-electron interaction and find that this is the dominant process -- leading plasmons to decay to lower frequency plasmons at a rate of around 10^14 Hz."
  },
  {
    "title": "UV-SERS monitoring of plasmons photodegradation of biomolecules on Aluminum platforms decorated with Rhodium nanoparticles",
    "abstract": "In the search for novel nanostructured materials for UV plasmonics a limited number of choices can be done. Materials such as aluminum, rhodium, gallium and few others can be used. One of the most interesting application for UV plasmonics is Surface Enhanced Raman Spectroscopy. It can be extended to this spectral range to explore spectral properties of biomolecules that have only a small cross section in the visible spectral range. We have recently reported on a functional substrates based on nanoporous aluminum decorated with rhodium nanoparticles. This system showed an interesting behavior for UV excitation at 266 nm, with an unexpected decreasing Raman intensity for increasing rhodium nanoparticles concentrations. We proposed that this effect can be due to the difficult access to the hot spots for the molecules deposited via thermal evaporation. Here we extend this study exploring the performance of the system at another UV excitation wavelengths (325 nm) reporting on experimental results obtained using a deposition process that can bring the molecules at the hot-spots in a more efficient way. Extensive spectroscopic acquisitions, combined with 3D maps, allow to shade a more clear view on the performance of this plasmonic platform. In particular, the photodegration and the potential oxidation of biomolecules driven by the hot-electron/hot-holes produced by the rhodium nanoparticles will be reported."
  },
  {
    "title": "Floquet topological phases of higher winding numbers in extended Su-Schrieffer-Heeger model under quenched drive",
    "abstract": "In this study topological properties of static and dynamic Su-Schrieffer-Heeger models with staggered further neighbor hopping terms of different extents are investigated. Topological characterization of the static chiral models is established in terms of conventional winding number while Floquet topological character is studied by a pair of winding numbers. With the increase of extent of further neighbor terms topological phases with higher winding numbers are found to emerge in both static and dynamic systems. Topological phase diagrams of static models for four different extents of further neighbor terms are presented, which has been generalized for arbitrary extent afterwards. Similarly, Floquet topological phase diagrams of four such dynamic models have been presented. For every model four different parametrizations of hopping terms are introduced which exhibits different patterns of topological phase diagrams. In each case emergence of `0' and `$\\pi$' energy edge states is noted and they are found to consistent to the bulk-boundary correspondence rule applicable for chiral topological systems."
  },
  {
    "title": "IMITATE: Image Registration with Context for unknown time frame recovery",
    "abstract": "In this paper, we formulate a novel image registration formalism dedicated to the estimation of unknown condition-related images, based on two or more known images and their associated conditions. We show how to practically model this formalism by using a new conditional U-Net architecture, which fully takes into account the conditional information and does not need any fixed image. Our formalism is then applied to image moving tumors for radiotherapy treatment at different breathing amplitude using 4D-CT (3D+t) scans in thoracoabdominal regions. This driving application is particularly complex as it requires to stitch a collection of sequential 2D slices into several 3D volumes at different organ positions. Movement interpolation with standard methods then generates well known reconstruction artefacts in the assembled volumes due to irregular patient breathing, hysteresis and poor correlation of breathing signal to internal motion. Results obtained on 4D-CT clinical data showcase artefact-free volumes achieved through real-time latencies. The code is publicly available at https://github.com/Kheil-Z/IMITATE ."
  },
  {
    "title": "Electron spin resonance with scanning tunneling microscopy: a tool for an on-surface quantum platform of identical qubits",
    "abstract": "Integration of electron spin resonance (ESR) in a scanning tunneling microscope (STM) has enabled an all-electrical control of atomic and molecular spins on solid surfaces with atomic-scale precision and energy resolution beyond thermal limitations. Further, coherent manipulation and detection of individual spins in an ESR-STM establishes a powerful quantum platform, allowing for the implementation of fundamental quantum logic operations to on-surface identical qubits. In this review, we introduce recent advances of ESR-STM, focusing on its application to atomic-scale qubits and extension to molecular qubit systems. We discuss the principles underlying ESR-STM, followed by single-spin addressability, coherent control via Rabi oscillations, and quantum state readout through frequency-resolved detection. We further demonstrate multi-qubit control architectures enabled by atom manipulation and local magnetic field engineering, culminating in the realization of multi-qubit logic gates such as the Controlled-NOT and Toffoli gates. These implementations highlight the specialty of ESR-STM towards atomic-scale quantum circuits. Indeed, ESR-STM can be an excellent tool to perform and evaluate quantum operations in molecular qubits. The results reviewed in this collection establish ESR-STM as a versatile tool for advancing quantum coherent science at the atomic and molecular level in solid-state environments."
  }
]