[
  {
    "title": "NVSS J151002+570243: accretion and spin of a z > 4 Fermi detected blazar",
    "abstract": "Active galactic nuclei formation and evolution is currently an open puzzle. Their enormous mass is not explainable via sub-Eddington accretion and the frequent presence of relativistic jets at high-z, commonly linked with spinning black holes, suggest a less effective accretion process. NVSS J151002+570243 is part of this population, being the most distant blazar consistently detected by Fermi/LAT, hence hosting a powerful jet. We tested the hypothesis of a super-Eddington accretion process for this source by modeling its big blue bump with a set of accretion disk emission models. We first tested a standard geometrically thin, optically thick $\\alpha$-disk, obtaining a mass of Log$M/M_\\odot=8.65\\pm0.19$ consistent with virial-based results and a significantly sub-Eddington accretion rate $\\lambda=0.02\\pm0.01$. We then focused on the analytic approximations of two numerical models that take into account the General Relativity effects of a spinning black hole (reasonable due to the presence of a jet) and a close-to- or super-Eddington accretion rate (KERBB and SLIMBH). Despite the focus on super-critical accretion, these models confirm a surprisingly low Eddington ratio, of the order of 3\\%. The hypothesis of a continuous accretion at this measured rate is unrealistic, since it would imply a seed black hole mass of $\\sim10^6-10^8M_\\odot$ at redshift z=20. Hence we explore the possibility of a continuous super-critical accretion starting from a $\\sim10^2M_\\odot$ seed, that would spin up the black hole and eventually contribute in launching the relativistic jet. The measured low accretion rate would thus happen only once the jet is active. This idea would reconcile the black holes with large masses accreting at somewhat slow rates that are observed at z>4, with the need of an extremely fast evolution, by allowing the formation of stellar-size black hole seeds even as late as at $z\\sim8$."
  },
  {
    "title": "Application of the Portable Diagnostic Package to the Wisconsin HTS Axisymmetric Mirror (WHAM)",
    "abstract": "We present an application of the Portable Diagnostic Package (PDP) on the Wisconsin HTS Axisymmetric Mirror (WHAM), which integrates an optical emission spectroscopy (OES) system and an active Thomson scattering (TS) system. Due to the designed portability of our system, we realized the installation of the PDP OES and TS measurements on WHAM in $\\sim$6 months. The OES system facilitates a comprehensive impurity line survey and enables flow measurements through the Doppler effect observed on impurity lines. Notably, plasma rotation profiles were successfully derived from doubly charged carbon lines. In addition, the TS system enabled the first measurements of the electron temperature in commissioning plasmas on WHAM. These successes underscore the diagnostic package's potential for advancing experimental plasma studies."
  },
  {
    "title": "The Dublin Lens: A Cc=1.0 mm Objective Lens Intended for CryoEM at 100 keV",
    "abstract": "We have designed, fabricated and tested a lens with chromatic aberration coefficient (Cc) of 1.0 mm, a 4.0 mm pole-gap and 2.0 mm bore that is wide enough to accommodate an anti-contamination system and an objective aperture. This lens extends the temporal-coherence envelope of the electron microscope beyond 2 Angstrom, using a low-cost Schottky FEG. We hope that this lens design can be used to improve all 100 keV electron microscopes designed for single-particle electron cryomicroscopy (cryoEM)."
  },
  {
    "title": "EMU/GAMA: A new approach to characterising radio luminosity functions",
    "abstract": "This study characterises the radio luminosity functions (RLFs) for SFGs and AGN using statistical redshift estimation in the absence of comprehensive spectroscopic data. Sensitive radio surveys over large areas detect many sources with faint optical and infrared counterparts, for which redshifts and spectra are unavailable. This challenges our attempt to understand the population of radio sources. Statistical tools are often used to model parameters (such as redshift) as an alternative to observational data. Using the data from GAMA G23 and EMU early science observations, we explore simple statistical techniques to estimate the redshifts in order to measure the RLFs of the G23 radio sources as a whole and for SFGs and AGN separately. Redshifts and AGN/SFG classifications are assigned statistically for those radio sources without spectroscopic data. The calculated RLFs are compared with existing studies, and the results suggest that the RLFs match remarkably well for low redshift galaxies with an optical counterpart. We use a more realistic high redshift distribution to model the redshifts of (most likely) high redshift radio sources and find that the LFs from our approach match well with measured LFs. We also look at strategies to compare the RLFs of radio sources without an optical counterpart to existing studies."
  },
  {
    "title": "Coherent Spectroscopic Probes of Topology: A Velocity-Gauge Perspective",
    "abstract": "We present a velocity-gauge formalism for computing nonlinear current response functions in periodic systems and apply it to the Su-Schrieffer-Heeger (SSH) model as a minimal topological testbed. By retaining the full minimal coupling Hamiltonian and avoiding the rotating wave approximation, we construct gauge-consistent expressions for the linear and third-order current susceptibilities using retarded Green's functions. Our results reveal how nonlinear optical spectra encode not only energy-level transitions but also interband phase coherence and topological winding. In the topological phase, the third-order response exhibits characteristic phase inversions and spectral asymmetries that are absent in the trivial phase. These features reflect geometric changes in the Bloch eigenstates and highlight the role of virtual pathways in shaping the nonlinear signal. Our framework offers a robust and extensible platform for modeling nonlinear light-matter interactions in topological materials beyond the dipole approximation and the standard Coulomb-gauge formulation in molecular spectroscopy."
  },
  {
    "title": "Reconfigurable Integrated Photonic Chips as Dual-Purpose Neuromorphic Accelerators and Physical Unclonable Functions",
    "abstract": "In this work, we experimentally validate the dual use of a reconfigurable photonic integrated mesh as a neuromorphic accelerator, targeting signal equalization, and as a physical unclonable function offering authentication at the hardware level. The processing node is an optical spectrum slicing self-coherent transceiver targeting the mitigation of dispersion impairments of an intensity detected QPSK signal, after 25 km of transmission at 32 Gbaud. Unavoidable fabrication related imperfections of the nodes, such as waveguide roughness, can act as fingerprints of the device, and, during neuromorphic processing, result in unique weights at the digital back-end during signal equalization. Extracted security metrics offer low false positive/negative probability for the generated responses, confirming un-clonability, whereas bit-error-ratio for the QPSK equalization task was always below the hardware forward error correction limit. The experimental results substantiate the capability of the proposed scheme to simultaneously act as an accelerator and as a security token."
  },
  {
    "title": "FUOr-Aur 0544+3330: A New YSO Outburst in the Outskirts of Auriga OB1, Viewed Face-On",
    "abstract": "We present a newly appreciated FU Ori outburst event that began in 2019 and reached a peak in early 2021. Suspected young stellar object WISE J054452.25+333009.6 experienced substantial brightening, in excess of $-5$ mag at optical wavelengths and $-2.5$ mag at mid-infrared wavelengths. The time from near-quiescence to peak brightness was approximately 24 months. Optical and near-infrared spectra confirm that the outbursting source (hereby designated FUOr-Aur 0544+3330) shows all the hallmarks of the FU Ori class, including the Li I indicator of stellar youth. The mix of ionized and neutral atomic lines, alongside prominent molecular absorption features, is consistent with the expected change in spectral type from earlier in the optical to later-type in the near-infrared. The closest analog among well-studied FU Ori objects is V1515 Cyg. Both sources have unusually narrow-lined absorption spectra that can be explained by a face-on disk orientation, such that disk-broadening is minimized and wind-induced blueshift (in e.g. H$\\alpha$, NaD, Ca II) is maximized. Both the optical through infrared spectral energy distribution and high-resolution spectrum are well-fit by a pure-accretion disk model. Adopting a distance of $d=1.5$ kpc, the accretion and central star parameters are: $\\dot{M} = 10^{-5.48}$ $M_\\odot$ yr$^{-1}$, $M_* = 0.17 \\ M_\\odot$, and $R_\\mathrm{inner} = 1.04 \\ R_\\odot$. Other fitted values are disk inclination $i=5.9$ deg and source extinction $A_V=1.83$ mag. These parameters yield accretion luminosity $L_\\mathrm{acc} = 8.4\\ L_\\odot$ and maximum disk temperature $T_{\\rm{max}} = 6218$ K."
  },
  {
    "title": "Neuromorphic Imaging Flow Cytometry combined with Adaptive Recurrent Spiking Neural Networks",
    "abstract": "We present an experimental imaging flow cytometer using a 1 {\\mu}s temporal resolution event-based CMOS camera, with data processed by adaptive feedforward and recurrent spiking neural networks. Our study classifies PMMA particles (12, 16, 20 {\\mu}m) flowing at 0.7 m/s in a microfluidic channel. Processing of experimental data highlighted that spiking recurrent networks, including LSTM and GRU models, achieved 98.4% accuracy by leveraging temporal dependencies. Additionally, adaptation mechanisms in lightweight feedforward spiking networks improved accuracy by 4.3%. This work outlines a technological roadmap for neuromorphic-assisted biomedical applications, enhancing classification performance while maintaining low latency and sparsity."
  },
  {
    "title": "Theory of Quasi-Statically Screened Electron-Polar Optical Phonon Scattering",
    "abstract": "The scattering of electrons with polar optical phonons (POP) is an important mechanism that limits electronic transport and determines electron mobility in polar materials. This is typically a stronger mechanism compared to non-polar acoustic and optical phonon scattering, and of similar strength to the Coulomb ionized impurity scattering. At high densities, on the other hand, the cloud of charge carriers screens the dipoles that are responsible for POP scattering, and weakens the electron-POP scattering strength. However, in contrast to ionized impurity scattering, for which the well-known Brooks-Herring equation provides the scattering rates with the effect of screening included, for scattering with POP there is no such closed-form mathematical expression. In this work, we derive such an expression based on Fermi's Golden Rule, which would prove particularly useful in understanding electronic transport in complex crystal and complex band structure materials, in which electron-POP scattering could dominate electronic transport."
  },
  {
    "title": "Compactifying linear optical unitaries using multiport beamsplitters",
    "abstract": "We show that any $N$-dimensional unitary matrix can be realized using a finite sequence of concatenated identical multiport beamsplitters. Our construction is based on a Lie group theorem and is explicitly demonstrated for the two- and three-dimensional cases. We further establish that the widely used Clements decomposition naturally arises as a special case of this general framework. As an application, we present a reconfigurable linear optical circuit that implements a three-dimensional unitary emerging in the unambiguous discrimination of two nonorthogonal qubit states."
  },
  {
    "title": "Compact, Large-Scale Photonic Neurons by Modulation-and-Weight Microring Resonators",
    "abstract": "Fabrication imperfections, spatial constraints, and prohibitive costs collectively impede the scalability of neuromorphic photonics. In this work, we introduce a large-scale, compact photonic neuron in which each microring performs modulation and weighting simultaneously. This dual functionality is realized by leveraging both the carrier effect and thermal tunability, thereby merging modulation and weighting to conserve on-chip area, enhancing tuning efficiency, and capitalizing on wavelength-division multiplexing (WDM) for scalable implementations. In addition, we investigated a range of configurations for the proposed neuron to better tailor its behavior to various computational tasks. To illustrate the adaptability of the system's tasks, we explore both spatial and temporal domains, highlighting its versatility through two representative tasks: image processing and, for the first time, financial time series analysis, which represents a promising new frontier for neuromorphic photonics. These findings underscore the considerable promise of photonic computing in addressing a breadth of real-world challenges, particularly under escalating demands for both scalability and flexibility."
  },
  {
    "title": "Hong-Ou-Mandel interferometry with trapped polariton condensates",
    "abstract": "We investigate the indistinguishability of polaritons in optically trapped Bose Einstein condensates by implementing Hong-Ou-Mandel (HOM) interferometry and test the limitations of two-polariton interference in the coherent, limit-cycle and thermal statistical regimes. We observe that the HOM dynamics of a circularly polarized condensate follows the condensate coherence time with the characteristic HOM-dip approaching the classical limit. Linearly polarized condensates exhibit a combined effect of polariton bunching and two-polariton interference. Under elliptically polarized excitation, the temporal evolution of the spinor condensate results in the revival of the HOM-dip at the spinor Larmor precession frequency."
  },
  {
    "title": "Intriguing nature of AM Her type candidate CXOU J204734.8+300105",
    "abstract": "The detection and characterization of periodic X-ray signals are crucial for identifying new compact objects and studying the mechanisms powering their emission. We report on the timing and spectral variability of CXOU J204734.8+300105, a proposed eclipsing polar-type cataclysmic variable (CV) candidate. This source has been observed once with Chandra and twice with XMM-Newton, revealing several intriguing and conflicting features in its X-ray emission. The Chandra observation showed a periodicity of $\\sim$6000 s with an eclipse-like feature. The X-ray light curve from 2017 XMM-Newton observation showed a period of $\\sim$2000 seconds without any apparent eclipse, while the simultaneous optical light curve from OM showed a period of $\\sim$6000 seconds. This variability raises questions about the true nature of the source. Spectral analysis indicates a multi-component emission and emission lines due to Fe. The spectral characteristics are consistent with those observed in other CV systems. Additionally, we identified optical and near-infrared counterparts from various catalogues. Our findings suggest a dynamic and evolving accretion environment of CXOU J204734.8+300105."
  },
  {
    "title": "Unveiling the origin of the optical and UV emission during the 2017 giant outburst of the Galactic ULX pulsar Swift J0243.6+6124 (Corrigendum)",
    "abstract": "An error was detected in the code of one of the components considered to model the optical/UV emission of the Galactic ULX pulsar Swift J0243.6+6124 during its 2017 giant outburst. This led to an overestimation of the contribution from the X-ray heated surface of the Be star. The addition of the X-ray irradiation of a misaligned Be disk to our model is proposed to explain the observations. Preliminary results of the updated model provide good fit to the data."
  },
  {
    "title": "Wave turbulence, thermalization and multimode locking in optical fibers",
    "abstract": "We present a comprehensive overview of recent advances in theory and experiments on complex light propagation phenomena in nonlinear multimode fibers. On the basis of the wave turbulence theory, we derive kinetic equations describing the out-of-equilibrium process of optical thermalization toward the Rayleigh-Jeans (RJ) equilibrium distribution. Our theory explains the effect of beam self-cleaning (BSC) in graded-index (GRIN) fibers, whereby a speckled beam transforms into a bell-shaped beam at the fiber output. We theoretically explore the role of random refractive index fluctuations along the fiber, and show how these imperfections can assist the observation of BSC in a practical experimental setting. This conclusion is supported by the derivation of wave turbulence kinetic equations that account for the presence of a time-dependent disorder (random mode coupling). The kinetic theory reveals that a weak disorder accelerates the rate of RJ thermalization and condensation. On the other hand, although strong disorder is expected to suppress wave condensation, the kinetic equation reveals that an out-of-equilibrium process of condensation and RJ thermalization can still occur. The kinetic equations are validated by numerical simulations of the nonlinear Schrodinger equation. We outline a series of recent experiments, which permit to confirm the statistical mechanics approach for describing beam propagation and thermalization. For example, we highlight the demonstration of entropy growth, and point out that there are inherent limits to peak-power scaling in multimode fiber lasers. We conclude by pointing out the experimental observation that BSC is accompanied by an effect of modal phase-locking. From the one hand this explains the observed preservation of the spatial coherence of the beam, but also it points to the need of extending current descriptions in future research."
  },
  {
    "title": "Dimensionality-dependent electronic and vibrational dynamics in low-dimensional organic-inorganic tin halides",
    "abstract": "Photo-induced dynamics of electronic processes in materials are driven by the coupling between electronic and nuclear degrees of freedom. Here we construct 1D and 2D organic-inorganic tin halides to investigate the functional role of dimensionality to exciton-phonon coupling (EPC) and exciton self-trapping. The results show that the 1D system has strong EPC leading to excitation-independent self-trapped exciton (STE) emission, while the 2D system exhibits over ten times weaker EPC resulting in free exciton emission. By performing femtosecond transient absorption experiments, we directly resolve the room-temperature vibrational wavepackets in the 1D system, some of which propagate along the STE potential energy surface. A combination of wagging and asymmetric stretching motions (~106 cm-1) in tin iodide is identified as such a mode inducing exciton self-trapping. While no room-temperature wavepackets are observed in the 2D system. These findings uncover the interplay between the dimensionality-dependent EPC and electronic/nuclear dynamics, offering constructive guidance to develop multifunctional organic-inorganic metal halides."
  },
  {
    "title": "Anisotropic magnetic phase diagrams, tricriticality, and spin-reorientation in high-pressure grown SmCrO$_3$ single crystals",
    "abstract": "SmCrO$_3$ single crystals were successfully grown utilizing the high-pressure optical floating-zone method and their crystal structure, magnetization behavior, and magnetic phase diagrams were thoroughly investigated. Magnetic studies were conducted for fields applied along all principal crystallographic directions, with measurements taken at temperatures as low as 0.4 K and magnetic fields up to 14 T. The single crystal growth parameters are reported and the orthorhombic structure with the centrosymmetric space group $Pbnm$ is confirmed. Long-range order of the Cr$^{3+}$ and Sm$^{3+}$ magnetic sublattices evolves at $T_{\\rm N}$ = 192 K and $T_{\\rm N2}$=3 K, respectively. In contrast to previous studies on polycrystals our single crystal data imply a discontinuous and one-step spin-reorientation (SR) of net magnetic moments $\\tilde{M}$ from the $c$ axis into the $ab$ plane at zero magnetic field at $T_{\\rm SR}$=33 K. Its discontinuous nature is maintained if $B$ is applied $||c$ axis but tricritical behavior and a triple point is found for $B||a$ axis. While our data are consistent with the magnetic representation $\\Gamma_4$ for $T > T_{\\mathrm {SR}}$, the size and in-plane direction of the observed net magnetic moment disagree to previously proposed spin configurations, i.e., $\\Gamma_1$ and $\\Gamma_2$, for the spin-reoriented phases. In general, our high-quality single crystals enable us to revisit the phase diagram and to clarify the complex magnetism in SmCrO3 arising from the interplay of anisotropic 3$d$ and 4$f$ magnetic sublattices."
  },
  {
    "title": "Nitrogen-vacancy centre in lonsdaleite: a novel nanoscale sensor?",
    "abstract": "Hexagonal diamond, often called lonsdaleite, is an exotic allotrope of carbon, predicted to be harder than cubic (conventional) diamond with a wider bandgap. Due to its pure sp$^3$ bonded lattice, it should be expected to host sub-bandgap defect centres (colour centres). Here we perform \\textit{ab initio} modeling of nitrogen-vacancy (NV) colour centres in hexagonal diamond nanocrystals; for both the neutral and negatively charged species (NV$^0$ and NV$^-$). We identify three distinct configurations for the NV center: two of which are analogous to NV in diamond, and one which is a configuration that can only exist in the hexagonal form. The diamond-like NV systems comprise three symmetry equivalent centers which reside on the same carbon plane, and one defect that is split across two planes and replaces a carbon-carbon bond. There is an additional NV centre where the N and V each have four nearest neighbour carbon atoms. The presence of this latter configuration would provide an unambiguous determination of the hexagonal nature of lonsdaleite. Quantum chemical analysis show all derivatives to be thermochemically stable, and each with their own unique photophysical properties, spectral profiles, and magneto-optical characteristics. By assuming that the ground state properties of the NV$^-$ in hexagonal diamond are comparable to those of NV$^-$ in cubic diamond, albeit with increased strain, we predict ground state fine structure splitting for two of the centres of 2.74~GHz and 4.56~MHz, compared with 2.87~GHz for cubic diamond. The possibility of optically detected magnetic resonance with NV$^-$ in lonsdaleite would provide a new carbon-based quantum sensing system, and an unambiguous method to resolve outstanding issues around the structure of lonsdaleite as hexagonal diamond."
  },
  {
    "title": "Low-Resource Language Processing: An OCR-Driven Summarization and Translation Pipeline",
    "abstract": "This paper presents an end-to-end suite for multilingual information extraction and processing from image-based documents. The system uses Optical Character Recognition (Tesseract) to extract text in languages such as English, Hindi, and Tamil, and then a pipeline involving large language model APIs (Gemini) for cross-lingual translation, abstractive summarization, and re-translation into a target language. Additional modules add sentiment analysis (TensorFlow), topic classification (Transformers), and date extraction (Regex) for better document comprehension. Made available in an accessible Gradio interface, the current research shows a real-world application of libraries, models, and APIs to close the language gap and enhance access to information in image media across different linguistic environments"
  },
  {
    "title": "Development of an achromatic spectrometer for a laser-wakefield-accelerator experiment",
    "abstract": "The large gradients of plasma-wakefield accelerators promise to shorten accelerators and reduce their financial and environmental costs. For such accelerators, a key challenge is the transport of beams with high divergence and energy spread. Achromatic optics is a potential solution that would allow staging of plasma accelerators without beam-quality degradation. For this, a nonlinear plasma lens is being developed within the SPARTA project. As a first application of this lens, we aim to implement an achromatic spectrometer for electron bunches produced by a laser-wakefield accelerator. This will greatly improve the resolution across the typically one to tens of percent energy spread bunches and therefore help diagnosis and optimization of the plasma interaction. We report on progress in designing such an experiment."
  },
  {
    "title": "Planar Velocity Estimation for Fast-Moving Mobile Robots Using Event-Based Optical Flow",
    "abstract": "Accurate velocity estimation is critical in mobile robotics, particularly for driver assistance systems and autonomous driving. Wheel odometry fused with Inertial Measurement Unit (IMU) data is a widely used method for velocity estimation; however, it typically requires strong assumptions, such as non-slip steering, or complex vehicle dynamics models that do not hold under varying environmental conditions like slippery surfaces. We introduce an approach to velocity estimation that is decoupled from wheel-to-surface traction assumptions by leveraging planar kinematics in combination with optical flow from event cameras pointed perpendicularly at the ground. The asynchronous micro-second latency and high dynamic range of event cameras make them highly robust to motion blur, a common challenge in vision-based perception techniques for autonomous driving. The proposed method is evaluated through in-field experiments on a 1:10 scale autonomous racing platform and compared to precise motion capture data, demonstrating not only performance on par with the state-of-the-art Event-VIO method but also a 38.3 % improvement in lateral error. Qualitative experiments at highway speeds of up to 32 m/s further confirm the effectiveness of our approach, indicating significant potential for real-world deployment."
  },
  {
    "title": "Directional transport and nonlinear localization of light in a one-dimensional driven-dissipative photonic lattice",
    "abstract": "Photonic lattices facilitate band structure engineering, supporting both localized and extended modes through their geometric design. However, greater control over these modes can be achieved by taking advantage of the interference effect between external drives with precisely tuned phases and photonic modes within the lattice. In this work, we build on this principle to demonstrate optical switching, directed light propagation and site-specific localization in a one-dimensional photonic lattice of coupled microresonators by resonantly driving the system with a coherent field of controlled phase. Importantly, our experimental results provide direct evidence that increased driving power acts as a tuning parameter enabling nonlinear localization at frequencies previously inaccessible in the linear regime. These findings open new avenues for controlling light propagation and localization in lattices with more elaborate band structures."
  },
  {
    "title": "Analytical Fidelity Calculations for Photonic Linear Cluster State Generation",
    "abstract": "By precisely timed optical excitation of their spin, optical emitters such as semiconductor quantum dots or atoms can be harnessed as sources of linear photonic cluster states. This significantly reduces the required resource overhead to reach fault-tolerant optical quantum computing. Here, we develop an algorithm that analytically tracks the global density matrix through the process of the protocol for generating linear-cluster states by Lindner and Rudolph. From this we derive a model to calculate the entangling gate fidelity and the state fidelity of the generated linear optical cluster states. Our model factors in various sources of error, such as spin decoherence and the finite excited state lifetime. Additionally, we highlight the presence of partial reinitialization of spin coherence with each photon emission, eliminating the hard limitation of coherence time. Our framework provides valuable insight into the cost-to-improvement trade-offs for device design parameters as well as the identification of optimal working points. For a combined state-of-the-art quantum dot with a spin coherence time of T_2^*=535 ns and an excited state lifetime of {\\tau}=23 ps, we show that a near-unity entangling gate fidelity as well as near-unity state fidelity for 3-photon and 7-photon linear cluster states can be reached."
  },
  {
    "title": "Purcell enhanced and tunable single-photon emission at telecom wavelengths from InAs quantum dots in circular photonic crystal resonators",
    "abstract": "Embedding semiconductor quantum dots into bullseye resonators has significantly advanced the development of bright telecom quantum light sources for fiber-based quantum networks. To further improve the device flexibility and stability, the bullseye approach should be combined with a pin diode structure to enable Stark tuning, deterministic charging, and enhanced coherence. In this work, we fabricate and characterize photonic structures incorporating hole gratings that efficiently support charge carrier transport while maintaining excellent optical performance. We report bright, Purcell-enhanced single-photon emission in the telecom C-band under above-band and phonon-assisted excitation. Additionally, we present electrically contacted resonators, demonstrating wide range tuneability of quantum dot transitions in the telecom O-band. These results mark significant steps toward scalable and tunable quantum light sources for real-world quantum photonic applications."
  },
  {
    "title": "Automated quasar continuum estimation using neural networks: a comparative study of deep-learning architectures",
    "abstract": "Context. Ongoing and upcoming large spectroscopic surveys are drastically increasing the number of observed quasar spectra, requiring the development of fast and accurate automated methods to estimate spectral continua. Aims. This study evaluates the performance of three neural networks (NN) - an autoencoder, a convolutional NN (CNN), and a U-Net - in predicting quasar continua within the rest-frame wavelength range of $1020~\\text{\\AA}$ to $2000~\\text{\\AA}$. The ability to generalize and predict galaxy continua within the range of $3500~\\text{\\AA}$ to $5500~\\text{\\AA}$ is also tested. Methods. The performance of these architectures is evaluated using the absolute fractional flux error (AFFE) on a library of mock quasar spectra for the WEAVE survey, and on real data from the Early Data Release observations of the Dark Energy Spectroscopic Instrument (DESI) and the VIMOS Public Extragalactic Redshift Survey (VIPERS). Results. The autoencoder outperforms the U-Net, achieving a median AFFE of 0.009 for quasars. The best model also effectively recovers the Ly$\\alpha$ optical depth evolution in DESI quasar spectra. With minimal optimization, the same architectures can be generalized to the galaxy case, with the autoencoder reaching a median AFFE of 0.014 and reproducing the D4000n break in DESI and VIPERS galaxies."
  },
  {
    "title": "Collective excited states at small amplitude in neutron elastic scattering at low-energies",
    "abstract": "We investigate the contributions of isoscalar and isovector collective excitations in the neutron elastic scattering of $^{16}$O, $^{40}$Ca, $^{48}$Ca, and $^{208}$Pb nuclei by using a microscopic optical potential (MOP) derived from nuclear structure models based on self-consistent mean-field approaches. Particular attention is given to the role of these collective modes in shaping the imaginary part of the MOP and the resulting angular distributions. Our analysis indicates that both isoscalar and isovector contributions are significant for all considered targets, especially for light and medium targets. Furthermore, the Coulomb interaction is found to play an important role in describing absorption mechanisms and reproducing the experimental angular distributions."
  },
  {
    "title": "Multi-channel electrically tunable varifocal metalens with compact multilayer polarization-dependent metasurfaces and liquid crystals",
    "abstract": "As an essential module of optical systems, varifocal lens usually consists of multiple mechanically moving lenses along the optical axis. The recent development of metasurfaces with tunable functionalities holds the promise of miniaturizing varifocal lens. However, existing varifocal metalenses are hard to combine electrical tunability with scalable number and range of focal lengths, thus limiting the practical applications. Our previous work shows that the electrically tunable channels could be increased to 2N by cascading N polarization-dependent metasurfaces with liquid crystals (LCs). Here, we demonstrated a compact eight-channel electrically tunable varifocal metalens with three single-layer polarization-multiplexed bi-focal metalens and three LC cells. The total thickness of the device is ~6 mm, while the focal lengths could be switched among eight values within the range of 3.6 to 9.6 mm. The scheme is scalable in number and range of focal lengths and readily for further miniaturization. We believe that our proposal would open new possibilities of miniaturized imaging systems, AR/VR displays, LiDAR, etc."
  },
  {
    "title": "Polarimetric insights into a potential binary supermassive black hole system in Mrk 231",
    "abstract": "Markarian 231 (Mrk 231) is one of the brightest ultraluminous infrared galaxies (ULIRGs) known to date. It displays a unique optical-UV spectrum, characterized by a strong and perplexing attenuation in the near-UV, associated with a sudden polarization peak. Building on previous spectro-photometric modeling, we investigated the hypothesis that the core of Mrk 231 may host a binary SMBH system. In this scenario, the accretion disk of the primary, more massive SMBH is responsible for the optical-UV spectrum. The disk of the secondary, less massive SMBH, would be expected to essentially emit in the far UV. We applied this model to archival photometric and polarimetric data of Mrk 231 and tried to obtain the best fit possible. To support our findings, we performed radiative transfer calculations to determine the spatial disposition of each main component constituting Mrk 231. We find that a binary SMBH model can reproduce both the observed flux and polarization of Mrk 231 remarkably well. We infer that the core potentially hosts a binary SMBH system, with a primary SMBH of about 1.6x10^8 solar masses and a secondary of about 1.1x10^7 solar masses , separated by a semimajor axis of 146 AU.The secondary SMBH drives a degree of polarization of 3 % between 0.1 and 0.2 {\\mu}m, with a corresponding polarization position angle of about 134{\\deg} , which is consistent with scattering within an accretion disk. The primary SMBH and the structure around it are responsible for a degree of polarization of 23 % between 0.3 and 0.4 {\\mu}m with a corresponding polarization position angle of about 96{\\deg} , that is possibly attributed to scattering within the quasar's wind. Finally, our model predicts the existence of a second peak in polarized flux in the far-ultraviolet, a telltale signature that could definitively prove the presence of a binary SMBH."
  },
  {
    "title": "M4-SAR: A Multi-Resolution, Multi-Polarization, Multi-Scene, Multi-Source Dataset and Benchmark for Optical-SAR Fusion Object Detection",
    "abstract": "Single-source remote sensing object detection using optical or SAR images struggles in complex environments. Optical images offer rich textural details but are often affected by low-light, cloud-obscured, or low-resolution conditions, reducing the detection performance. SAR images are robust to weather, but suffer from speckle noise and limited semantic expressiveness. Optical and SAR images provide complementary advantages, and fusing them can significantly improve the detection accuracy. However, progress in this field is hindered by the lack of large-scale, standardized datasets. To address these challenges, we propose the first comprehensive dataset for optical-SAR fusion object detection, named Multi-resolution, Multi-polarization, Multi-scene, Multi-source SAR dataset (M4-SAR). It contains 112,184 precisely aligned image pairs and nearly one million labeled instances with arbitrary orientations, spanning six key categories. To enable standardized evaluation, we develop a unified benchmarking toolkit that integrates six state-of-the-art multi-source fusion methods. Furthermore, we propose E2E-OSDet, a novel end-to-end multi-source fusion detection framework that mitigates cross-domain discrepancies and establishes a robust baseline for future studies. Extensive experiments on M4-SAR demonstrate that fusing optical and SAR data can improve $mAP$ by 5.7\\% over single-source inputs, with particularly significant gains in complex environments. The dataset and code are publicly available at https://github.com/wchao0601/M4-SAR."
  },
  {
    "title": "Effects of Coupling Between Chiral Vibrations and Spins in Molecular Magnets",
    "abstract": "In single molecular magnets, chiral vibrations carrying vibrational angular momentum ($\\hat{L}^{\\text{vib}}$) emerge due to the splitting of a doubly degenerate vibrational mode. Here, we identify a new type of effective spin-vibrational coupling responsible for lifting this degeneracy, which can facilitate optically selective excitations. In the presence of an external Zeeman field, this coupling breaks both inversion (in-plane parity) $\\mathcal{P}$ and time-reversal $\\mathcal{T}$ symmetries, imparting distinct geometric phases to the resulting dressed spin-vibronic states. The wave function of the spin-vibronic state is characterized by a $\\pi$-Berry phase, which results in magneto-optical circular dichroism. This framework is validated using density functional theory and multi-reference \\emph{ab initio} calculations on the Ce(trenovan) molecular magnet."
  },
  {
    "title": "Digital quantum simulation of squeezed states via enhanced bosonic encoding in a superconducting quantum processor",
    "abstract": "We present a fully digital approach for simulating single-mode squeezed states on a superconducting quantum processor using an enhanced bosonic encoding strategy. By mapping up to 2^{n} photonic Fock states onto n qubits, our framework leverages Gray-code-based encodings to reduce gate overhead compared to conventional one-hot or binary mappings. We further optimize resource usage by restricting the simulation on Fock states with even number of photons only, effectively doubling the range of photon numbers that can be represented for a given number of qubits. To overcome noise and finite coherence in current hardware, we employ a variational quantum simulation protocol, which adapts shallow, parameterized circuits through iterative optimization. Implemented on the Zuchongzhi-2 superconducting platform, our method demonstrates squeezed-state dynamics across a parameter sweep from vacuum state preparation (r=0) to squeezing levels exceeding the Fock space truncation limit (r>1.63). Experimental results, corroborated by quantum state tomography and Wigner-function analysis, confirm high-fidelity state preparation and demonstrate the potential of Gray-code-inspired techniques for realizing continuous-variable physics on near-term, qubit-based quantum processors."
  },
  {
    "title": "Exploring the Interplay Between Formation Mechanisms and Luminescence of Lignin Carbon Quantum Dots from Spruce Biomass",
    "abstract": "This study investigates the intricate relationship between the formation mechanisms and luminescent properties of lignin-derived carbon quantum dots (LG-CQDs) synthesized from spruce biomass by hydrothermal treatment. A comprehensive understanding of LG-CQD structure and its photoluminescence requires insights into the native architecture of lignin and the distribution of its acidolysis-derived fragments. Research showed how these lignin-derived units interact with dopant molecules in three different approaches during synthesis, contributing to core and surface structures that govern the optical behavior. Our findings reveal a clear correlation between structural features and luminescent properties, emphasizing the role of surface chemistry in tuning emission characteristics. These insights provide a foundation for the rational design of LG-CQDs with tailored luminescent properties, advancing their potential applications in sustainable optoelectronics, sensing, and bioimaging."
  },
  {
    "title": "Tracking Low-Level Cloud Systems with Topology",
    "abstract": "Low-level clouds are ubiquitous in Earth's atmosphere, playing a crucial role in transporting heat, moisture, and momentum across the planet. Their evolution and interaction with other atmospheric components, such as aerosols, are essential to understanding the climate system and its sensitivity to anthropogenic influences. Advanced high-resolution geostationary satellites now resolve cloud systems with greater accuracy, establishing cloud tracking as a vital research area for studying their spatiotemporal dynamics. It enables disentangling advective and convective components driving cloud evolution. This, in turn, provides deeper insights into the structure and lifecycle of low-level cloud systems and the atmospheric processes they govern. In this paper, we propose a novel framework for tracking cloud systems using topology-driven techniques based on optimal transport. We first obtain a set of anchor points for the cloud systems based on the merge tree of the cloud optical depth field. We then apply topology-driven probabilistic feature tracking of these anchor points to guide the tracking of cloud systems. We demonstrate the utility of our framework by tracking clouds over the ocean and land to test for systematic differences in the two physically distinct settings. We further evaluate our framework through case studies and statistical analyses, comparing it against two leading cloud tracking tools and two topology-based general-purpose tracking tools. The results demonstrate that incorporating system-based tracking improves the ability to capture the evolution of low-level clouds. Our framework paves the way for detailed low-level cloud characterization studies using satellite data records."
  },
  {
    "title": "Spectral Biases, Starspot Morphology, and Dynamo Transitions on the Pre-Main Sequence: Insights from the X-Shooter WTTS Library",
    "abstract": "Starspots are ubiquitous in young, low mass stars, yet their impact on the spectral classification and fundamental parameter inference of pre main sequence stars has been largely overlooked. In this study, we demonstrate that cool starspots systematically distort spectral morphology and bias derived effective temperatures, surface gravities, and luminosities in non accreting Weak Lined T Tauri Stars (WTTS). Using a sample of 56 WTTS with high resolution, broad band X-Shooter spectra, we perform two temperature spectral fits that explicitly account for spot coverage and temperature contrast. These composite models consistently outperform traditional single temperature fits, particularly in the 3350 4000 K regime, where spot contributions dominate the red optical and near infrared flux. Moreover, we propose that surface gravity discrepancies between optical and infrared measurements are a natural consequence of spot dominated emission in PMS stars that is accentuated by observational uncertainty. We find that single temperature models can overestimate effective temperatures by up to 700 K and underestimate log g by 1-2 dex. Using spot-corrected effective temperatures, we derive masses and ages from traditional, magnetic, and spotted evolutionary models, finding that spot corrections systematically raise inferred masses by up to 80 percent and stellar ages by up to 0.5 dex. These discrepancies are strongest for stars in the 0.3 to 0.8 solar mass range. Using starspots as a proxy for magnetic topology, we find evidence that a shift from largely axisymmetric to non axisymmetric magnetic fields dominated by small scale structures coincides with the formation of a radiative core during the pre main sequence, effectively separating convective and interface dynamo regimes."
  },
  {
    "title": "Frequency and Abundance of Binary sUpermassive bLack holes from Optical Variability Surveys (FABULOVS): Hubble Space Telescope Imaging of Radial-Velocity Selected Binary Candidates",
    "abstract": "Sub-parsec (sub-pc) binary supermassive black holes (BSBHs) should be common from galaxy mergers, yet direct evidence has been elusive. We present HST/WFC3IR F160W imaging for a sample of 8 candidate sub-pc BSBHs at redshifts z~0.1--0.5, as well as cross-comparison with a sample of ordinary quasars with archival HST/WFC3 IR F160W images. These 8 candidate sub-pc BSBHs were identified from multi-epoch spectroscopic surveys of quasars (including both typical quasars and those with single-peaked velocity-offset broad lines). whose broad H$\\beta$ lines are significantly offset (by ~< a few hundred km/s) from the systemic redshifts. We directly test the prediction that the host galaxies of BSBHs would have a higher fraction of disturbed morphologies and younger stellar bulges from recent interactions than those of control quasars. After careful subtraction of the central quasar light, our candidate BSBH hosts show a statistically undifferentiated distribution of host asymmetry, indicative of a similar fraction of recent mergers. While a significantly larger sample is needed to place this result on a much firmer statistical ground, it opens questions as to the timescale differences between galaxy merger and BSBH formation, or the efficacy of the radial-velocity-shift--based selection of sub-pc BSBH candidates."
  },
  {
    "title": "Quantifying the advantage of quantum correlation microscopy using arrays of single-photon detectors",
    "abstract": "Quantum correlation microscopy is an emerging technique for improving optical resolution. By taking advantage of the quantum statistics from single-photon fluorophores, more information about the emitters (including number and location) is obtained compared with classical microscopy. Although it is known that the resolution can be improved by increasing detector numbers, as well as using quantum correlation, the quantitative relationship between these two approaches is not immediately clear. Here we explore widefield quantum correlation microscopy using arrays of single-photon detectors. We explicitly compare the use of $N$ detectors used in photon counting mode vs $N/2$ detectors used to measure quantum correlations. i.e., where there are $N/2$ Hanbury Brown and Twiss systems, using the same $N$ detectors, on randomly generated two-emitter systems. We find regimes where $N/2$ Hanbury Brown and Twiss detectors provide improved localisation compared to $N$ photon counting detectors, as a function of emitter position and number of photons sampled."
  },
  {
    "title": "Single Vanadium Dioxide Nanoparticle-Enabled Plasmonic switch with Thermal and Electronic Reconfigurability",
    "abstract": "We present an integrated switch that combines plasmonic and neuromorphic technologies with a single sub-stoichiometric VO2-x nanoparticle. The presented device acts as a versatile plasmonic switch with dual thermal and electrical reconfigurability leveraging the near-room temperature phase transition of the VO2-x nanoparticles combined with the rapid phase recovery to drive the device. The change in both the optical and electrical properties of the VO2-x nanoparticle enables simultaneous optical and electrical readouts making the plasmonic device suitable as a phase change memory cell which is crucial in the convergence of computing and communication technologies. Our demonstration of reversible electrical switching, evidenced by a 6dB modulation depth and concurrent optical and electrical outputs, signifies a major stride in merging electronic and photonic functionalities within phase-change material devices. This novel strategy not only harmonizes optical communication with electronic computing but also advances the development of sophisticated integrated neuromorphic devices."
  },
  {
    "title": "Low-loss Sb2S3 Optical Phase Shifter Enabled by Optimizing Sputtering Conditions",
    "abstract": "By quantitatively evaluating the atomic concentrations of sputtered Sb2S3 films with different sputtering powers and Ar flows, we reveal that a sputtered Sb2S3 film becomes close to the stoichiometric composition as the sputtering power and Ar flow decrease. We characterize the optical properties of Sb2S3 and show that the lower sputtering power leads to a better figure of merit of Sb2S3 as an optical phase shifter in the near infrared (NIR) range. Based on these results, we achieve a loss per phase shift of 0.33 dB/{\\pi} at a wavelength of 1.55 {\\mu}m, one of the lowest losses among Sb2S3 phase shifters in the NIR range."
  },
  {
    "title": "New generation of cavity microscope for quantum simulations",
    "abstract": "We present the design and assembly of a cavity microscope for quantum simulations with ultracold atoms. The system integrates a high-finesse optical cavity with a pair of high-numerical aperture lenses sharing a common optical axis, enabling simultaneous operation with light close-to-atomic resonance. The system keeps the advantages of a rigid, single-block structure holding the lenses and cavity together, and improves over existing designs by using most of the solid angle left free by the cavity mode for imaging and atomic manipulation purposes. The cavity has a length of $19.786$mm, a finesse of $2.35\\times 10^4$ and operates $214\\mu\\text{m}$ away from the concentric limit, deep in the strong coupling regime. The two lenses offer a numerical aperture of $0.52$ each and maximal optical access in all directions transverse to the cavity axis, compatible with applications in quantum-gas microscopes, micro-tweezer arrays or few-fermions systems, as well as future cavity-assisted quantum simulation protocols demanding sub-cavity-mode control of the atom-cavity coupling."
  },
  {
    "title": "First JWST/NIRSpec Spectroscopy of O Stars in the Small Magellanic Cloud",
    "abstract": "Determining how much mass is removed by stellar winds is crucial to understanding massive star evolution and feedback. However, traditional spectroscopic diagnostics in the UV and optical are not sensitive enough to characterize weak stellar winds of OB stars in low-metallicity environments. A new tool to access weak stellar winds is provided by spectroscopy in the infrared (IR). Stellar atmosphere models indicate that the hydrogen Br$\\alpha$ line at $\\lambda$\\,4.05\\,$\\mu$m is a useful mass-loss rate indicator, particularly at low metallicity. The unprecedented capabilities of the NIRSpec spectrograph on board of the \\emph{James Webb Space Telescope} (JWST) allow us to measure this line in spectra of massive stars in other galaxies. In this work, we present the first NIRSpec spectra of O-type stars in the Small Magellanic Cloud (SMC), which has a metallicity of only 20\\% Solar. Our sample consists of thirteen stars with spectral types ranging from O2 to O9.5 including supergiants, giants, and dwarfs. The stars belong to NGC\\,346, the most massive young cluster in the SMC. We describe the observing strategy and data reduction, highlighting the treatment of the nebular background emission. The spectra cover the 2.8--5.1 $\\mu$m wavelength range, and we detect the Br$\\alpha$ line in emission in each of our sample stars. Using a combination of spectral and photometric data ranging from the UV to the IR, we improve the measurements of stellar luminosity and reddening. A first qualitative comparison of the observed Br$\\alpha$ line with stellar atmosphere models shows its potential as a wind diagnostic for weak-winded stars."
  },
  {
    "title": "Dichroic Filter Characterizations",
    "abstract": "We present here measurements and characterizations of several dichroic filters, which are being used more commonly in nuclear and particle physics for photon-detection. The measurements were performed on filters immersed in several media: air, water, and LAB-based liquid scintillator. Measurements of transmission and reflection properties were made at various angles of incidence, and the data presented here can be used to develop detailed optical models for detector simulations. We find a modified Bragg's Law is a good model for the shift in transmission edge as a function of angle of incidence, across the various media."
  },
  {
    "title": "TartanGround: A Large-Scale Dataset for Ground Robot Perception and Navigation",
    "abstract": "We present TartanGround, a large-scale, multi-modal dataset to advance the perception and autonomy of ground robots operating in diverse environments. This dataset, collected in various photorealistic simulation environments includes multiple RGB stereo cameras for 360-degree coverage, along with depth, optical flow, stereo disparity, LiDAR point clouds, ground truth poses, semantic segmented images, and occupancy maps with semantic labels. Data is collected using an integrated automatic pipeline, which generates trajectories mimicking the motion patterns of various ground robot platforms, including wheeled and legged robots. We collect 910 trajectories across 70 environments, resulting in 1.5 million samples. Evaluations on occupancy prediction and SLAM tasks reveal that state-of-the-art methods trained on existing datasets struggle to generalize across diverse scenes. TartanGround can serve as a testbed for training and evaluation of a broad range of learning-based tasks, including occupancy prediction, SLAM, neural scene representation, perception-based navigation, and more, enabling advancements in robotic perception and autonomy towards achieving robust models generalizable to more diverse scenarios. The dataset and codebase for data collection will be made publicly available upon acceptance. Webpage: https://tartanair.org/tartanground"
  },
  {
    "title": "Enhanced energy gain through higher-order resonances during direct laser acceleration with superluminal phase velocity",
    "abstract": "Ultra-high intensity laser-plasma interactions can produce ultra-relativistic electrons via direct laser acceleration, assisted by quasi-static plasma magnetic and electric fields. These fields transversely confine electron motion and induce betatron oscillations. The net energy gain is strongly influenced by the interplay between two frequencies: the betatron frequency and the frequency of laser field oscillations experienced by the electron. Prior work has shown that energy gain is enabled by a resonance between the betatron oscillations and the oscillations of the laser field. In particular, higher-order resonances occur when the laser field completes multiple cycles during one betatron oscillation, allowing additional regimes of energy transfer beyond the fundamental (betatron) resonance. In this work, we demonstrate that such resonances become particularly effective when the laser's phase velocity is superluminal. Although the two frequencies generally evolve differently with increasing electron energy, which leads to detuning, a superluminal phase velocity introduces a non-monotonic frequency ratio with a global minimum. This minimum allows sustained frequency matching over a broad energy range, thereby enabling enhanced energy gain. As the phase velocity increases, the betatron resonance becomes ineffective due to premature frequency detuning. At the same time, higher-order resonances become increasingly effective, emerging as the dominant mechanisms for enhanced energy gain in this regime of direct laser acceleration."
  },
  {
    "title": "Plasmonic Nanoparticle-in-nanoslit Antenna as Independently Tunable Dual-Resonant Systems for Efficient Frequency Upconversion",
    "abstract": "Dual-band plasmonic nanoantennas, exhibiting two widely separated user-defined resonances, are fundamental building blocks for the investigation and optimization of plasmon-enhanced optical phenomena, including photoluminescence, Raman scattering, and various nonlinear effects such as harmonic generation or sum-frequency generation, parametric down-conversion, etc. The nanoparticle-in-slit (NPiS) or nanoparticle-in-groove (NPiG) is a recently proposed dual-band antenna with independently tunable resonances at mid-infrared and visible wavelengths. It was used to enhance the corresponding sum- and difference-frequency generation processes from optimally located molecules by an estimated $10^{13}$-fold. However, the theoretical understanding of such structures and their eigenmodes remains poor, hindering further optimization and limiting broader applications. Here, we explore a diverse range of nanocavity-like quasi-normal modes (QNMs) supported by NPiS structures, examining the contributions of both their near-field (i.e., giant photonic density of states) and far-field (i.e., spatial radiation patterns) characteristics to frequency upconversion. We identify methods for independently tuning the visible and mid-infrared resonances while conserving a good mode overlap in the near field, which is essential for efficient nonlinear processes. Moreover, through mode analysis, we unveil an experimentally unexplored fundamental resonance with greater field enhancement and much-improved mode overlap with the mid-infrared field, which could, in principle, further boost the mid-infrared upconversion efficiency by 5-fold compared to existing results. This work helps to rationalize and optimize the enhancement of nonlinear effects across a wide spectral range using a flexible and experimentally attractive nanoplasmonic platform."
  },
  {
    "title": "Flat band mediated photon-photon interactions in 2D waveguide QED networks",
    "abstract": "We investigate a Lieb lattice of quantum emitters coupled to a two-dimensional waveguide network and demonstrate that this system supports an energetically isolated flat band, enabling localization despite the presence of long-range photon-mediated couplings. We then explore the two-excitation dynamics in both the softcore and hardcore interaction regimes, which arise from the nonlinearity of the emitters. In the softcore regime, we observe interaction-induced photon transport within the flat band, mediated by the formation of bound photon pairs. In the hardcore regime, corresponding to the two-level atom limit, we instead find the emergence of metastable exciton-like dressed states involving both flat and dispersive bands. Our findings highlight how the interplay between the collective behavior of emitters and effective photon-photon interactions can provide a platform for studying highly correlated photonic states in flat-band systems."
  },
  {
    "title": "Is diamagnetism really acausal?",
    "abstract": "Diamagnetism, in which the magnetisation in a medium opposes the direction of an applied magnetic field, is a weak but familiar effect in a wide class of materials. Being weak it is also a linear response to any applied field. The problem is that the existence of diamagnetism is in direct conflict with the requirements of causality as embodied in the familiar Kramers-Kronig relations. Nature does not care about our confusion and diamagnetism exists and physics is constrained by the requirements of causality (that effect cannot precede its cause). This puzzle has received intermittent attention from time to time, with a variety of arguments made to resolve the paradox. None of these, no matter how plausible, reveal the mechanism that resolves the existence of diamagnetism without sacrificing causality. The full resolution is presented in this letter."
  },
  {
    "title": "Low-temperature structural instabilities of the halide double perovskite Cs$_2$AgBiBr$_6$ investigated via x-ray diffraction and infrared phonons",
    "abstract": "The halide double perovskite Cs$_2$AgBiBr$_6$ has been proposed as a potential replacement for organic halide perovskites for photovoltaic applications. Further investigation of its dielectric response, optical properties and structural stability is thus warranted. Cs$_2$AgBiBr$_6$ exhibits a well-documented structural phase transition at 120 K but indications for an additional lower temperature ($\\sim$40 K) phase transition have also been reported. On the basis of measurements of the specific heat capacity, temperature dependent powder X-ray diffraction, low frequency capacitance, and infrared reflectivity we clarify the previously reported splitting of phonon modes in the Raman spectrum at $\\sim$40 K as due to a subtle structural phase transition from the tetragonal I4/m structure to a monoclinic $P12_1$/$n1$ crystal structure. The infrared active vibrational modes are experimentally investigated in the three structural regimes. In the cubic structure at room temperature the four IR active modes are observed at 135,$\\sim$95, 55, and $\\sim$25 cm$^{-1}$, as the symmetry reduces to tetragonal a minute splitting of these modes is expected, however below 40 K an additional mode is observed indicating a further reduction in symmetry."
  },
  {
    "title": "High-endurance mechanical switching in a DNA origami snap-through mechanism",
    "abstract": "Switchable elements are key components of dynamic technological and biological systems, enabling reversible transitions between well-defined states. Here, we present a DNA origami-based, mechanically bistable snap-through mechanism that can be electrically controlled. This nanoscale switch exhibits long-term stability in both states in the absence of external stimuli, while achieving millisecond-scale switching times upon application of an electric field. Individual devices sustain hundreds of thousands of switching cycles over several hours, offering a powerful platform for systematically studying the endurance and failure mechanisms of biomolecular nanoswitches. Functionalization with a gold nanorod further allows polarization-dependent optical modulation, opening avenues for applications in plasmonics. This versatile electromechanical interface has potential uses in molecular information processing, optical nanodevices, and the dynamic control of chemical reactions."
  },
  {
    "title": "Narrow-Line Electric Quadrupole Cooling And Background-Free Imaging Of A Single Cs Atom With Spatially Structured Light",
    "abstract": "We demonstrate background-free imaging and sideband cooling of a single 133Cs atom via the narrow-line 6S1/2 to 5D5/2 electric quadrupole transition in a 1064 nm optical tweezer. The 5D5/2 state decays through the 6P3/2 state to the ground state, emitting an 852 nm wavelength photon that allows for background-free imaging. By encoding both spin and orbital angular momentum onto the 685 nm excitation light, we achieve background-free fluorescence histograms with 99.58(3)% fidelity by positioning the atom at the dark center of a vortex beam. Tuning the tweezer polarization ellipticity realizes a magic trap for the stretched F = 4, mF = 4 to F' = 6, mF' = 6 cycling transition. We cool to 5 uK in a 1.1 mK trap and outline a strategy for ground-state cooling. We compare cooling performance across different sideband regimes, while also exploring how the orbital angular momentum of structured light controls the selection rules for quadrupole transitions. These results expand the toolbox for high-fidelity quantum control and cooling in alkali-atom tweezer arrays."
  },
  {
    "title": "On the uniqueness of the Kerr-(A)dS metric as a type II(D) solution in six dimensions",
    "abstract": "We study the class of six-dimensional $\\Lambda$-vacuum spacetimes which admit a non-degenerate multiple Weyl aligned null direction l (thus being of Weyl type~II or more special) with a ``generic'' optical matrix. Subject to an additional assumption on the asymptotic fall-off of the Weyl tensor, we obtain the most general metric of this class, which is specified by one discrete (normalized) and three continuous parameters. All solutions turn out to be Kerr--Schild spacetimes of type~D and, in passing, we comment on their Kerr--Schild double copy. We further show that the obtained family is locally isometric to the general doubly-spinning Kerr-NUT-(A)dS metric with the NUTs parameters switched off. In particular, the Kerr-(A)dS subclass and its extensions (i.e., analytic continuation and ``infinite-rotation'' limit) are recovered when certain polynomial metric functions are assumed to be fully factorized. As a side result, a unified metric form which encompasses all three branches of the extended Kerr-(A)dS family in all even dimensions is presented in an appendix."
  }
]